#include 'common.ch'
#include 'hbhash.ch'
#include 'function.ch'
#include 'chip_mo.ch'

// диспансеризация детей-сирот

// 23.09.25
function DDS_arr_etap( mdata, mobil )

  local arr_DDS_etap := {}
  // 1-номер периода
  // 2-начальный возраст {лет,месяцев} ( >= )
  // 3-конечный возраст {лет,месяцев} ( < )
  // 4-осмотры
  // 5-исследования {шифр,N} при N=0 - обязательно, при N=1 - необязательно

  default mobil to 0
  if mdata >= 0d20250901  // после 01 сентября 25 года
    AAdd( arr_DDS_etap, { 1, { 0, 0 }, { 0, 1 }, ;
      {}, ;
      { '4.26.100', '3.5.704' } } )
    AAdd( arr_DDS_etap, { 2, { 0, 1 }, { 0, 2 }, ;
      iif( mobil == 0, { '2.94.3', '2.94.4' }, { '2.94.13', '2.94.14' } ), ;
      { '8.1.701', '8.1.703', '8.1.704', '8.1.706', '8.2.701', '3.5.704' } } )
    AAdd( arr_DDS_etap, { 3, { 0, 2 }, { 0, 3 }, ;
      {}, ;
      {} } )
    AAdd( arr_DDS_etap, { 4, { 0, 3 }, { 0, 4 }, ;
      iif( mobil == 0, { '2.94.2', '2.94.6' }, { '2.94.12', '2.94.16' } ), ;
      { '4.11.736', '4.2.753' } } )
    AAdd( arr_DDS_etap, { 5, { 0, 4 }, { 0, 5 }, ;
      {}, ;
      {} } )
    AAdd( arr_DDS_etap, { 6, { 0, 5 }, { 0, 6 }, ;
      {}, ;
      {} } )
    AAdd( arr_DDS_etap, { 7, { 0, 6 }, { 0, 7 }, ;
      {}, ;
      {} } )
    AAdd( arr_DDS_etap, { 8, { 0, 7 }, { 0, 8 }, ;
      {}, ;
      {} } )
    AAdd( arr_DDS_etap, { 9, { 0, 8 }, { 0, 9 }, ;
      {}, ;
      {} } )
    AAdd( arr_DDS_etap, { 10, { 0, 9 }, { 0, 10 }, ;
      {}, ;
      {} } )
    AAdd( arr_DDS_etap, { 11, { 0, 10 }, { 0, 11 }, ;
      {}, ;
      {} } )
    AAdd( arr_DDS_etap, { 12, { 0, 11 }, { 1, 0 }, ;
      {}, ;
      {} } )
    AAdd( arr_DDS_etap, { 13, { 1, 0 }, { 1, 1 }, ;
      iif( mobil == 0, { '2.94.2', '2.94.3', '2.94.4', '2.94.7', '2.94.5' }, ;
        { '2.94.12', '2.94.13', '2.94.14', '2.94.17', '2.94.15' } ), ;
      { '4.2.753', '4.11.736', '13.1.701', '13.2.1', '13.2.2' } } )
    AAdd( arr_DDS_etap, { 14, { 1, 3 }, { 1, 4 }, ;
      {}, ;
      {} } )
    AAdd( arr_DDS_etap, { 15, { 1, 6 }, { 1, 7 }, ;
      iif( mobil == 0, { '2.94.2' }, { '2.94.12' } ), ;
      { '2.4.2' } } )
    AAdd( arr_DDS_etap, { 16, { 1, 11 }, { 2, 1 }, ;
      iif( mobil == 0, { '2.94.5', '2.4.1' }, { '2.94.15', '2.4.1' } ), ;
      { '2.4.2' } } )
    AAdd( arr_DDS_etap, { 17, { 2, 11 }, { 4, 0 }, ;
      iif( mobil == 0, { '2.94.2', '2.94.3', '2.94.4', '2.94.5', '2.94.7' }, ;
         { '2.94.12', '2.94.13', '2.94.14', '2.94.15', '2.94.17' } ), ;
      { '4.2.753', '4.11.736' } } )
    AAdd( arr_DDS_etap, { 18, { 4, 0 }, { 5, 0 }, ;
      iif( mobil == 0, { '2.94.5' }, { '2.94.15' } ), ;
      {} } )
    AAdd( arr_DDS_etap, { 19, { 5, 0 }, { 6, 0 }, ;
      iif( mobil == 0, { '2.94.5' }, { '2.94.15' } ), ;
      {} } )
    AAdd( arr_DDS_etap, { 20, { 6, 0 }, { 7, 0 }, ;
      iif( mobil == 0, { '2.94.2', '2.94.3', '2.94.5', '2.94.6', '2.94.4', '2.94.7', '2.4.1', '2.94.8', '2.94.9', '2.94.10' }, ;
         { '2.94.12', '2.94.13', '2.94.15', '2.94.16', '2.94.14', '2.94.17', '2.4.1', '2.94.18', '2.94.19', '2.94.20' } ), ;
      { '4.2.753', '4.11.736', '8.2.701', '8.1.703', '8.1.706', '13.1.701', '13.2.1', '4.29.2' } } )
    AAdd( arr_DDS_etap, { 21, { 7, 0 }, { 8, 0 }, ;
      iif( mobil == 0, { '2.94.2', '2.94.5', '2.94.4' }, { '2.94.12', '2.94.15', '2.94.14' } ), ;
      {} } )
    AAdd( arr_DDS_etap, { 22, { 8, 0 }, { 9, 0 }, ;
      iif( mobil == 0, { '2.94.5' }, { '2.94.15' } ), ;
      {} } )
    AAdd( arr_DDS_etap, { 23, { 9, 0 }, { 10, 0 }, ;
      iif( mobil == 0, { '2.94.5' }, { '2.94.5' } ), ;
      {} } )
    AAdd( arr_DDS_etap, { 24, { 10, 0 }, { 11, 0 }, ;
      iif( mobil == 0, { '2.94.2', '2.94.5', '2.94.10', '2.94.3', '2.94.4' }, ;
         { '2.94.12', '2.94.15', '2.94.20', '2.94.13', '2.94.14' } ), ;
      { '4.2.753', '4.11.736', '4.29.2' } } )
    AAdd( arr_DDS_etap, { 25, { 11, 0 }, { 12, 0 }, ;
      iif( mobil == 0, { '2.94.5' }, { '2.94.5' } ), ;
      {} } )
    AAdd( arr_DDS_etap, { 26, { 12, 0 }, { 13, 0 }, ;
      iif( mobil == 0, { '2.94.5', '2.4.1', '2.94.6' }, { '2.94.15', '2.4.1', '2.94.16' } ), ;
      {} } )
    AAdd( arr_DDS_etap, { 27, { 13, 0 }, { 14, 0 }, ;
      iif( mobil == 0, { '2.94.5', '2.94.8', '2.94.9', '2.94.4' }, { '2.94.15', '2.94.18', '2.94.19', '2.94.14' } ), ;
      {} } )
    AAdd( arr_DDS_etap, { 28, { 14, 0 }, { 15, 0 }, ;
      iif( mobil == 0, { '2.94.3', '2.4.1', '2.94.8', '2.94.9', '2.94.5' }, ;
         { '2.94.13', '2.4.1', '2.94.18', '2.94.19', '2.94.15' } ), ;
      {} } )
    AAdd( arr_DDS_etap, { 29, { 15, 0 }, { 16, 0 }, ;
      iif( mobil == 0, { '2.94.3', '2.94.5', '2.94.8', '2.94.9', '2.94.10', '2.94.2', '2.94.6', '2.94.4', '2.94.7', '2.4.1' }, ;
         { '2.94.13', '2.94.15', '2.94.18', '2.94.19', '2.94.20', '2.94.12', '2.94.16', '2.94.14', '2.94.17', '2.4.1' } ), ;
      { '4.2.753', '4.11.736', '8.2.701', '8.1.706', '13.1.701' } } )
    AAdd( arr_DDS_etap, { 30, { 16, 0 }, { 17, 0 }, ;
      iif( mobil == 0, { '2.94.3', '2.94.5', '2.94.2', '2.94.4', '2.94.8', '2.94.9', '2.4.1' }, ;
         { '2.94.13', '2.94.15', '2.94.12', '2.94.14', '2.94.18', '2.94.19', '2.4.1' } ), ;
      { '4.2.753', '4.11.736' } } )
    AAdd( arr_DDS_etap, { 31, { 17, 0 }, { 18, 0 }, ;
      iif( mobil == 0, { '2.94.3', '2.94.5', '2.94.10', '2.94.2', '2.94.6', '2.94.4', '2.94.7', '2.94.8', '2.94.9', '2.4.1' }, ;
         { '2.94.13', '2.94.15', '2.94.20', '2.94.12', '2.94.16', '2.94.14', '2.94.17', '2.94.18', '2.94.19', '2.4.1' } ), ;
      { '4.2.753', '4.11.736', '13.1.701' } } )
  endif
  return arr_DDS_etap

// 12.09.25
function dds_arr_osmotr_KDP2()

  static dds_osmotr_KDP2

  if HB_ISNIL( dds_osmotr_KDP2 )
    dds_osmotr_KDP2 := { ;
      { '2.83.1', '2.83.25' }, ; // пульмонолог
      { '2.83.2', '2.83.26' }, ; // дерматовенеролог
      { '2.83.3', '2.83.27' }, ; // ревматолог
      { '2.83.4', '2.83.28' }, ; // аллерголог-иммунолог
      { '2.83.5', '2.83.29' }, ; // детский кардиолог
      { '2.83.6', '2.83.30' }, ; // гастроэнтеролог
      { '2.83.7', '2.83.31' }, ; // нефролог
      { '2.83.8', '2.83.32' }, ; // гематолог
      { '2.83.9', '2.83.33' }, ; // инфекционист
      { '2.83.10', '2.83.34' }, ; // детский онколог
      { '2.83.11', '2.83.35' }, ; // нейрохирург
      { '2.83.12', '2.83.36' }, ; // колопроктолог
      { '2.83.13', '2.83.37' }, ; // сердечно-сосудистый хирург
      { '2.83.14', '2.83.38' }, ; // педиатр
      { '2.83.15', '2.83.39' }, ; // врач общей практики
      { '2.83.16', '2.83.40' }, ; // акушер-гинеколог (девочки)
      { '2.83.17', '2.83.41' }, ; // детский уролог-андролог (мальчики)
      { '2.83.18', '2.83.42' }, ; // детский хирург
      { '2.83.19', '2.83.43' }, ; // травматолог-ортопед
      { '2.83.20', '2.83.44' }, ; // невролог
      { '2.83.21', '2.83.45' }, ; // офтальмолог
      { '2.83.22', '2.83.46' }, ; // оториноларинголог
      { '2.83.23', '2.83.47' }, ; // детский стоматолог
      { '2.83.24', '2.83.48' };  // детский эндокринолог
    }
  endif
  return dds_osmotr_KDP2

// 29.09.25
function DDS_arr_issled( mdata )

  local arr_DDS_issled
  
  if mdata >= 0d20250901
    arr_DDS_issled := { ;
      { '4.26.100',   , 'скрининг на врожденные или наследственные заболевания', 0, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 } }, ;
      { '3.5.704',   , 'Аудиологический скрининг', 0, { 68, 96, 162 }, { 1134, 111101, 1111 } }, ;
      { '8.2.701',   , 'УЗИ органов брюшной полости (комплексное)', 0, 106, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 } }, ;
      { '8.1.706',   , 'УЗИ почек', 0, 106, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 } }, ;
      { '8.1.707',   , 'УЗИ щитовидной железы', 0, 106, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 } }, ;
      { '8.1.703',   , 'УЗИ сердца (эхокардиография)', 0, 106, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 } }, ;
      { '8.1.704',   , 'УЗИ тазобедренных суставов', 0, 106, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 } }, ;
      { '8.1.706','Ж', 'УЗИ УЗИ органов репродуктивной системы', 0, 106, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 } }, ;
      { '8.1.707','М', 'УЗИ УЗИ органов репродуктивной системы', 0, 106, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 } }, ;
      { '8.1.701',   , 'УЗИ головного мозга (нейросонография)', 0, 106, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 } }, ;
      { '13.1.701',   , 'Электрокардиография', 0, 111, { 110103, 110303, 110906, 111006, 111905, 112212, 112611, 113418, 113509, 180202, 2021 } }, ;
      { '4.29.2',   , 'исследование уровня холестерина в крови', 0, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 } }, ;
      { '4.29.3',   , 'Иммунодиагностика с применением аллергена бактерий с 2 туберкулиновыми единицами', 0, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 } }, ;
      { '4.29.4',   , 'Иммунодиагностика с применением аллергена туберкулезноого рекомбинантного в стандартном разведении', 0, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 } }, ;
      { '2.4.2',   , 'скрининг на выявление нарушений психического развития', 0, { 57, 68, 72, 73 }, { 1134, 1115, 111504 } }, ;
      { '13.2.1',   , 'исследование вызванное отоакустической эмиссией', 0, 162, { 1111, 111101 } }, ;
      { '13.2.2',   , 'офтальмоскопия в услових мидриаза', 0, 65, { 1112 } }, ;
      { '4.11.736',   , 'Клинический анализ крови', 0, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 } }, ;
      { '4.2.753',   , 'Клинический анализ мочи', 0, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 } } ;
    }
// исправить нижеследующее
//      { '7.2.702',   , 'Рентгенография органов грудной клетки', 0, 162, { 1111, 111101 } }, ;
  else
    arr_DDS_issled := { ;
      { '4.2.153',   , 'Клинический анализ мочи', 0, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 } }, ;
      { '4.11.136',   , 'Клинический анализ крови', 0, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 } }, ;
      { '4.12.169',   , 'Исследование уровня глюкозы в крови', 0, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 } }, ;
      { '13.1.1',   , 'Электрокардиография', 0, 111, { 110103, 110303, 110906, 111006, 111905, 112212, 112611, 113418, 113509, 180202, 2021 } }, ;
      { '7.61.3',   , 'Флюорография легких (с 15 лет)', 0, 78, { 1118, 1802, 2020 } }, ;
      { '8.1.1',   , 'УЗИ головного мозга (нейросонография)', 0, 106, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 } }, ;
      { '8.1.2',   , 'УЗИ щитовидной железы', 0, 106, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 } }, ;
      { '8.1.3',   , 'УЗИ сердца (эхокардиография)', 0, 106, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 } }, ;
      { '8.1.4',   , 'УЗИ тазобедренных суставов', 0, 106, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 } }, ;
      { '8.2.1',   , 'УЗИ органов брюшной полости (комплексное)', 0, 106, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 } }, ;
      { '8.2.2','Ж', 'УЗИ органов репродуктивной системы', 0, 106, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 } }, ;
      { '8.2.3','М', 'УЗИ органов репродуктивной системы', 0, 106, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 } } ;
    }
//    AAdd( dds_iss, { 'Клинический анализ мочи', '', 0, 17, { 34 }, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 }, { '4.2.153' } } )
//    AAdd( dds_iss, { 'Клинический анализ крови', '', 0, 17, { 34 }, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 }, { '4.11.136' } } )
//    AAdd( dds_iss, { 'Исследование уровня глюкозы в крови', '', 0, 17, { 34 }, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 }, { '4.12.169' } } )
//    AAdd( dds_iss, { 'Электрокардиография', '', 0, 17, { 111 }, { 110103, 110303, 110906, 111006, 111905, 112212, 112611, 113418, 113509, 180202, 2021 }, { '13.1.1' } } )
//    AAdd( dds_iss, { 'Флюорография легких (с 15 лет)', '', 15, 17, { 78 }, { 1118, 1802, 2020 }, { '7.61.3' } } )
//    AAdd( dds_iss, { 'УЗИ головного мозга (нейросонография) (до 1 года)', '', 0, 0, { 106 }, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 }, { '8.1.1' } } )
//    AAdd( dds_iss, { 'УЗИ щитовидной железы (с 7 лет)', '', 7, 17, { 106 }, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 }, { '8.1.2' } } )
//    AAdd( dds_iss, { 'УЗИ сердца', '', 0, 17, { 106 }, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 }, { '8.1.3' } } )
//    AAdd( dds_iss, { 'УЗИ тазобедренных суставов (до 1 года)', '', 0, 0, { 106 }, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 }, { '8.1.4' } } )
//    AAdd( dds_iss, { 'УЗИ органов брюшной полости комплексное профилактическое', '', 0, 17, { 106 }, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 }, { '8.2.1' } } )
//    AAdd( dds_iss, { 'УЗИ органов репродуктивной системы', '', 7, 17, { 106 }, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 }, { '8.2.2', '8.2.3' } } )

  endif
  return arr_DDS_issled

// 25.09.25
function dds_arr_iss( mdata )

  local dds_iss

  default mdata to Date()
  dds_iss := {}
  if mdata >= 0d20250901 
  else 
    AAdd( dds_iss, { 'Клинический анализ мочи', '', 0, 17, { 34 }, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 }, { '4.2.153' } } )
    AAdd( dds_iss, { 'Клинический анализ крови', '', 0, 17, { 34 }, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 }, { '4.11.136' } } )
    AAdd( dds_iss, { 'Исследование уровня глюкозы в крови', '', 0, 17, { 34 }, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 }, { '4.12.169' } } )
    AAdd( dds_iss, { 'Электрокардиография', '', 0, 17, { 111 }, { 110103, 110303, 110906, 111006, 111905, 112212, 112611, 113418, 113509, 180202, 2021 }, { '13.1.1' } } )
    AAdd( dds_iss, { 'Флюорография легких (с 15 лет)', '', 15, 17, { 78 }, { 1118, 1802, 2020 }, { '7.61.3' } } )
    AAdd( dds_iss, { 'УЗИ головного мозга (нейросонография) (до 1 года)', '', 0, 0, { 106 }, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 }, { '8.1.1' } } )
    AAdd( dds_iss, { 'УЗИ щитовидной железы (с 7 лет)', '', 7, 17, { 106 }, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 }, { '8.1.2' } } )
    AAdd( dds_iss, { 'УЗИ сердца', '', 0, 17, { 106 }, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 }, { '8.1.3' } } )
    AAdd( dds_iss, { 'УЗИ тазобедренных суставов (до 1 года)', '', 0, 0, { 106 }, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 }, { '8.1.4' } } )
    AAdd( dds_iss, { 'УЗИ органов брюшной полости комплексное профилактическое', '', 0, 17, { 106 }, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 }, { '8.2.1' } } )
    AAdd( dds_iss, { 'УЗИ органов репродуктивной системы', '', 7, 17, { 106 }, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 }, { '8.2.2', '8.2.3' } } )
  endif
  return dds_iss

// 25.09.25
function dds_arr_osm1( mdata )

  local dds_osm1

  default mdata to Date()
  dds_osm1 := {}
  if mdata >= 0d20250901
  else
    AAdd( dds_osm1, { 'офтальмолог', '', 0, 17, { 65 }, { 1112 }, { '2.83.21' } } )
    AAdd( dds_osm1, { 'оториноларинголог', '', 0, 17, { 162, 64 }, { 1111, 111101 }, { '2.83.22' } } )
    AAdd( dds_osm1, { 'детский хирург', '', 0, 17, { 20 }, { 1135 }, { '2.83.18' } } )
    AAdd( dds_osm1, { 'травматолог-ортопед', '', 0, 17, { 100 }, { 1123 }, { '2.83.19' } } )
    AAdd( dds_osm1, { 'акушер-гинеколог (девочки)', 'Ж', 0, 17, { 136, 2 }, { 1101 }, { '2.83.16' } } )
    AAdd( dds_osm1, { 'детский уролог-андролог (мальчики)', 'М', 0, 17, { 19 }, { 112603, 113502 }, { '2.83.17' } } )
    AAdd( dds_osm1, { 'детский стоматолог', '', 3, 17, { 86 }, { 1401, 140102 }, { '2.83.23' } } )
    AAdd( dds_osm1, { 'детский эндокринолог', '', 5, 17, { 21 }, { 1127, 112702, 113402 }, { '2.83.24' } } )
    AAdd( dds_osm1, { 'невролог', '', 0, 17, { 53 }, { 1109 }, { '2.83.20' } } )
    AAdd( dds_osm1, { 'психиатр', '', 0, 17, { 72 }, { 1115 }, { '2.4.1' } } )
    AAdd( dds_osm1, { 'педиатр', '', 0, 17, { 68, 57 }, { 1134, 1110 }, { '2.83.14', '2.83.15' } } )
  endif
  return dds_osm1

// 25.09.25
function dds_arr_osm2( mdata )

  local dds_osm2

  default mdata to Date()
  dds_osm2 := {}
  if mdata >= 0d20250901
    AAdd( dds_osm2, { 'пульмонолог', '', 0, 17, { 75 }, { 113413, 112208, 112501 }, { '2.83.49' } } )
    AAdd( dds_osm2, { 'дерматовенеролог', '', 0, 17, { 16 }, { 1104 }, { '2.83.50' } } )
    AAdd( dds_osm2, { 'ревматолог', '', 0, 17, { 77 }, { 113414, 112209 }, { '2.83.51' } } )
    AAdd( dds_osm2, { 'аллерголог-иммунолог', '', 0, 17, { 4 }, { 113405, 112214 }, { '2.83.52' } } )
    AAdd( dds_osm2, { 'детский кардиолог', '', 0, 17, { 17 }, { 113403 }, { '2.83.53' } } )
    AAdd( dds_osm2, { 'гастроэнтеролог', '', 0, 17, { 11 }, { 113407, 112201 }, { '2.83.54' } } )
    AAdd( dds_osm2, { 'нефролог', '', 0, 17, { 56 }, { 113412, 112207 }, { '2.83.55' } } )
    AAdd( dds_osm2, { 'гематолог', '', 0, 17, { 12 }, { 113408, 112202 }, { '2.83.46', '2.3.18' } } )
    AAdd( dds_osm2, { 'инфекционист', '', 0, 17, { 28 }, { 1106 }, { '2.83.579' } } )
    AAdd( dds_osm2, { 'детский онколог', '', 0, 17, { 18 }, { 113401, 112801, 113501 }, { '2.83.58', '2.3.19' } } )
    AAdd( dds_osm2, { 'нейрохирург', '', 0, 17, { 54 }, { 112602, 113504 }, { '2.83.59' } } )
    AAdd( dds_osm2, { 'колопроктолог', '', 0, 17, { 30 }, { 112601, 113503 }, { '2.83.60' } } )
    AAdd( dds_osm2, { 'сердечно-сосудистый хирург', '', 0, 17, { 81 }, { 112604, 113505 }, { '2.83.61' } } )
//    AAdd( dds_osm2, { 'педиатр', '', 0, 17, { 68, 57 }, { 1134, 1110 }, { '2.83.14', '2.83.15' } } )
  else
    AAdd( dds_osm2, { 'пульмонолог', '', 0, 17, { 75 }, { 113413, 112208, 112501 }, { '2.83.1' } } )
    AAdd( dds_osm2, { 'дерматовенеролог', '', 0, 17, { 16 }, { 1104 }, { '2.83.2' } } )
    AAdd( dds_osm2, { 'ревматолог', '', 0, 17, { 77 }, { 113414, 112209 }, { '2.83.3' } } )
    AAdd( dds_osm2, { 'аллерголог-иммунолог', '', 0, 17, { 4 }, { 113405, 112214 }, { '2.83.4' } } )
    AAdd( dds_osm2, { 'детский кардиолог', '', 0, 17, { 17 }, { 113403 }, { '2.83.5' } } )
    AAdd( dds_osm2, { 'гастроэнтеролог', '', 0, 17, { 11 }, { 113407, 112201 }, { '2.83.6' } } )
    AAdd( dds_osm2, { 'нефролог', '', 0, 17, { 56 }, { 113412, 112207 }, { '2.83.7' } } )
    AAdd( dds_osm2, { 'гематолог', '', 0, 17, { 12 }, { 113408, 112202 }, { '2.83.8', '2.3.1' } } )
    AAdd( dds_osm2, { 'инфекционист', '', 0, 17, { 28 }, { 1106 }, { '2.83.9' } } )
    AAdd( dds_osm2, { 'детский онколог', '', 0, 17, { 18 }, { 113401, 112801, 113501 }, { '2.83.10', '2.3.1' } } )
    AAdd( dds_osm2, { 'нейрохирург', '', 0, 17, { 54 }, { 112602, 113504 }, { '2.83.11' } } )
    AAdd( dds_osm2, { 'колопроктолог', '', 0, 17, { 30 }, { 112601, 113503 }, { '2.83.12' } } )
    AAdd( dds_osm2, { 'сердечно-сосудистый хирург', '', 0, 17, { 81 }, { 112604, 113505 }, { '2.83.13' } } )
    AAdd( dds_osm2, { 'педиатр', '', 0, 17, { 68, 57 }, { 1134, 1110 }, { '2.83.14', '2.83.15' } } )
  endif
  return dds_osm2

// 13.09.25
function mm_kateg_uch()

  static kateg_uch

  if HB_ISNIL( kateg_uch )
    kateg_uch := { ;
      { 'ребенок-сирота', 0 }, ;
      { 'ребенок, оставшийся без попечения родителей', 1 }, ;
      { 'ребенок, находящийся в трудной жизненной ситуации', 2 }, ;
      { 'нет категории', 3 } ;
    }
  endif
  return kateg_uch

// 13.09.25
function mm_gde_nahod()

  static gde_nahod

  if HB_ISNIL( gde_nahod )
    gde_nahod := { ;
      { 'в стационарном учреждении', 0 }, ;
      { 'под опекой', 1 }, ;
      { 'под попечительством', 2 }, ;
      { 'передан в приемную семью', 3 }, ;
      { 'передан в патронатную семью', 4 }, ;
      { 'усыновлен (удочерена)', 5 }, ;
      { 'другое', 6 } ;
    }
  endif
  return gde_nahod

// 13.09.25
function mm_prich_vyb()

  static prich_vyb

  if HB_ISNIL( prich_vyb )
    prich_vyb := { ;
      { 'не выбыл', 0 }, ;
      { 'опека', 1 }, ;
      { 'попечительство', 2 }, ;
      { 'усыновление (удочерение)', 3 }, ;
      { 'передан в приемную семью', 4 }, ;
      { 'передан в патронатную семью', 5 }, ;
      { 'выбыл в другое стационарное учреждение', 6 }, ;
      { 'выбыл по возрасту', 7 }, ;
      { 'смерть', 8 }, ;
      { 'другое', 9 } ;
    }
  endif
  return prich_vyb
