#include 'common.ch'
#include 'hbhash.ch'
#include 'function.ch'
#include 'chip_mo.ch'

function mm_fiz_razv()
  return { { 'нормальное', 0 }, { 'с отклонениями', 1 } }

function mm_fiz_razv1()
  return { { 'нет    ', 0 }, { 'дефицит', 1 }, { 'избыток', 2 } }
  
function mm_fiz_razv2()
  return { { 'нет    ', 0 }, { 'низкий ', 1 }, { 'высокий', 2 } }
  
function mm_psih2()
  return { { 'норма', 0 }, { 'отклонение', 1 } }

function mm_142me3()
  return { { 'регулярные', 0 }, { 'нерегулярные', 1 } }

function mm_142me4()
  return { { 'обильные', 0 }, { 'умеренные', 1 }, { 'скудные', 2 } }
  
function mm_142me5()
  return { { 'болезненные', 0 }, { 'безболезненные', 1 } }
  
// 20.09.25
function mm_dispans()
  return { { 'ранее', 1 }, { 'впервые', 2 }, { 'не уст.', 0 } }

// 20.09.25
function mm_usl()
  return { { 'амб.', 0 }, { 'дн/с', 1 }, { 'стац', 2 } }
  
// 20.09.25
function mm_uch()
  return { { 'МУЗ ', 1 }, { 'ГУЗ ', 0 }, { 'фед.', 2 }, { 'част', 3 } }

// 20.09.25
function mm_gr_fiz_do()
  return { { 'I', 1 }, { 'II', 2 }, { 'III', 3 }, { 'IV', 4 } }

function mm_invalid2()
  return { { 'с рождения', 0 }, { 'приобретенная', 1 } }
  
function mm_invalid5()
  
  local arr := { ;
    { 'некоторые инфекционные и паразитарные,', 1 }, ;
    { ' из них: туберкулез,', 101 }, ;
    { '         сифилис,', 201 }, ;
    { '         ВИЧ-инфекция;', 301 }, ;
    { 'новообразования;', 2 }, ;
    { 'болезни крови, кроветворных органов ...', 3 }, ;
    { 'болезни эндокринной системы ...', 4 }, ;
    { ' из них: сахарный диабет;', 104 }, ;
    { 'психические расстройства и расстройства поведения,', 5 }, ;
    { ' в том числе умственная отсталость;', 105 }, ;
    { 'болезни нервной системы,', 6 }, ;
    { ' из них: церебральный паралич,', 106 }, ;
    { '         другие паралитические синдромы;', 206 }, ;
    { 'болезни глаза и его придаточного аппарата;', 7 }, ;
    { 'болезни уха и сосцевидного отростка;', 8 }, ;
    { 'болезни системы кровообращения;', 9 }, ;
    { 'болезни органов дыхания,', 10 }, ;
    { ' из них: астма,', 110 }, ;
    { '         астматический статус;', 210 }, ;
    { 'болезни органов пищеварения;', 11 }, ;
    { 'болезни кожи и подкожной клетчатки;', 12 }, ;
    { 'болезни костно-мышечной системы и соединительной ткани;', 13 }, ;
    { 'болезни мочеполовой системы;', 14 }, ;
    { 'отдельные состояния, возникающие в перинатальном периоде;', 15 }, ;
    { 'врожденные аномалии,', 16 }, ;
    { ' из них: аномалии нервной системы,', 116 }, ;
    { '         аномалии системы кровообращения,', 216 }, ;
    { '         аномалии опорно-двигательного аппарата;', 316 }, ;
    { 'последствия травм, отравлений и др.', 17 } ;
  }
  return arr

function mm_invalid6()
  
  local arr := { ;
    { 'умственные', 1 }, ;
    { 'другие психологические', 2 }, ;
    { 'языковые и речевые', 3 }, ;
    { 'слуховые и вестибулярные', 4 }, ;
    { 'зрительные', 5 }, ;
    { 'висцеральные и метаболические расстройства питания', 6 }, ;
    { 'двигательные', 7 }, ;
    { 'уродующие', 8 }, ;
    { 'общие и генерализованные', 9 } ;
  }
  return arr
  
function mm_invalid8()
  return { { 'полностью', 1 }, { 'частично', 2 }, { 'начата', 3 }, { 'не выполнена', 0 } }
  
function mm_privivki1()
  
  local arr := { ;
    { 'привит по возрасту', 0 }, ;
    { 'не привит по медицинским показаниям', 1 }, ;
    { 'не привит по другим причинам', 2 } ;
  }
  return arr
  
function mm_privivki2()
  return { { 'полностью', 1 }, { 'частично', 2 } }

// 23.09.25
function np_arr_1_etap( mdata, mobil )

  local arr_PN_1_etap := {}
  // 1-номер периода
  // 2-начальный возраст {лет,месяцев} ( >= )
  // 3-конечный возраст {лет,месяцев} ( < )
  // 4-осмотры
  // 5-исследования {шифр,N} при N=0 - обязательно, при N=1 - необязательно

  default mobil to 0
  if mdata >= 0d20250901  // после 01 сентбря 25 года
    AAdd( arr_PN_1_etap, { 1, { 0, 0 }, { 0, 1 }, ;
      {}, ;
      { '4.26.100', '3.5.704' } } )
    AAdd( arr_PN_1_etap, { 2, { 0, 1 }, { 0, 2 }, ;
      iif( mobil == 0, { '2.94.3', '2.94.4' }, { '2.94.13', '2.94.14' } ), ;
      { '8.1.701', '8.1.703', '8.1.704', '8.1.706', '8.2.701', '3.5.704' } } )
    AAdd( arr_PN_1_etap, { 3, { 0, 2 }, { 0, 3 }, ;
      {}, ;
      {} } )
    AAdd( arr_PN_1_etap, { 4, { 0, 3 }, { 0, 4 }, ;
      iif( mobil == 0, { '2.94.2', '2.94.6' }, { '2.94.12', '2.94.16' } ), ;
      { '4.11.736', '4.2.753' } } )
    AAdd( arr_PN_1_etap, { 5, { 0, 4 }, { 0, 5 }, ;
      {}, ;
      {} } )
    AAdd( arr_PN_1_etap, { 6, { 0, 5 }, { 0, 6 }, ;
      {}, ;
      {} } )
    AAdd( arr_PN_1_etap, { 7, { 0, 6 }, { 0, 7 }, ;
      {}, ;
      {} } )
    AAdd( arr_PN_1_etap, { 8, { 0, 7 }, { 0, 8 }, ;
      {}, ;
      {} } )
    AAdd( arr_PN_1_etap, { 9, { 0, 8 }, { 0, 9 }, ;
      {}, ;
      {} } )
    AAdd( arr_PN_1_etap, { 10, { 0, 9 }, { 0, 10 }, ;
      {}, ;
      {} } )
    AAdd( arr_PN_1_etap, { 11, { 0, 10 }, { 0, 11 }, ;
      {}, ;
      {} } )
    AAdd( arr_PN_1_etap, { 12, { 0, 11 }, { 1, 0 }, ;
      {}, ;
      {} } )
    AAdd( arr_PN_1_etap, { 13, { 1, 0 }, { 1, 1 }, ;
      iif( mobil == 0, { '2.94.2', '2.94.3', '2.94.4', '2.94.7', '2.94.5' }, ;
        { '2.94.12', '2.94.13', '2.94.14', '2.94.17', '2.94.15' } ), ;
      { '4.2.753', '4.11.736', '13.1.701', '13.2.1', '13.2.2' } } )
    AAdd( arr_PN_1_etap, { 14, { 1, 3 }, { 1, 4 }, ;
      {}, ;
      {} } )
    AAdd( arr_PN_1_etap, { 15, { 1, 6 }, { 1, 7 }, ;
      iif( mobil == 0, { '2.94.2' }, { '2.94.12' } ), ;
      { '2.4.2' } } )
    AAdd( arr_PN_1_etap, { 16, { 1, 11 }, { 2, 1 }, ;
      iif( mobil == 0, { '2.94.5', '2.4.1' }, { '2.94.15', '2.4.1' } ), ;
      { '2.4.2' } } )
    AAdd( arr_PN_1_etap, { 17, { 2, 11 }, { 4, 0 }, ;
      iif( mobil == 0, { '2.94.2', '2.94.3', '2.94.4', '2.94.5', '2.94.7' }, ;
         { '2.94.12', '2.94.13', '2.94.14', '2.94.15', '2.94.17' } ), ;
      { '4.2.753', '4.11.736' } } )
    AAdd( arr_PN_1_etap, { 18, { 4, 0 }, { 5, 0 }, ;
      iif( mobil == 0, { '2.94.5' }, { '2.94.15' } ), ;
      {} } )
    AAdd( arr_PN_1_etap, { 19, { 5, 0 }, { 6, 0 }, ;
      iif( mobil == 0, { '2.94.5' }, { '2.94.15' } ), ;
      {} } )
    AAdd( arr_PN_1_etap, { 20, { 6, 0 }, { 7, 0 }, ;
      iif( mobil == 0, { '2.94.2', '2.94.3', '2.94.5', '2.94.6', '2.94.4', '2.94.7', '2.4.1', '2.94.8', '2.94.9', '2.94.10' }, ;
         { '2.94.12', '2.94.13', '2.94.15', '2.94.16', '2.94.14', '2.94.17', '2.4.1', '2.94.18', '2.94.19', '2.94.20' } ), ;
      { '4.2.753', '4.11.736', '8.2.701', '8.1.703', '8.1.706', '13.1.701', '13.2.1', '4.29.2' } } )
    AAdd( arr_PN_1_etap, { 21, { 7, 0 }, { 8, 0 }, ;
      iif( mobil == 0, { '2.94.2', '2.94.5', '2.94.4' }, { '2.94.12', '2.94.15', '2.94.14' } ), ;
      {} } )
    AAdd( arr_PN_1_etap, { 22, { 8, 0 }, { 9, 0 }, ;
      iif( mobil == 0, { '2.94.5' }, { '2.94.15' } ), ;
      {} } )
    AAdd( arr_PN_1_etap, { 23, { 9, 0 }, { 10, 0 }, ;
      iif( mobil == 0, { '2.94.5' }, { '2.94.5' } ), ;
      {} } )
    AAdd( arr_PN_1_etap, { 24, { 10, 0 }, { 11, 0 }, ;
      iif( mobil == 0, { '2.94.2', '2.94.5', '2.94.10', '2.94.3', '2.94.4' }, ;
         { '2.94.12', '2.94.15', '2.94.20', '2.94.13', '2.94.14' } ), ;
      { '4.2.753', '4.11.736', '4.29.2' } } )
    AAdd( arr_PN_1_etap, { 25, { 11, 0 }, { 12, 0 }, ;
      iif( mobil == 0, { '2.94.5' }, { '2.94.5' } ), ;
      {} } )
    AAdd( arr_PN_1_etap, { 26, { 12, 0 }, { 13, 0 }, ;
      iif( mobil == 0, { '2.94.5', '2.4.1', '2.94.6' }, { '2.94.15', '2.4.1', '2.94.16' } ), ;
      {} } )
    AAdd( arr_PN_1_etap, { 27, { 13, 0 }, { 14, 0 }, ;
      iif( mobil == 0, { '2.94.5', '2.94.8', '2.94.9', '2.94.4' }, { '2.94.15', '2.94.18', '2.94.19', '2.94.14' } ), ;
      {} } )
    AAdd( arr_PN_1_etap, { 28, { 14, 0 }, { 15, 0 }, ;
      iif( mobil == 0, { '2.94.3', '2.4.1', '2.94.8', '2.94.9', '2.94.5' }, ;
         { '2.94.13', '2.4.1', '2.94.18', '2.94.19', '2.94.15' } ), ;
      {} } )
    AAdd( arr_PN_1_etap, { 29, { 15, 0 }, { 16, 0 }, ;
      iif( mobil == 0, { '2.94.3', '2.94.5', '2.94.8', '2.94.9', '2.94.10', '2.94.2', '2.94.6', '2.94.4', '2.94.7', '2.4.1' }, ;
         { '2.94.13', '2.94.15', '2.94.18', '2.94.19', '2.94.20', '2.94.12', '2.94.16', '2.94.14', '2.94.17', '2.4.1' } ), ;
      { '4.2.753', '4.11.736', '8.2.701', '8.1.706', '13.1.701' } } )
    AAdd( arr_PN_1_etap, { 30, { 16, 0 }, { 17, 0 }, ;
      iif( mobil == 0, { '2.94.3', '2.94.5', '2.94.2', '2.94.4', '2.94.8', '2.94.9', '2.4.1' }, ;
         { '2.94.13', '2.94.15', '2.94.12', '2.94.14', '2.94.18', '2.94.19', '2.4.1' } ), ;
      { '4.2.753', '4.11.736' } } )
    AAdd( arr_PN_1_etap, { 31, { 17, 0 }, { 18, 0 }, ;
      iif( mobil == 0, { '2.94.3', '2.94.5', '2.94.10', '2.94.2', '2.94.6', '2.94.4', '2.94.7', '2.94.8', '2.94.9', '2.4.1' }, ;
         { '2.94.13', '2.94.15', '2.94.20', '2.94.12', '2.94.16', '2.94.14', '2.94.17', '2.94.18', '2.94.19', '2.4.1' } ), ;
      { '4.2.753', '4.11.736', '13.1.701' } } )

  else
    AAdd( arr_PN_1_etap, { 1, { 0, 0 }, { 0, 1 }, ;
      {}, ;
      { '4.26.1', '4.26.2', '4.26.3', '4.26.4', '4.26.5', '3.5.4' } } )
    AAdd( arr_PN_1_etap, { 2, { 0, 1 }, { 0, 2 }, ;
      { '2.85.18', '2.85.20', '2.85.21', '2.85.23' }, ;
      { '8.1.1', '8.1.3', '8.1.4', '8.1.6', '8.2.1', '3.5.4' } } )
    AAdd( arr_PN_1_etap, { 3, { 0, 2 }, { 0, 3 }, ;
      {}, ;
      { '4.2.153', '4.11.136' } } )
    AAdd( arr_PN_1_etap, { 4, { 0, 3 }, { 0, 4 }, ;
      { '2.85.19' }, ;
      { '3.5.4' } } )
    AAdd( arr_PN_1_etap, { 5, { 0, 4 }, { 0, 5 }, ;
      {}, ;
      {} } )
    AAdd( arr_PN_1_etap, { 6, { 0, 5 }, { 0, 6 }, ;
      {}, ;
      {} } )
    AAdd( arr_PN_1_etap, { 7, { 0, 6 }, { 0, 7 }, ;
      {}, ;
      {} } )
    AAdd( arr_PN_1_etap, { 8, { 0, 7 }, { 0, 8 }, ;
      {}, ;
      {} } )
    AAdd( arr_PN_1_etap, { 9, { 0, 8 }, { 0, 9 }, ;
      {}, ;
      {} } )
    AAdd( arr_PN_1_etap, { 10, { 0, 9 }, { 0, 10 }, ;
      {}, ;
      {} } )
    AAdd( arr_PN_1_etap, { 11, { 0, 10 }, { 0, 11 }, ;
      {}, ;
      {} } )
    AAdd( arr_PN_1_etap, { 12, { 0, 11 }, { 1, 0 }, ;
      {}, ;
      {} } )
    AAdd( arr_PN_1_etap, { 13, { 1, 0 }, { 1, 1 }, ;
      { '2.85.18', '2.85.19', '2.85.20', '2.85.21', '2.85.22' }, ; // '2.85.21' с 1 сентября
      { '4.2.153', '4.11.136', '13.1.1' } } )
    AAdd( arr_PN_1_etap, { 14, { 1, 3 }, { 1, 4 }, ;
      {}, ;
      {} } )
    AAdd( arr_PN_1_etap, { 15, { 1, 6 }, { 1, 7 }, ;
      {}, ;
      {} } )
    AAdd( arr_PN_1_etap, { 16, { 1, 11 }, { 2, 1 }, ;  // не позднее 31 декабря
      { '2.85.23', '2.4.1', '2.4.2' }, ;
      {} } )
    AAdd( arr_PN_1_etap, { 17, { 2, 11 }, { 4, 0 }, ;  // не позднее 31 декабря
      { '2.85.20', '2.85.18', '2.85.23', '2.85.21', '2.85.22', '2.85.16', '2.85.17' }, ;
      { '4.2.153', '4.11.136' } } )
    AAdd( arr_PN_1_etap, { 18, { 4, 0 }, { 5, 0 }, ;
      { '2.85.23' }, ;
      {} } )
    AAdd( arr_PN_1_etap, { 19, { 5, 0 }, { 6, 0 }, ;
      { '2.85.23' }, ;
      {} } )
    AAdd( arr_PN_1_etap, { 20, { 6, 0 }, { 7, 0 }, ;
      { '2.85.20', '2.85.18', '2.85.23', '2.85.24', '2.85.19', '2.85.21', '2.85.22', '2.4.1', '2.85.16', '2.85.17' }, ;
      { '4.2.153', '4.11.136', '8.2.1', '8.1.3', '8.1.6', '13.1.1' } } )
    AAdd( arr_PN_1_etap, { 21, { 7, 0 }, { 8, 0 }, ;
      { '2.85.20', '2.85.23', '2.85.21', '2.85.22' }, ;
      { '4.2.153', '4.11.136' } } )
    AAdd( arr_PN_1_etap, { 22, { 8, 0 }, { 9, 0 }, ;
      { '2.85.23' }, ;
      {} } )
    AAdd( arr_PN_1_etap, { 23, { 9, 0 }, { 10, 0 }, ;
      { '2.85.23' }, ;
      {} } )
    AAdd( arr_PN_1_etap, { 24, { 10, 0 }, { 11, 0 }, ;
      { '2.85.20', '2.85.23', '2.85.24', '2.85.19', '2.85.21' }, ;
      { '4.2.153', '4.11.136' } } )
    AAdd( arr_PN_1_etap, { 25, { 11, 0 }, { 12, 0 }, ;
      { '2.85.23' }, ;
      {} } )
    AAdd( arr_PN_1_etap, { 26, { 12, 0 }, { 13, 0 }, ;
      { '2.85.23' }, ;
      {} } )
    AAdd( arr_PN_1_etap, { 27, { 13, 0 }, { 14, 0 }, ;
      { '2.85.23', '2.85.21' }, ;
      {} } )
    AAdd( arr_PN_1_etap, { 28, { 14, 0 }, { 15, 0 }, ;
      { '2.85.23', '2.85.16', '2.85.17', '2.4.1' }, ;
      {} } )
    AAdd( arr_PN_1_etap, { 29, { 15, 0 }, { 16, 0 }, ;
      { '2.85.18', '2.85.23', '2.85.17', '2.85.24', '2.85.20', '2.85.19', '2.85.21', '2.85.22', '2.85.16', '2.4.1' }, ;
      { '4.2.153', '4.11.136', '8.2.1', '8.1.6', '13.1.1' } } )
    AAdd( arr_PN_1_etap, { 30, { 16, 0 }, { 17, 0 }, ;
      { '2.85.18', '2.85.23', '2.85.17', '2.85.24', '2.85.20', '2.85.19', '2.85.21', '2.85.22', '2.85.16', '2.4.1' }, ;
      { '4.2.153', '4.11.136' } } )
    AAdd( arr_PN_1_etap, { 31, { 17, 0 }, { 18, 0 }, ;
      { '2.85.18', '2.85.23', '2.85.17', '2.85.24', '2.85.20', '2.85.19', '2.85.21', '2.85.22', '2.85.16', '2.4.1' }, ;
      { '4.2.153', '4.11.136', '13.1.1' } } )
  endif
  return arr_PN_1_etap

// 29.09.25
function np_arr_issled( mdata )

  local arr_PN_issled
  
  if mdata >= 0d20250901
    arr_PN_issled := { ;
      { '3.5.704',   , 'Аудиологический скрининг', 0, { 68, 96, 162 }, { 1134, 111101, 1111 } }, ;
      { '4.2.753',   , 'Клинический анализ мочи', 0, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 } }, ;
      { '4.11.736',   , 'Клинический анализ крови', 0, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 } }, ;
      { '4.26.100',   , 'скрининг на врожденные или наследственные заболевания', 0, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 } }, ;
      { '4.29.2',   , 'исследование уровня холестерина в крови', 0, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 } }, ;
      { '8.1.701',   , 'УЗИ головного мозга (нейросонография)', 0, 106, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 } }, ;
      { '8.1.703',   , 'УЗИ сердца (эхокардиография)', 0, 106, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 } }, ;
      { '8.1.704',   , 'УЗИ тазобедренных суставов', 0, 106, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 } }, ;
      { '8.1.706',   , 'УЗИ почек', 0, 106, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 } }, ;
      { '8.2.701',   , 'УЗИ органов брюшной полости (комплексное)', 0, 106, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 } }, ;
      { '13.1.701',   , 'Электрокардиография', 0, 111, { 110103, 110303, 110906, 111006, 111905, 112212, 112611, 113418, 113509, 180202, 2021 } }, ;
      { '13.2.1',   , 'исследование вызванное отоакустической эмиссией', 0, 162, { 1111, 111101 } }, ;
      { '13.2.2',   , 'офтальмоскопия в услових мидриаза', 0, 65, { 1112 } }, ;
      { '2.4.2',   , 'скрининг на выявление нарушений психического развития', 0, { 57, 68, 72, 73 }, { 1134, 1115, 111504 } } ;
    }
  else
    arr_PN_issled := { ;
      { '3.5.4',   , 'Аудиологический скрининг', 0, { 68, 96, 162 }, { 1134, 111101, 1111 } }, ;
      { '4.2.153',   , 'Клинический анализ мочи', 0, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 } }, ;
      { '4.11.136',   , 'Клинический анализ крови', 0, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 } }, ;
      { '4.26.1',   , 'Неонатальный скрининг на гипотиреоз', 0, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 } }, ;
      { '4.26.2',   , 'Неонатальный скрининг на фенилкетонурию', 0, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 } }, ;
      { '4.26.3',   , 'Неонатальный скрининг на адреногенитальный синдром', 0, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 } }, ;
      { '4.26.4',   , 'Неонатальный скрининг на муковисцидоз', 0, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 } }, ;
      { '4.26.5',   , 'Неонатальный скрининг на галактоземию', 0, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 } }, ;
      { '8.1.1',   , 'УЗИ головного мозга (нейросонография)', 0, 106, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 } }, ;
      { '8.1.3',   , 'УЗИ сердца (эхокардиография)', 0, 106, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 } }, ;
      { '8.1.4',   , 'УЗИ тазобедренных суставов', 0, 106, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 } }, ;
      { '8.1.6',   , 'УЗИ почек', 0, 106, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 } }, ;
      { '8.2.1',   , 'УЗИ органов брюшной полости (комплексное)', 0, 106, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 } }, ;
      { '13.1.1',   , 'Электрокардиография', 0, 111, { 110103, 110303, 110906, 111006, 111905, 112212, 112611, 113418, 113509, 180202, 2021 } };
    }
  endif
  return arr_PN_issled

// 20.09.25
function count_pn_arr_iss( mdata )
  return Len( np_arr_issled( mdata ) )

// 20.09.25
function mm_vokod()
  return { { 'в МО ', 0 }, { 'ВОКОД', 3 } }

// 26.09.25
function get_element_PN( shifr, arr_PN )

  local i

  If ( i := AScan( arr_PN, {| x| x[ 1 ] == shifr } ) ) > 0
    return arr_PN[ i ]
  endif
  return {}


// 27.09.25
function np_arr_osmotr( mdata, mobil )

  local arr_PN_osmotr

  default mobil to 0
  if mdata >= 0d20250901 
    arr_PN_osmotr := {}
    AAdd( arr_PN_osmotr, { '2.94.21' ,   , 'пульмонолог', 75, { 113413, 112208, 112501 } } )
    AAdd( arr_PN_osmotr, { '2.94.22' ,   , 'дерматовенеролог', 16, { 1104 } } )
    AAdd( arr_PN_osmotr, { '2.94.23' ,   , 'ревматолог', 77, { 113414, 112209 } } )
    AAdd( arr_PN_osmotr, { '2.94.24' ,   , 'аллерголог-иммунолог', 4, { 113405, 112214 } } )
    AAdd( arr_PN_osmotr, { '2.94.25' ,   , 'кардиолог', 17, { 113403 } } )
    AAdd( arr_PN_osmotr, { '2.94.26' ,   , 'гастроэнтеролог', 11, { 113407, 112201 } } )
    AAdd( arr_PN_osmotr, { '2.94.27' ,   , 'нефролог', 56, { 113412, 112207 } } )
    AAdd( arr_PN_osmotr, { '2.94.28' ,   , 'гематолог', 12, { 113408, 112202 } } )
    AAdd( arr_PN_osmotr, { '2.94.29' ,   , 'инфекционист', 28, { 1106 } } )
    AAdd( arr_PN_osmotr, { '2.94.30',   , 'детский онколог', 18, { 113401, 112801, 113501 } } )
    AAdd( arr_PN_osmotr, { '2.94.31',   , 'нейрохирург', 54, { 112602, 113504 } } )
    AAdd( arr_PN_osmotr, { '2.94.32',   , 'колопроктолог', 30, { 112601, 113503 } } )
    AAdd( arr_PN_osmotr, { '2.94.33',   , 'сердечно-сосудистый хирург', 81, { 112604, 113505 } } )
    if mobil == 0
      AAdd( arr_PN_osmotr, { '2.94.2',   , 'невролог', 53, { 1109 } } )
      AAdd( arr_PN_osmotr, { '2.94.3',   , 'детский хирург', 20, { 1135 } } )
      AAdd( arr_PN_osmotr, { '2.94.4',   , 'офтальмолог', 65, { 1112 } } )
      AAdd( arr_PN_osmotr, { '2.94.5',   , 'детский стоматолог', 86, { 1401, 140102 } } )
      AAdd( arr_PN_osmotr, { '2.94.6',   , 'травматолог-ортопед', 100, { 1123 } } )
      AAdd( arr_PN_osmotr, { '2.94.7',   , 'отоларинголог', 162, { 1111, 111101 } } )
      AAdd( arr_PN_osmotr, { '2.94.8', 'Ж', 'акушер-гинеколог', 136, { 1101 } } )
      AAdd( arr_PN_osmotr, { '2.94.9', 'М', 'детский уролог-андролог', 19, { 112603, 113502 } } )
      AAdd( arr_PN_osmotr, { '2.94.10',   , 'детский эндокринолог', 21, { 1127, 112702, 113402 } } )
    else
      AAdd( arr_PN_osmotr, { '2.94.12',   , 'невролог', 53, { 1109 } } )
      AAdd( arr_PN_osmotr, { '2.94.13',   , 'детский хирург', 20, { 1135 } } )
      AAdd( arr_PN_osmotr, { '2.94.14',   , 'офтальмолог', 65, { 1112 } } )
      AAdd( arr_PN_osmotr, { '2.94.15',   , 'детский стоматолог', 86, { 1401, 140102 } } )
      AAdd( arr_PN_osmotr, { '2.94.16',   , 'травматолог-ортопед', 100, { 1123 } } )
      AAdd( arr_PN_osmotr, { '2.94.17',   , 'отоларинголог', 162, { 1111, 111101 } } )
      AAdd( arr_PN_osmotr, { '2.94.18', 'Ж', 'акушер-гинеколог', 136, { 1101 } } )
      AAdd( arr_PN_osmotr, { '2.94.19', 'М', 'детский уролог-андролог', 19, { 112603, 113502 } } )
      AAdd( arr_PN_osmotr, { '2.94.20',   , 'детский эндокринолог', 21, { 1127, 112702, 113402 } } )
    endif
  else
    arr_PN_osmotr := { ;
      { '2.85.1',   , 'пульмонолог', 75, { 113413, 112208, 112501 } }, ;
      { '2.85.2',   , 'дерматовенеролог', 16, { 1104 } }, ;
      { '2.85.3',   , 'ревматолог', 77, { 113414, 112209 } }, ;
      { '2.85.4',   , 'аллерголог-иммунолог', 4, { 113405, 112214 } }, ;
      { '2.85.5',   , 'детский кардиолог', 17, { 113403 } }, ;
      { '2.85.6',   , 'гастроэнтеролог', 11, { 113407, 112201 } }, ;
      { '2.85.7',   , 'нефролог', 56, { 113412, 112207 } }, ;
      { '2.85.8',   , 'гематолог', 12, { 113408, 112202 } }, ;
      { '2.85.9',   , 'инфекционист', 28, { 1106 } }, ;
      { '2.85.10',   , 'детский онколог', 18, { 113401, 112801, 113501 } }, ;
      { '2.85.11',   , 'нейрохирург', 54, { 112602, 113504 } }, ;
      { '2.85.12',   , 'колопроктолог', 30, { 112601, 113503 } }, ;
      { '2.85.13',   , 'сердечно-сосудистый хирург', 81, { 112604, 113505 } }, ;
      { '2.85.16', 'Ж', 'акушер-гинеколог', 136, { 1101 } }, ;
      { '2.85.17', 'М', 'детский уролог-андролог', 19, { 112603, 113502 } }, ;
      { '2.85.18',   , 'детский хирург', 20, { 1135 } }, ;
      { '2.85.19',   , 'травматолог-ортопед', 100, { 1123 } }, ;
      { '2.85.20',   , 'невролог', 53, { 1109 } }, ;
      { '2.85.21',   , 'офтальмолог', 65, { 1112 } }, ;
      { '2.85.22',   , 'отоларинголог', 162, { 1111, 111101 } }, ;
      { '2.85.23',   , 'детский стоматолог', 86, { 1401, 140102 } }, ;
      { '2.85.24',   , 'детский эндокринолог', 21, { 1127, 112702, 113402 } } ;
    }
  endif
//    AAdd( arr_PN_osmotr, { '2.4.1',     , 'психиатр', { 72, 73 }, { 1115, 111504 } } )
//    AAdd( arr_PN_osmotr, { '2.4.2',     , 'скрининг на выявление психич.развития', { 68, 57, 72, 73 }, { 1134, 1110, 1115, 111504 } } )
    //  { '2.4.1',   , 'психиатр', { 72, 73 }, { 1115, 111504 } }, ;
    //  { '2.4.2',   , 'скрининг на выявление психич.развития', { 68, 57, 72, 73 }, { 1134, 1110, 1115, 111504 } };
    // '2.85.14'  педиатр 68, {1134}
    // '2.85.15'  врач общей практики 57, {1110}
  AAdd( arr_PN_osmotr, { '2.4.1',   , 'психиатр', { 72, 73 }, { 1115, 111504 } } )
  AAdd( arr_PN_osmotr, { '2.4.2',   , 'скрининг на выявление психич.развития', { 68, 57, 72, 73 }, { 1134, 1110, 1115, 111504 } } )
  return arr_PN_osmotr

// 21.09.25
//function count_pn_arr_osm( mdata )
//  return Len( np_arr_osmotr( mdata ) )

// 21.09.25
function np_arr_osmotr_KDP2()
  
  local arr_osmotr_KDP2
  
  arr_osmotr_KDP2 := { ;  // замена на врачебные приёмы без гематологии
    { '2.85.1','2.85.25', '2.3.1', ''       }, ;// , 'пульмонолог', 75, {113413, 112208, 112501} }, ;
    { '2.85.2','2.85.26', '2.3.1', ''       }, ;// , 'дерматовенеролог', 16, {1104} }, ;
    { '2.85.3','2.85.27', '2.3.1', ''       }, ;// , 'ревматолог', 77, {113414, 112209} }, ;
    { '2.85.4','2.85.28', '2.3.1', ''       }, ;// , 'аллерголог-иммунолог', 4, {113405, 112214} }, ;
    { '2.85.5','2.85.29', '2.3.1', ''       }, ;// , 'детский кардиолог', 17, {113403} }, ;
    { '2.85.6','2.85.30', '2.3.1', ''       }, ;// , 'гастроэнтеролог', 11, {113407, 112201} }, ;
    { '2.85.7','2.85.31', '2.3.1', ''       }, ;// , 'нефролог', 56, {113412, 112207} }, ;
    { '2.85.8','2.85.32', '2.3.1', ''       }, ;// , 'гематолог', 12, {113408, 112202} }, ;
    { '2.85.9','2.85.33', '2.3.1', ''       }, ;// , 'инфекционист', 28, {1106} }, ;
    { '2.85.10', '2.85.34', '2.3.1', ''       }, ;// , 'детский онколог', 18, {113401, 112801, 113501} }, ;
    { '2.85.11', '2.85.35', '2.3.1', ''       }, ;// , 'нейрохирург', 54, {112602, 113504} }, ;
    { '2.85.12', '2.85.36', '2.3.1', ''       }, ;// , 'колопроктолог', 30, {112601, 113503} }, ;
    { '2.85.13', '2.85.37', '2.3.1', ''       }, ;// , 'сердечно-сосудистый хирург', 81, {112604, 113505} }, ;
    { '2.85.14', '2.85.38', '2.3.2', '2.91.1' }, ;// 'педиатр', 68, {1134}}, ;
    { '2.85.15', '2.85.39', '2.3.2', '2.91.1' }, ;// 'врач общей практики', 57, {1110}}, ;
    { '2.85.16', '2.85.40', '2.3.1', '2.91.8' }, ;// 'Ж', 'акушер-гинеколог', 136, {1101} }, ;
    { '2.85.17', '2.85.41', '2.3.1', '2.91.9' }, ;// 'М', 'детский уролог-андролог', 19, {112603, 113502} }, ;
    { '2.85.18', '2.85.42', '2.3.1', '2.91.3' }, ;// , 'детский хирург', 20, {1135} }, ;
    { '2.85.19', '2.85.43', '2.3.1', '2.91.6' }, ;// , 'травматолог-ортопед', 100, {1123} }, ;
    { '2.85.20', '2.85.44', '2.3.1', '2.91.2' }, ;// , 'невролог', 53, {1109} }, ;
    { '2.85.21', '2.85.45', '2.3.1', '2.91.4' }, ;// , 'офтальмолог', 65, {1112} }, ;
    { '2.85.22', '2.85.46', '2.3.1', '2.91.7' }, ;// , 'отоларинголог', 162, {1111, 111101} }, ;
    { '2.85.23', '2.85.47', '2.3.1', '2.91.5' }, ;// , 'детский стоматолог', 86, {140102} }, ;
    { '2.85.24', '2.85.48', '2.3.1', '2.91.10' }; // , 'детский эндокринолог', 21, {1127, 112702, 113402} }, ;
  }
  return arr_osmotr_KDP2

// 01.10.25
function np_arr_not_zs( mdata ) // замена на услуги с ценой (нет законченного случая)
  
  local arr_not_zs 
  
  if mdata >= 0d20250901 
    arr_not_zs := { ;  
      { '3.5.4',   '3.5.704', }, ;  // аудиологический скрининг
      { '4.2.153', '4.2.753', }, ;  // клинический анализ мочи
      { '4.11.136', '4.11.736', }, ;  // клинический анализ крови
      { '4.29.101', '4.29.2', }, ;    // исследование уровня холестерина
      { '8.1.1',   '8.1.701', }, ;  // УЗИ головного мозга
      { '8.1.3',   '8.1.703', }, ;  // УЗИ сердца
      { '8.1.4',   '8.1.704', }, ;  // УЗИ тазобедренных суставов
      { '8.1.6',   '8.1.706', }, ;  // УЗИ почек
      { '8.2.1',   '8.2.701', }, ;  // УЗИ органов брюшной полости комплексное профилактическое
      { '13.1.1',  '13.1.701', }, ;  // электрокардиография
      { '13.2.100','13.2.1', }, ;   // отоакустическая эмиссия
      { '13.2.101','13.2.2', } ;    // офтальмоскопия в условиях мидриаза
    }
  else
    arr_not_zs := { ;  
      { '3.5.4',   '3.5.704', }, ;  // аудиологический скрининг
      { '4.2.153', '4.2.753', }, ;  // клинический анализ мочи
      { '4.11.136', '4.11.736', }, ;  // клинический анализ крови
      { '8.1.1',   '8.1.701', }, ;  // УЗИ головного мозга
      { '8.1.3',   '8.1.703', }, ;  // УЗИ сердца
      { '8.1.4',   '8.1.704', }, ;  // УЗИ тазобедренных суставов
      { '8.1.6',   '8.1.706', }, ;  // УЗИ почек
      { '8.2.1',   '8.2.701', }, ;  // УЗИ органов брюшной полости комплексное профилактическое
      { '13.1.1',  '13.1.701', } ;  // электрокардиография
    }
  endif
  return arr_not_zs
