#include 'common.ch'
#include 'hbhash.ch'
#include 'function.ch'
#include 'chip_mo.ch'

// диспансеризация детей-сирот
// 12.09.25
function dds_arr_iss()

  static dds_iss

  if HB_ISNIL( dds_iss )
    dds_iss := { ;
      { 'Клинический анализ мочи', '', 0, 17, { 34 }, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 }, { '4.2.153' } }, ;
      { 'Клинический анализ крови', '', 0, 17, { 34 }, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 }, { '4.11.136' } }, ;
      { 'Исследование уровня глюкозы в крови', '', 0, 17, { 34 }, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 }, { '4.12.169' } }, ;
      { 'Электрокардиография', '', 0, 17, { 111 }, { 110103, 110303, 110906, 111006, 111905, 112212, 112611, 113418, 113509, 180202, 2021 }, { '13.1.1' } }, ;
      { 'Флюорография легких (с 15 лет)', '', 15, 17, { 78 }, { 1118, 1802, 2020 }, { '7.61.3' } }, ;
      { 'УЗИ головного мозга (нейросонография) (до 1 года)', '', 0, 0, { 106 }, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 }, { '8.1.1' } }, ;
      { 'УЗИ щитовидной железы (с 7 лет)', '', 7, 17, { 106 }, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 }, { '8.1.2' } }, ;
      { 'УЗИ сердца', '', 0, 17, { 106 }, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 }, { '8.1.3' } }, ;
      { 'УЗИ тазобедренных суставов (до 1 года)', '', 0, 0, { 106 }, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 }, { '8.1.4' } }, ;
      { 'УЗИ органов брюшной полости комплексное профилактическое', '', 0, 17, { 106 }, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 }, { '8.2.1' } }, ;
      { 'УЗИ органов репродуктивной системы', '', 7, 17, { 106 }, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 }, { '8.2.2', '8.2.3' } };
    }
  endif
  return dds_iss

// 12.09.25
function dds_arr_osmotr_KDP2()

  static dds_osmotr_KDP2

  if HB_ISNIL( dds_osmotr_KDP2 )
    dds_osmotr_KDP2 := { ;
      { '2.83.1', '2.83.25' }, ; // пульмонолог
      { '2.83.2', '2.83.26' }, ; // дерматовенеролог
      { '2.83.3', '2.83.27' }, ; // ревматолог
      { '2.83.4', '2.83.28' }, ; // аллерголог-иммунолог
      { '2.83.5', '2.83.29' }, ; // детский кардиолог
      { '2.83.6', '2.83.30' }, ; // гастроэнтеролог
      { '2.83.7', '2.83.31' }, ; // нефролог
      { '2.83.8', '2.83.32' }, ; // гематолог
      { '2.83.9', '2.83.33' }, ; // инфекционист
      { '2.83.10', '2.83.34' }, ; // детский онколог
      { '2.83.11', '2.83.35' }, ; // нейрохирург
      { '2.83.12', '2.83.36' }, ; // колопроктолог
      { '2.83.13', '2.83.37' }, ; // сердечно-сосудистый хирург
      { '2.83.14', '2.83.38' }, ; // педиатр
      { '2.83.15', '2.83.39' }, ; // врач общей практики
      { '2.83.16', '2.83.40' }, ; // акушер-гинеколог (девочки)
      { '2.83.17', '2.83.41' }, ; // детский уролог-андролог (мальчики)
      { '2.83.18', '2.83.42' }, ; // детский хирург
      { '2.83.19', '2.83.43' }, ; // травматолог-ортопед
      { '2.83.20', '2.83.44' }, ; // невролог
      { '2.83.21', '2.83.45' }, ; // офтальмолог
      { '2.83.22', '2.83.46' }, ; // оториноларинголог
      { '2.83.23', '2.83.47' }, ; // детский стоматолог
      { '2.83.24', '2.83.48' };  // детский эндокринолог
    }
  endif
  return dds_osmotr_KDP2

// 12.09.25
function dds_arr_osm1()

  static dds_osm1

  if HB_ISNIL( dds_osm1 )
    dds_osm1 := { ;
      { 'офтальмолог', '', 0, 17, { 65 }, { 1112 }, { '2.83.21' } }, ;
      { 'оториноларинголог', '', 0, 17, { 162, 64 }, { 1111, 111101 }, { '2.83.22' } }, ;
      { 'детский хирург', '', 0, 17, { 20 }, { 1135 }, { '2.83.18' } }, ;
      { 'травматолог-ортопед', '', 0, 17, { 100 }, { 1123 }, { '2.83.19' } }, ;
      { 'акушер-гинеколог (девочки)', 'Ж', 0, 17, { 136, 2 }, { 1101 }, { '2.83.16' } }, ;
      { 'детский уролог-андролог (мальчики)', 'М', 0, 17, { 19 }, { 112603, 113502 }, { '2.83.17' } }, ;
      { 'детский стоматолог', '', 3, 17, { 86 }, { 1401, 140102 }, { '2.83.23' } }, ;
      { 'детский эндокринолог', '', 5, 17, { 21 }, { 1127, 112702, 113402 }, { '2.83.24' } }, ;
      { 'невролог', '', 0, 17, { 53 }, { 1109 }, { '2.83.20' } }, ;
      { 'психиатр', '', 0, 17, { 72 }, { 1115 }, { '2.4.1' } }, ;
      { 'педиатр', '', 0, 17, { 68, 57 }, { 1134, 1110 }, { '2.83.14', '2.83.15' } };
    }
  endif
  return dds_osm1

// 12.09.25
function dds_arr_osm2()

  static dds_osm2

  if HB_ISNIL( dds_osm2 )
    dds_osm2 := { ;
      { 'пульмонолог', '', 0, 17, { 75 }, { 113413, 112208, 112501 }, { '2.83.1' } }, ;
      { 'дерматовенеролог', '', 0, 17, { 16 }, { 1104 }, { '2.83.2' } }, ;
      { 'ревматолог', '', 0, 17, { 77 }, { 113414, 112209 }, { '2.83.3' } }, ;
      { 'аллерголог-иммунолог', '', 0, 17, { 4 }, { 113405, 112214 }, { '2.83.4' } }, ;
      { 'детский кардиолог', '', 0, 17, { 17 }, { 113403 }, { '2.83.5' } }, ;
      { 'гастроэнтеролог', '', 0, 17, { 11 }, { 113407, 112201 }, { '2.83.6' } }, ;
      { 'нефролог', '', 0, 17, { 56 }, { 113412, 112207 }, { '2.83.7' } }, ;
      { 'гематолог', '', 0, 17, { 12 }, { 113408, 112202 }, { '2.83.8', '2.3.1' } }, ;
      { 'инфекционист', '', 0, 17, { 28 }, { 1106 }, { '2.83.9' } }, ;
      { 'детский онколог', '', 0, 17, { 18 }, { 113401, 112801, 113501 }, { '2.83.10', '2.3.1' } }, ;
      { 'нейрохирург', '', 0, 17, { 54 }, { 112602, 113504 }, { '2.83.11' } }, ;
      { 'колопроктолог', '', 0, 17, { 30 }, { 112601, 113503 }, { '2.83.12' } }, ;
      { 'сердечно-сосудистый хирург', '', 0, 17, { 81 }, { 112604, 113505 }, { '2.83.13' } }, ;
      { 'педиатр', '', 0, 17, { 68, 57 }, { 1134, 1110 }, { '2.83.14', '2.83.15' } };
    }
  endif
  return dds_osm2

// 13.09.25
function mm_kateg_uch()

  static kateg_uch

  if HB_ISNIL( kateg_uch )
    kateg_uch := { ;
      { 'ребенок-сирота', 0 }, ;
      { 'ребенок, оставшийся без попечения родителей', 1 }, ;
      { 'ребенок, находящийся в трудной жизненной ситуации', 2 }, ;
      { 'нет категории', 3 } ;
    }
  endif
  return kateg_uch

// 13.09.25
function mm_gde_nahod()

  static gde_nahod

  if HB_ISNIL( gde_nahod )
    gde_nahod := { ;
      { 'в стационарном учреждении', 0 }, ;
      { 'под опекой', 1 }, ;
      { 'под попечительством', 2 }, ;
      { 'передан в приемную семью', 3 }, ;
      { 'передан в патронатную семью', 4 }, ;
      { 'усыновлен (удочерена)', 5 }, ;
      { 'другое', 6 } ;
    }
  endif
  return gde_nahod

// 13.09.25
function mm_prich_vyb()

  static prich_vyb

  if HB_ISNIL( prich_vyb )
    prich_vyb := { ;
      { 'не выбыл', 0 }, ;
      { 'опека', 1 }, ;
      { 'попечительство', 2 }, ;
      { 'усыновление (удочерение)', 3 }, ;
      { 'передан в приемную семью', 4 }, ;
      { 'передан в патронатную семью', 5 }, ;
      { 'выбыл в другое стационарное учреждение', 6 }, ;
      { 'выбыл по возрасту', 7 }, ;
      { 'смерть', 8 }, ;
      { 'другое', 9 } ;
    }
  endif
  return prich_vyb
