// режимы настройки данных для диспансеризации взрослого населения - oms_DVN_setup.prg
#include 'inkey.ch'
#include 'function.ch'
#include 'edit_spr.ch'
#include 'chip_mo.ch'

// 24.03.26
function dvn_arr_usl_new( dateSl, mobil, etap, gender, age ) 

  local aDvn, i, fl

  Default dateSl To 0d20210101
  default mobil to 0

  // 1- наименование услуги
  // 2- шифр услуги
  // 3- этап (1, 2, 3, 4, 5)
  // 4- (0-диагностика, 1-осмотр врача)
  // 5-
  // 6- возрост (мужчины)
  // 7- возрост (женщины)
  // 8- мужчины (0-нет, 1-да) - похоже вывод на экран 
  // 9- женщины (0-нет, 1-да) - похоже вывод на экран
  // 10- V002 - Классификатор профилей оказанной медицинской помощи
  // 11- V004 - Классификатор медицинских специальностей

  If dateSl >= 0d20260101
//    aDvn := arr_usl_2026( mobil )
    aDvn := arr_usl_2026_new( mobil )
  elseIf ( dateSl >= 0d20210101 ) .and. ( dateSl < 0d20260101 )
    aDvn := arr_usl_2021( dateSl, mobil, age )
  Elseif ( dateSl >= 0d20190101 ) .and. ( dateSl < 0d20210101 )
    aDvn := arr_usl_2019( mobil )
  else
    aDvn := arr_usl_2018( mobil )
  Endif

  for i := Len( aDvn ) to 1 step -1
    fl := .f.
    If ValType( aDvn[ i, 3 ] ) == 'N'
      fl := ( aDvn[ i, 3 ] == etap )
    Else
      fl := AScan( aDvn[ i, 3 ], etap ) > 0
    Endif

    If fl
      if ValType( aDvn[ i, 6 ] ) == 'N' .and. aDvn[ i, 6 ] == 1 .and. gender == 'М'
        fl := .t.
      elseif ValType( aDvn[ i, 7 ] ) == 'N' .and. aDvn[ i, 7 ] == 1 .and. gender == 'Ж'
        fl := .t.
      elseif ValType( aDvn[ i, 6 ] ) == 'A' .and. gender == 'М'
        fl := AScan( aDvn[ i, 6 ], age ) > 0
      elseif ValType( aDvn[ i, 7 ] ) == 'A' .and. gender == 'Ж'
        fl := AScan( aDvn[ i, 7 ], age ) > 0
      else
        fl := .f.
      endif
    endif


    if ! fl
      hb_ADel( aDvn, i, .t. )
    endif
  next

  return aDvn

// 24.03.26
function arr_usl_2026_new( mobil )

  local arr_u2026, blk
  local etap := 1
  local age_etap_3 := { 19, 20, 22, 23, 25, 26, 28, 29, 31, 32, 34, 35, 37, 38 }
  local age_etap_1

  default mobil to 0

  blk := { | d1, d2, d |
    Local i, arr := {}
    Default d To 1
    For i := d1 To d2 Step d
      AAdd( arr, i )
    Next
    Return arr
  }

  age_etap_1 := array_add( Eval( blk, 18, 39, 3 ), Eval( blk, 40, 110, 1 ) )

  // 1- наименование услуги
  // 2- шифр услуги
  // 3- этап (1, 2, 3, 4, 5)
  // 4- (0-диагностика, 1-осмотр врача)
  // 5-
  // 6- возрост (мужчины)
  // 7- возрост (женщины)
  // 8- мужчины (0-нет, 1-да) - похоже вывод на экран 
  // 9- женщины (0-нет, 1-да) - похоже вывод на экран
  // 10- V002 - Классификатор профилей оказанной медицинской помощи
  // 11- V004 - Классификатор медицинских специальностей
//    arr_u2026 := { ; // Услуги на экран для ввода
    arr_u2026 := {}
    AAdd( arr_u2026, ;
      { ;
        'Измерение внутриглазного давления', ;
        iif( mobil == 0, '3.4.709', '3.4.710' ), ;
        1, 0, 1, ;
        Eval( blk, 40, 110 ), ;
        Eval( blk, 40, 110 ), ;
        1, 1, 65, { 1112 } ;
      } ;
    )

    AAdd( arr_u2026, ;
      { ;
        'Исследование крови на общий холестерин', ;
        iif( mobil == 0, '4.12.967', '4.12.962' ), ;
        1, 0, 1, ; //  { 1, 3 }, 0, 1, ;
        age_etap_1, age_etap_1, 1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Исследование крови на общий холестерин', ;
        iif( mobil == 0, '4.12.967', '4.12.962' ), ;
        3, 0, 1, ; //  { 1, 3 }, 0, 1, ;
        age_etap_3, ;
        age_etap_3, 1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Исследование уровня глюкозы в крови', ;
        iif( mobil == 0, '4.12.966', '4.12.963' ), ;
        1, 0, 1, ; // { 1, 3 }, 0, 1, ;
        age_etap_1, age_etap_1, 1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Исследование уровня глюкозы в крови', ;
        iif( mobil == 0, '4.12.966', '4.12.963' ), ;
        3, 0, 1, ; //  { 1, 3 }, 0, 1, ;
        age_etap_3, ;
        age_etap_3, ;
        1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Клинический анализ крови (3 показателя)', ;
        iif( mobil == 0, '4.11.737', '4.11.741' ), ;
        1, 0, 1, ;
        Eval( blk, 40, 110 ), ;
        Eval( blk, 40, 110 ), ;
        1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Исследование кала на скрытую кровь', ;
        iif( mobil == 0, '4.8.807', '4.8.805' ), ;
        1, 0, 1, ;
        array_add( Eval( blk, 40, 64, 2 ), Eval( blk, 65, 75 ) ), ;
        array_add( Eval( blk, 40, 64, 2 ), Eval( blk, 65, 75 ) ), ;
        1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Кровь на простат-специфический антиген', ;
        iif( mobil == 0, '4.14.766', '4.14.767' ), ;
        1, 0, 1, ;
        { 45, 50, 55, 60, 64 }, ;
        0, ;
        1, 0, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Взятие мазка (соскоба) со слизистых полостей', ;
        iif( mobil == 0, '4.1.712', '4.1.713' ), ;
        1, 0, 1, ; // женщины
        0, ;
        { 18, 21, 24, 27, 30, 33, 36, 39, 42, 45, 48, 51, 54, 57, 60, 63 }, ;
        1, 1, { 3, 42, 136 }, { 2003, 2002, 1101 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Цит. жидкостное исл-ние скрининга рака шейки матки', ;
        iif( mobil == 0, '4.20.709', '4.20.704' ), ;
        1, 0, 1, ; // женщины
        0, ;
        { 18, 21, 24, 27, 30, 33, 36, 39, 42, 45, 48, 51, 54, 57, 60, 63 }, ;
        1, 0, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Иссл-е взятого цитологического материала', ;
        iif( mobil == 0, '4.20.701', '4.20.703' ), ;
        1, 0, 1, ; // если невозможна 4.1.12
        0, ;
        { 18, 21, 24, 27, 30, 33, 36, 39, 42, 45, 48, 51, 54, 57, 60, 63 }, ;     // то очистить
        1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };               // эту услугу
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Маммография', ;
        iif( mobil == 0, '7.57.703', '7.57.705' ), ;
        1, 0, 1, ; // женщины
        0, ;
        { 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74 }, ;
        0, 1, 78, { 1118, 1802, 2020 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Маммография цифровая с ИИ', ;
        iif( mobil == 0, '7.57.709', '7.57.706' ), ;
        1, 0, 1, ; // женщины
        0, ;
        { 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74 }, ;
        0, 1, 78, { 1118, 1802, 2020 };
      } ;
    )
/*
    AAdd( arr_u2026, ;
      { ;
        'Флюорография лёгких в 1-й проекции', ;
        iif ( mobil == 0, '7.61.703', '7.61.705' ), ;
        { 1, 3 }, 0, 1, ;
        Eval( blk, 18, 99, 2 ), ;
        Eval( blk, 18, 99, 2 ), ;
        Eval( blk, 18, 99, 2 ), ;
        Eval( blk, 18, 99, 2 ), ;
        78, { 1118, 1802, 2020 };
      } ;
    )
*/
    AAdd( arr_u2026, ;
      { ;
        'Флюорография лёгких в 1-й проекции', ;
        iif ( mobil == 0, '7.61.703', '7.61.705' ), ;
        1, 0, 1, ;
        array_add( Eval( blk, 18, 36, 6 ), Eval( blk, 38, 98, 2 ) ), ;
        array_add( Eval( blk, 18, 36, 6 ), Eval( blk, 38, 98, 2 ) ), ;
        array_add( Eval( blk, 18, 36, 6 ), Eval( blk, 38, 98, 2 ) ), ;
        array_add( Eval( blk, 18, 36, 6 ), Eval( blk, 38, 98, 2 ) ), ;
        78, { 1118, 1802, 2020 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Флюорография лёгких в 1-й проекции', ;
        iif ( mobil == 0, '7.61.703', '7.61.705' ), ;
        3, 0, 1, ;
        { 20, 22, 26, 28,32, 34, 38 }, ;
        { 20, 22, 26, 28,32, 34, 38 }, ;
        { 20, 22, 26, 28,32, 34, 38 }, ;
        { 20, 22, 26, 28,32, 34, 38 }, ;
        78, { 1118, 1802, 2020 };
      } ;
    )
/*
    AAdd( arr_u2026, ;
      { ;
        'Флюорография лёгких цифровая с ИИ', ;
        iif ( mobil == 0, '7.61.709', '7.61.706' ), ;
        { 1, 3 }, 0, 1, ;
        Eval( blk, 18, 99, 2 ), ;
        Eval( blk, 18, 99, 2 ), ;
        Eval( blk, 18, 99, 2 ), ;
        Eval( blk, 18, 99, 2 ), ;
        78, { 1118, 1802, 2020 };
      } ;
    )
*/
    AAdd( arr_u2026, ;
      { ;
        'Флюорография лёгких цифровая с ИИ', ;
        iif ( mobil == 0, '7.61.709', '7.61.706' ), ;
        1, 0, 1, ;
        array_add( Eval( blk, 18, 36, 6 ), Eval( blk, 38, 98, 2 ) ), ;
        array_add( Eval( blk, 18, 36, 6 ), Eval( blk, 38, 98, 2 ) ), ;
        array_add( Eval( blk, 18, 36, 6 ), Eval( blk, 38, 98, 2 ) ), ;
        array_add( Eval( blk, 18, 36, 6 ), Eval( blk, 38, 98, 2 ) ), ;
        78, { 1118, 1802, 2020 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Флюорография лёгких цифровая с ИИ', ;
        iif ( mobil == 0, '7.61.709', '7.61.706' ), ;
        3, 0, 1, ;
        { 20, 22, 26, 28,32, 34, 38 }, ;
        { 20, 22, 26, 28,32, 34, 38 }, ;
        { 20, 22, 26, 28,32, 34, 38 }, ;
        { 20, 22, 26, 28,32, 34, 38 }, ;
        78, { 1118, 1802, 2020 };
      } ;
    )
/*
    AAdd( arr_u2026, ;
      { ;
        'Электрокардиография', ;
        iif( mobil == 0, '13.1.701', '13.1.703' ), ;
        { 1, 3 }, 0, 1, ;
        Eval( blk, 35, 99 ), ;
        Eval( blk, 35, 99 ), ;
        Eval( blk, 35, 99 ), ;
        Eval( blk, 35, 99 ), ;
        111, { 110103, 110303, 110906, 111006, 111905, 112212, 112611, 113418, 113509, 180202, 2021 };
      } ;
    )
*/
    AAdd( arr_u2026, ;
      { ;
        'Электрокардиография', ;
        iif( mobil == 0, '13.1.701', '13.1.703' ), ;
        1, 0, 1, ;
        array_add( { 36 }, Eval( blk, 39, 110, 1 ) ), ;
        array_add( { 36 }, Eval( blk, 39, 110, 1 ) ), ;
        array_add( { 36 }, Eval( blk, 39, 110, 1 ) ), ;
        array_add( { 36 }, Eval( blk, 39, 110, 1 ) ), ;
        111, { 110103, 110303, 110906, 111006, 111905, 112212, 112611, 113418, 113509, 180202, 2021 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Электрокардиография', ;
        iif( mobil == 0, '13.1.701', '13.1.703' ), ;
        3, 0, 1, ;
        { 35, 37, 38 }, ;
        { 35, 37, 38 }, ;
        { 35, 37, 38 }, ;
        { 35, 37, 38 }, ;
        111, { 110103, 110303, 110906, 111006, 111905, 112212, 112611, 113418, 113509, 180202, 2021 };
      } ;
    )
/*
    AAdd( arr_u2026, ;
      { ;
        'Электрокардиография с применением ИИ', ;
        iif( mobil == 0, '13.1.707', '13.1.704' ), ;
        { 1, 3 }, 0, 1, ;
        Eval( blk, 35, 99 ), ;
        Eval( blk, 35, 99 ), ;
        Eval( blk, 35, 99 ), ;
        Eval( blk, 35, 99 ), ;
        111, { 110103, 110303, 110906, 111006, 111905, 112212, 112611, 113418, 113509, 180202, 2021 };
      } ;
    )
*/
    AAdd( arr_u2026, ;
      { ;
        'Электрокардиография с применением ИИ', ;
        iif( mobil == 0, '13.1.707', '13.1.704' ), ;
        1, 0, 1, ;
        array_add( { 36 }, Eval( blk, 39, 110, 1 ) ), ;
        array_add( { 36 }, Eval( blk, 39, 110, 1 ) ), ;
        array_add( { 36 }, Eval( blk, 39, 110, 1 ) ), ;
        array_add( { 36 }, Eval( blk, 39, 110, 1 ) ), ;
        111, { 110103, 110303, 110906, 111006, 111905, 112212, 112611, 113418, 113509, 180202, 2021 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Электрокардиография с применением ИИ', ;
        iif( mobil == 0, '13.1.707', '13.1.704' ), ;
        3, 0, 1, ;
        { 35, 37, 38 }, ;
        { 35, 37, 38 }, ;
        { 35, 37, 38 }, ;
        { 35, 37, 38 }, ;
        111, { 110103, 110303, 110906, 111006, 111905, 112212, 112611, 113418, 113509, 180202, 2021 };
      } ;
    )
/*
    AAdd( arr_u2026, ;
      { ;
        'Исследование крови на Anti-HCV-total', ;
        iif( mobil == 0, '4.15.750', '4.15.748'), ;
        { 1, 3 }, 0, 1, ;
        { 25, 35, 45, 55, 65, 75, 85, 95 }, ;
        { 25, 35, 45, 55, 65, 75, 85, 95 }, ;
        1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
      } ;
    )
*/
    AAdd( arr_u2026, ;
      { ;
        'Исследование крови на Anti-HCV-total', ;
        iif( mobil == 0, '4.15.750', '4.15.748'), ;
        1, 0, 1, ;
        { 45, 55, 65, 75, 85, 95 }, ;
        { 45, 55, 65, 75, 85, 95 }, ;
        1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Исследование крови на Anti-HCV-total', ;
        iif( mobil == 0, '4.15.750', '4.15.748'), ;
        3, 0, 1, ;
        { 25, 35 }, ;
        { 25, 35 }, ;
        1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Фиброэзофагогастродуоденоскопия', ;
        iif( mobil == 0, '10.3.713', '10.3.714' ), ;
        1, 0, 1, ;
        { 45 }, ;
        { 45 }, ;
        1, 1, 123, { 110104, 111007, 112221, 112609, 113419, 113511 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Осмотр акушеркой или акушером-гинекологом', ;
        iif( mobil == 0, { '70.7.61', '70.7.62' }, { '70.7.361', '70.7.362' } ), ;
        1, 1, 1, ; // женщины not found 1, 0, 1, ; // женщины not found
        0, ;
        1, 0, 1, { 136, 3, 42 }, { 1101, 2003, 2002 }, ;
        { ;
          { { '70.7.61', '70.7.361' }, 136 }, ;
          { { '70.7.62', '70.7.362' }, 3 }, ;
          { { '70.7.62', '70.7.362' }, 42 } ;
        }, ;
        1, 1;
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Спирометрия', ;
        '16.1.717', ;
        2, 0, 1, ;
        1, 1, 1, 1, 111, { 110103, 110303, 110906, 111006, 111905, 112212, 112611, 113418, 113509, 180202, 2021 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Исследование крови на гликированный гемо-ин', ;
        '4.12.775', ;   // '4.12.870' письмо Мызгина 10.03.26
        2, 0, 1, ;
        1, 1, 1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Фиброэзофагогастродуоденоскопия', ;
        '10.3.713', ;
        2, 0, 1, ;
        1, 1, 1, 1, 123, { 110104, 111007, 112221, 112609, 113419, 113511 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Дуплексное сканир-ие брахиоцефальных артерий', ;
        '8.23.706', ;
        2, 0, 1, ;
        1, 1, 1, 1, 106, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Рентгенография органов грудной клетки', ;
        '7.2.702', ;
        2, 0, 1, ;
        1, 1, 1, 1, 78, { 1118, 1802 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'КТ органов грудной полости', ;
        '7.2.701', ;
        2, 0, 1, ;
        1, 1, 1, 1, 78, { 1118, 1802 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Спиральная КТ легких', ;
        '7.2.703', ;
        2, 0, 1, ;
        1, 1, 1, 1, 78, { 1118, 1802 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'КТ органов грудной полости (с контрастир-ием)', ;
        '7.2.704', ;
        2, 0, 1, ;
        1, 1, 1, 1, 78, { 1118, 1802 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Однофотонная эмиссионная КТ легких', ;
        '7.2.705', ;
        2, 0, 1, ;
        1, 1, 1, 1, 78, { 1118, 1802 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Ректосигмоколоноскопия диагностическая', ;
        '10.6.710', ;
        2, 0, 1, ;
        1, 1, 1, 1, 123, { 110104, 111007, 112221, 112609, 113419, 113511 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Ректороманоскопия', ;
        '10.4.701', ;
        2, 0, 1, ;
        1, 1, 1, 1, 123, { 110104, 111007, 112221, 112609, 113419, 113511 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Углубленное профилактическое консультирование', ;
        '56.1.723', ;
        2, 0, 1, ;
        1, 1, 1, 1, { 97, 57, 42 }, { 1122, 1110, 2002 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Приём врача невролога', ;
        '2.84.1', ;
        2, 1, 0, ;
        1, 1, 1, 1, 53, { 1109 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Приём врача офтальмолога', ;
        '2.84.3', ;
        2, 1, 0, ;
        1, 1, 1, 1, 65, { 1112 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Приём врача оториноларинголога', ;
        '2.84.8', ;
        2, 1, 0, ;
        1, 1, 1, 1, 162, { 1111 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Приём врача уролога (хирурга)', ;
        '2.84.10', ;
        2, 1, 0, ;
        1, 0, 1, 0, { 108, 112 }, { 112603, 1126 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Приём врача акушера-гинеколога', ;
        '2.84.5', ;
        2, 1, 0, ;
        1, 1, 0, 1, 136, { 1101 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Приём врача колопроктолога (хирурга)', ;
        '2.84.6', ;
        2, 1, 0, ;
        1, 1, 1, 1, { 30, 30, 112 }, { 112601, 113503, 1126 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Приём врача дерматовенеролог', ;
        '2.84.14', ;
        2, 1, 0, ;
        1, 1, 1, 1, 16, { 1104 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Приём врача терапевта (фельдшера)', ;
        iif( mobil == 0, { '70.7.63', '70.7.64' }, { '70.7.363', '70.7.364' } ), ;
        1, 1, 0, ;
        age_etap_1, ;
        age_etap_1, ;
        1, 1, { 97, 57, 42 }, { 1122, 1110, 2002 }, ;
        { ;
          { { '70.7.63', '70.7.363' }, 57 }, ;
          { { '70.7.63', '70.7.363' }, 97 }, ;
          { { '70.7.64', '70.7.364' }, 42 } ;
        }, 1, 1;
      } ;
    )
    AAdd( arr_u2026, ;
      { ; 
        'Приём врача акушера-гинеколога (акушерки)', ;
        iif( mobil == 0, { '72.5.19', '72.5.20' }, { '72.5.319', '72.5.320' } ), ;
        3, 1, 0, ;
        0, ;
        age_etap_3, ;
        0, 1, { 136, 3, 42 }, { 1101, 2003, 2002 }, ;
        { ;
          { { '72.5.19', '72.5.319' }, 136 }, ;
          { { '72.5.20', '72.5.320' }, 3 }, ;
          { { '72.5.20', '72.5.320' }, 42 } ;
        }, 1, 1;
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Приём врача терапевта ( фельдшера )', ;
        iif( mobil == 0, { '72.5.17', '72.5.18' }, { '72.5.317', '72.5.318' } ), ;
        3, 1, 0, ;
        age_etap_3, ;
        age_etap_3, ;
        1, 1, { 97, 57, 42 }, { 1122, 1110, 2002 }, ;
        { ;
          { { '72.5.17', '72.5.317' }, 57 }, ;
          { { '72.5.17', '72.5.317' }, 97 }, ;
          { { '72.5.18', '72.5.318' }, 42 } ;
        }, 1, 1;
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Приём врача терапевта для заключения 2 этап', ;
        '2.84.11', ;
        2, 1, 0, ;
        1, 1, 1, 1, { 97, 57, 42 }, { 1122, 1110, 2002 }, ;
        { ;
          { '2.84.11', 57 }, ;
          { '2.84.11', 97 } ;
        }, ;
        1, 1;
      } ;
    )

  return arr_u2026

// 16.03.26
function dvn_obyazat_usl( mdate, mobil )

  local arr_obyazat_usl := {}

  default mdate to Date()
  default mobil to 0

  if mdate >= 0d20260101
    AAdd( arr_obyazat_usl, iif( mobil == 0, { '7.57.703', '7.57.709' }, { '7.57.705', '7.57.706' } ) ) // маммография
    AAdd( arr_obyazat_usl, iif( mobil == 0, '4.8.807', '4.8.805' ) )                  // кал на скрытую кровь
    AAdd( arr_obyazat_usl, iif( mobil == 0, { '70.7.61', '70.7.62' }, { '70.7.361', '70.7.362' } ) )   // посещение гинеколга (акушера)
    AAdd( arr_obyazat_usl, iif( mobil == 0, '4.1.712', '4.1.713' ) )                  // мазки (соскобы)
    AAdd( arr_obyazat_usl, iif( mobil == 0, { '4.20.701', '4.20.709' }, { '4.20.703', '4.20.704' } ) ) // цитология
    AAdd( arr_obyazat_usl, iif( mobil == 0, '4.14.766', '4.14.767' ) )                 // ПСА
  endif

  return arr_obyazat_usl

// 30.01.26
function arr_vozrast_DVN()
  
  return { 21, 24, 27, 30, 33, 36, 39, 42, 45, 48, 51, 54, 57, 60, 63, 66, 69, 72, 75, 78, 81, 84, 87, 90, 93, 96, 99 }

// 30.01.26
function arr2m_vozrast_DVN()
  
  return { 49, 53, 55, 59, 61, 65, 67, 71, 73 } // 1 раз в 2 года все

// 30.01.26
function arr2g_vozrast_DVN()
  
  return { 50, 52, 56, 58, 62, 64, 68, 70 }    // 1 раз в 2 года женщины

// 26.03.26
//function get_zamenauslugi_dvn( mdate, codeUsl )
//
//  local i, retShifr := ''
//  local arr_zam := DVN_usl_replace( mdate )
//
//  codeUsl := AllTrim( codeUsl )
//  i := ascan( arr_zam, { | x | AllTrim( x[ 1 ] ) == codeUsl } )
//  if i > 0
//    retShifr := arr_zam[ i, 2 ]
//  endif
//
//  return retShifr

// 26.03.26
function DVN_usl_replace( mdate )

  local arr := {}

  if mdate >= 0d20260101
    arr := { ;
      { '70.7.63', '2.3.7' }, ;
      { '70.7.64', '2.3.4' }, ;
      { '70.7.61', '2.3.15' }, ;
      { '70.7.62', '2.3.3' }, ;
      { '56.1.716', '56.1.16' }, ;
      { '3.1.719', '3.1.19' }, ;
      { '3.1.705', '3.1.5' }, ;
      { '4.12.967', '4.12.174' }, ;
      { '4.12.966', '4.12.169' }, ;
      { '56.1.718', '56.1.18' }, ;
      { '56.1.719', '56.1.19' }, ;
      { '7.61.703', '7.61.3' }, ;
      { '7.61.709', '7.61.4' }, ;
      { '13.1.701', '13.1.1' }, ;
      { '13.1.707', '13.1.2' }, ;
      { '3.4.709', '3.4.9' }, ;
      { '56.1.724', '56.1.14' }, ;
      { '4.11.737', '4.11.137' }, ;
      { '4.8.807', '4.8.4' }, ;
      { '7.57.703', '7.57.3' }, ;
      { '7.57.709', '7.57.4' }, ;
      { '4.20.709', '4.20.2' }, ;
      { '4.15.750', '4.15.546' }, ;
      { '10.3.713', '10.3.13' }, ;
      { '4.1.712', '4.1.12' }, ;
      { '4.20.701', '4.20.1' }, ;
      { '4.14.766', '4.14.66' }, ;
      { '72.5.17', '2.3.2' }, ;
      { '72.5.18', '2.3.4' }, ;
      { '72.5.19', '2.3.15' }, ;
      { '72.5.20', '2.3.3' }, ;
      { '70.7.363', '2.3.7' }, ;
      { '70.7.364', '2.3.4' }, ;
      { '70.7.361', '2.3.15' }, ;
      { '70.7.362', '2.3.3' }, ;
      { '56.1.725', '56.1.16' }, ;
      { '3.1.720', '3.1.19' }, ;
      { '3.1.721', '3.1.5' }, ;
      { '4.12.962', '4.12.174' }, ;
      { '4.12.963', '4.12.169' }, ;
      { '56.1.726', '56.1.18' }, ;
      { '56.1.727', '56.1.19' }, ;
      { '7.61.705', '7.61.3' }, ;
      { '7.61.706', '7.61.4' }, ;
      { '13.1.703', '13.1.1' }, ;
      { '13.1.704', '13.1.2' }, ;
      { '3.4.710', '3.4.9' }, ;
      { '56.1.728', '56.1.14' }, ;
      { '4.11.741', '4.11.137' }, ;
      { '4.8.805', '4.8.4' }, ;
      { '7.57.705', '7.57.3' }, ;
      { '7.57.706', '7.57.4' }, ;
      { '4.20.704', '4.20.2' }, ;
      { '4.15.748', '4.15.546' }, ;
      { '10.3.714', '10.3.13' }, ;
      { '4.1.713', '4.1.12' }, ;
      { '4.20.703', '4.20.1' }, ;
      { '4.14.767', '4.14.66' }, ;
      { '70.7.762', '2.3.15' }, ;
      { '70.7.763', '2.3.3' }, ;
      { '70.7.764', '2.3.7' }, ;
      { '70.7.765', '2.3.4' }, ;
      { '56.1.729', '56.1.16' }, ;
      { '3.1.722', '3.1.19' }, ;
      { '3.1.723', '3.1.5' }, ;
      { '4.12.964', '4.12.174' }, ;
      { '4.12.965', '4.12.169' }, ;
      { '56.1.730', '56.1.18' }, ;
      { '56.1.731', '56.1.19' }, ;
      { '7.61.707', '7.61.3' }, ;
      { '7.61.708', '7.61.4' }, ;
      { '13.1.705', '13.1.1' }, ;
      { '13.1.706', '13.1.2' }, ;
      { '3.4.711', '3.4.9' }, ;
      { '56.1.732', '56.1.14' }, ;
      { '4.11.742', '4.11.137' }, ;
      { '4.8.806', '4.8.4' }, ;
      { '7.57.707', '7.57.3' }, ;
      { '7.57.708', '7.57.4' }, ;
      { '4.20.706', '4.20.2' }, ;
      { '4.15.749', '4.15.546' }, ;
      { '10.3.715', '10.3.13' }, ;
      { '4.1.714', '4.1.12' }, ;
      { '4.20.705', '4.20.1' }, ;
      { '4.14.768', '4.14.66' } ;
    }
  endif
  return arr

// 15.03.26
function arr_usl_2026( mobil )

  local arr_u2026, blk
  local etap := 1
  local age_etap_3 := { 19, 20, 22, 23, 25, 26, 28, 29, 31, 32, 34, 35, 37, 38 }

  default mobil to 0

  blk := { | d1, d2, d |
    Local i, arr := {}
    Default d To 1
    For i := d1 To d2 Step d
      AAdd( arr, i )
    Next
    Return arr
  }
/*
  if __mvExist( 'METAP' )
    etap := metap
  endif
*/
  // 1- наименование услуги
  // 2- шифр услуги
  // 3- этап (1, 2, 3, 4, 5)
  // 4- (0-диагностика, 1-осмотр врача)
  // 5-
  // 6- возрост (мужчины)
  // 7- возрост (женщины)
  // 8- мужчины (0-нет, 1-да) - похоже вывод на экран 
  // 9- женщины (0-нет, 1-да) - похоже вывод на экран
  // 10- V002 - Классификатор профилей оказанной медицинской помощи
  // 11- V004 - Классификатор медицинских специальностей
//    arr_u2026 := { ; // Услуги на экран для ввода
    arr_u2026 := {}
    AAdd( arr_u2026, ;
      { ;
        'Измерение внутриглазного давления', ;
        iif( mobil == 0, '3.4.709', '3.4.710' ), ;
        1, 0, 1, ;
        Eval( blk, 40, 99 ), ;
        Eval( blk, 40, 99 ), ;
        1, 1, 65, { 1112 } ;
      } ;
    ) // age_etap_3
    AAdd( arr_u2026, ;
      { ;
        'Исследование крови на общий холестерин', ;
        iif( mobil == 0, '4.12.967', '4.12.962' ), ;
        { 1, 3 }, 0, 1, ;
        1, 1, 1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Исследование уровня глюкозы в крови', ;
        iif( mobil == 0, '4.12.966', '4.12.963' ), ;
        { 1, 3 }, 0, 1, ;
        1, 1, 1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Клинический анализ крови (3 показателя)', ;
        iif( mobil == 0, '4.11.737', '4.11.741' ), ;
        1, 0, 1, ;
        Eval( blk, 40, 99 ), ;
        Eval( blk, 40, 99 ), ;
        1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Исследование кала на скрытую кровь', ;
        iif( mobil == 0, '4.8.807', '4.8.805' ), ;
        1, 0, 1, ;
        { 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75 }, ;
        { 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75 }, ;
        1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Кровь на простат-специфический антиген', ;
        iif( mobil == 0, '4.14.766', '4.14.767' ), ;
        1, 0, 1, ;
        { 45, 50, 55, 60, 64 }, ;
        0, ;
        1, 0, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Взятие мазка (соскоба) со слизистых полостей', ;
        iif( mobil == 0, '4.1.712', '4.1.713' ), ;
        1, 0, 1, ; // женщины
        0, ;
        { 18, 21, 24, 27, 30, 33, 36, 39, 42, 45, 48, 51, 54, 57, 60, 63 }, ;
        1, 1, { 3, 42, 136 }, { 2003, 2002, 1101 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Цит. жидкостное исл-ние скрининга рака шейки матки', ;
        iif( mobil == 0, '4.20.709', '4.20.704' ), ;
        1, 0, 1, ; // женщины
        0, ;
        { 18, 21, 24, 27, 30, 33, 36, 39, 42, 45, 48, 51, 54, 57, 60, 63 }, ;
        1, 0, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Иссл-е взятого цитологического материала', ;
        iif( mobil == 0, '4.20.701', '4.20.703' ), ;
        1, 0, 1, ; // если невозможна 4.1.12
        0, ;
        { 18, 21, 24, 27, 30, 33, 36, 39, 42, 45, 48, 51, 54, 57, 60, 63 }, ;     // то очистить
        1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };               // эту услугу
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Маммография', ;
        iif( mobil == 0, '7.57.703', '7.57.705' ), ;
        1, 0, 1, ; // женщины
        0, ;
        { 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74 }, ;
        0, 1, 78, { 1118, 1802, 2020 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Маммография цифровая с ИИ', ;
        iif( mobil == 0, '7.57.709', '7.57.706' ), ;
        1, 0, 1, ; // женщины
        0, ;
        { 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74 }, ;
        0, 1, 78, { 1118, 1802, 2020 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Флюорография лёгких в 1-й проекции', ;
        iif ( mobil == 0, '7.61.703', '7.61.705' ), ;
        { 1, 3 }, 0, 1, ;
        Eval( blk, 18, 99, 2 ), ;
        Eval( blk, 18, 99, 2 ), ;
        Eval( blk, 18, 99, 2 ), ;
        Eval( blk, 18, 99, 2 ), ;
        78, { 1118, 1802, 2020 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Флюорография лёгких цифровая с ИИ', ;
        iif ( mobil == 0, '7.61.709', '7.61.706' ), ;
        { 1, 3 }, 0, 1, ;
        Eval( blk, 18, 99, 2 ), ;
        Eval( blk, 18, 99, 2 ), ;
        Eval( blk, 18, 99, 2 ), ;
        Eval( blk, 18, 99, 2 ), ;
        78, { 1118, 1802, 2020 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Электрокардиография', ;
        iif( mobil == 0, '13.1.701', '13.1.703' ), ;
        { 1, 3 }, 0, 1, ;
        Eval( blk, 35, 99 ), ;
        Eval( blk, 35, 99 ), ;
        Eval( blk, 35, 99 ), ;
        Eval( blk, 35, 99 ), ;
        111, { 110103, 110303, 110906, 111006, 111905, 112212, 112611, 113418, 113509, 180202, 2021 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Электрокардиография с применением ИИ', ;
        iif( mobil == 0, '13.1.707', '13.1.704' ), ;
        { 1, 3 }, 0, 1, ;
        Eval( blk, 35, 99 ), ;
        Eval( blk, 35, 99 ), ;
        Eval( blk, 35, 99 ), ;
        Eval( blk, 35, 99 ), ;
        111, { 110103, 110303, 110906, 111006, 111905, 112212, 112611, 113418, 113509, 180202, 2021 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Исследование крови на Anti-HCV-total', ;
        iif( mobil == 0, '4.15.750', '4.15.748'), ;
        { 1, 3 }, 0, 1, ;
        { 25, 35, 45, 55, 65, 75, 85, 95 }, ;
        { 25, 35, 45, 55, 65, 75, 85, 95 }, ;
        1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Фиброэзофагогастродуоденоскопия', ;
        iif( mobil == 0, '10.3.713', '10.3.714' ), ;
        1, 0, 1, ;
        { 45 }, ;
        { 45 }, ;
        1, 1, 123, { 110104, 111007, 112221, 112609, 113419, 113511 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Осмотр акушеркой или акушером-гинекологом', ;
        iif( mobil == 0, { '70.7.61', '70.7.62' }, { '70.7.361', '70.7.362' } ), ;
        1, 1, 1, ; // женщины not found 1, 0, 1, ; // женщины not found
        0, 1, 0, 1, { 136, 3, 42 }, { 1101, 2003, 2002 }, ;
        { ;
          { { '70.7.61', '70.7.361' }, 136 }, ;
          { { '70.7.62', '70.7.362' }, 3 }, ;
          { { '70.7.62', '70.7.362' }, 42 } ;
        }, ;
        1, 1;
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Спирометрия', ;
        '16.1.717', ;
        2, 0, 1, ;
        1, 1, 1, 1, 111, { 110103, 110303, 110906, 111006, 111905, 112212, 112611, 113418, 113509, 180202, 2021 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Исследование крови на гликированный гемо-ин', ;
        '4.12.775', ;   // '4.12.870' письмо Мызгина 10.03.26
        2, 0, 1, ;
        1, 1, 1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Фиброэзофагогастродуоденоскопия', ;
        '10.3.713', ;
        2, 0, 1, ;
        1, 1, 1, 1, 123, { 110104, 111007, 112221, 112609, 113419, 113511 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Дуплексное сканир-ие брахиоцефальных артерий', ;
        '8.23.706', ;
        2, 0, 1, ;
        1, 1, 1, 1, 106, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Рентгенография органов грудной клетки', ;
        '7.2.702', ;
        2, 0, 1, ;
        1, 1, 1, 1, 78, { 1118, 1802 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'КТ органов грудной полости', ;
        '7.2.701', ;
        2, 0, 1, ;
        1, 1, 1, 1, 78, { 1118, 1802 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Спиральная КТ легких', ;
        '7.2.703', ;
        2, 0, 1, ;
        1, 1, 1, 1, 78, { 1118, 1802 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'КТ органов грудной полости (с контрастир-ием)', ;
        '7.2.704', ;
        2, 0, 1, ;
        1, 1, 1, 1, 78, { 1118, 1802 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Однофотонная эмиссионная КТ легких', ;
        '7.2.705', ;
        2, 0, 1, ;
        1, 1, 1, 1, 78, { 1118, 1802 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Ректосигмоколоноскопия диагностическая', ;
        '10.6.710', ;
        2, 0, 1, ;
        1, 1, 1, 1, 123, { 110104, 111007, 112221, 112609, 113419, 113511 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Ректороманоскопия', ;
        '10.4.701', ;
        2, 0, 1, ;
        1, 1, 1, 1, 123, { 110104, 111007, 112221, 112609, 113419, 113511 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Углубленное профилактическое консультирование', ;
        '56.1.723', ;
        2, 0, 1, ;
        1, 1, 1, 1, { 97, 57, 42 }, { 1122, 1110, 2002 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Приём врача невролога', ;
        '2.84.1', ;
        2, 1, 0, ;
        1, 1, 1, 1, 53, { 1109 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Приём врача офтальмолога', ;
        '2.84.3', ;
        2, 1, 0, ;
        1, 1, 1, 1, 65, { 1112 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Приём врача оториноларинголога', ;
        '2.84.8', ;
        2, 1, 0, ;
        1, 1, 1, 1, 162, { 1111 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Приём врача уролога (хирурга)', ;
        '2.84.10', ;
        2, 1, 0, ;
        1, 0, 1, 0, { 108, 112 }, { 112603, 1126 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Приём врача акушера-гинеколога', ;
        '2.84.5', ;
        2, 1, 0, ;
        1, 1, 0, 1, 136, { 1101 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Приём врача колопроктолога (хирурга)', ;
        '2.84.6', ;
        2, 1, 0, ;
        1, 1, 1, 1, { 30, 30, 112 }, { 112601, 113503, 1126 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Приём врача дерматовенеролог', ;
        '2.84.14', ;
        2, 1, 0, ;
        1, 1, 1, 1, 16, { 1104 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Приём врача терапевта (фельдшера)', ;
        iif( mobil == 0, { '70.7.63', '70.7.64' }, { '70.7.363', '70.7.364' } ), ;
        1, 1, 0, ;
        1, 1, 1, 1, { 97, 57, 42 }, { 1122, 1110, 2002 }, ;
        { ;
          { { '70.7.63', '70.7.363' }, 57 }, ;
          { { '70.7.63', '70.7.363' }, 97 }, ;
          { { '70.7.64', '70.7.364' }, 42 } ;
        }, 1, 1;
      } ;
    )
    AAdd( arr_u2026, ;
      { ; 
        'Приём врача акушера-гинеколога (акушерки)', ;
        iif( mobil == 0, { '72.5.19', '72.5.20' }, { '72.5.319', '72.5.320' } ), ;
        3, 1, 0, ;
        0, ;
        age_etap_3, ;
        0, 1, { 136, 3, 42 }, { 1101, 2003, 2002 }, ;
        { ;
          { { '72.5.19', '72.5.319' }, 136 }, ;
          { { '72.5.20', '72.5.320' }, 3 }, ;
          { { '72.5.20', '72.5.320' }, 42 } ;
        }, 1, 1;
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Приём врача терапевта ( фельдшера )', ;
        iif( mobil == 0, { '72.5.17', '72.5.18' }, { '72.5.317', '72.5.318' } ), ;
        3, 1, 0, ;
        age_etap_3, ;
        age_etap_3, ;
        1, 1, { 97, 57, 42 }, { 1122, 1110, 2002 }, ;
        { ;
          { { '72.5.17', '72.5.317' }, 57 }, ;
          { { '72.5.17', '72.5.317' }, 97 }, ;
          { { '72.5.18', '72.5.318' }, 42 } ;
        }, 1, 1;
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Приём врача терапевта для заключения 2 этап', ;
        '2.84.11', ;
        2, 1, 0, ;
        1, 1, 1, 1, { 97, 57, 42 }, { 1122, 1110, 2002 }, ;
        { ;
          { '2.84.11', 57 }, ;
          { '2.84.11', 97 } ;
        }, ;
        1, 1;
      } ;
    )
//    }
//      { ;
//        'Исследование крови на Anti-HCV-total', iif( mobil == 0, '4.15.750', '4.15.748' ), 3, 0, 1, ;
//        { 25, 35 }, ;
//        { 25, 35 }, ;
//        1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
//      }, ;

  return arr_u2026

// 23.02.26
function dvn_arr_umolch( dateSl, mobil )
  
  local arr
  
  Default dateSl To 0d20260101  // 0d20210101
  default mobil to 0
  if dateSl >= 0d20260101
    arr := { ; // услуги, записываемые всегда по умолчанию
      { 'Опрос (анкетирование)', iif( mobil == 0, '56.1.716', '56.1.725' ), { 1, 3 }, 1, 1, 1, 1, 0 }, ;
      { 'Измерение артериального давления', iif( mobil == 0, '3.1.705', '3.1.721' ), { 1, 3 }, 1, 1, 1, 1, 0 }, ;
      { 'Антропометрия, расчёт индекса массы тела', iif( mobil == 0, '3.1.719', '3.1.720' ), { 1, 3 }, 1, 1, 1, 1, 0 }, ;
      { 'Определение относительного суммарного сердечно-сосудистого риска', iif( mobil == 0, '56.1.718', '56.1.726' ), { 1, 3 }, { 18, 39 }, { 18, 39 }, { 18, 39 }, { 18, 39 }, 1 }, ;
      { 'Определение абсолютного суммарного сердечно-сосудистого риска', iif( mobil == 0, '56.1.719', '56.1.727' ), 1, { 40, 64 }, { 40, 64 }, 1, 1, 1 }, ;
      { 'Краткое индивидуальное профилактическое консультирование', iif( mobil == 0, '56.1.724', '56.1.728' ), 1, '18, 65', '18, 65', 1, 1, 1 };
    }
  elseif dateSl >= 0d20190101 .and. dateSl < 0d20260101
    arr := { ; // услуги, записываемые всегда по умолчанию
      { 'Опрос (анкетирование)', '56.1.16', { 1, 3 }, 1, 1, 1, 1, 0 }, ;
      { 'Измерение артериального давления', '3.1.5', { 1, 3 }, 1, 1, 1, 1, 0 }, ;
      { 'Антропометрия, расчёт индекса массы тела', '3.1.19', { 1, 3 }, 1, 1, 1, 1, 0 }, ;
      { 'Определение относительного суммарного сердечно-сосудистого риска', '56.1.18', { 1, 3 }, { 18, 39 }, { 18, 39 }, { 18, 39 }, { 18, 39 }, 1 }, ;
      { 'Определение абсолютного суммарного сердечно-сосудистого риска', '56.1.19', 1, { 40, 64 }, { 40, 64 }, 1, 1, 1 }, ;
      { 'Краткое индивидуальное профилактическое консультирование', '56.1.14', 1, '18, 65', '18, 65', 1, 1, 1 };
    }
  else
    arr := { ; // услуги, записываемые всегда по умолчанию
      { 'Опрос (анкетирование)', '56.1.16', { 1, 3 }, 1, 1, 1, 1, 0 }, ;
      { 'Измерение артериального давления', '3.1.5', { 1, 3 }, 1, 1, 1, 1, 0 }, ;
      { 'Антропометрия', '3.1.19', { 1, 3 }, 1, 1, 1, 1, 0 }, ;
      { 'Определение относительного суммарного сердечно-сосудистого риска', '56.1.18', 1, { 21, 39 }, { 21, 39 }, 1, 1, 1 }, ;
      { 'Определение абсолютного суммарного сердечно-сосудистого риска', '56.1.19', 1, { 42, 63 }, { 42, 63 }, 1, 1, 1 }, ;
      { 'Индивидуальное профилактическое консультирование', '56.1.21', 1, 1, 1, 1, 1, 1 }, ; // new
      { 'Определение группы состояния здоровья', '56.1.13', 3, 1, 1, 1, 1, 1 }, ;
      { 'Краткое профилактическое консультирование', '56.1.14', 3, 1, 1, 1, 1, 1 }, ;
      { 'Определение суммарного сердечно-сосудистого риска', '56.1.17', 3, 1, 1, { 18, 65 }, { 18, 65 }, 1 };
    }
  Endif

  return arr

// 04.03.26
function dvn_arr_usl( dateSl, mobil )

  local arr_dvn_usl

  Default dateSl To 0d20210101
  default mobil to 0
  arr_dvn_usl := {}
  If dateSl >= 0d20260101
    arr_dvn_usl := arr_usl_2026( mobil )
  elseIf ( dateSl >= 0d20210101 ) .and. ( dateSl < 0d20260101 )
    arr_dvn_usl := arr_usl_2021( dateSl, mobil, mdvozrast )
  Elseif ( dateSl >= 0d20190101 ) .and. ( dateSl < 0d20210101 )
    arr_dvn_usl := arr_usl_2019( mobil )
  else
    arr_dvn_usl := arr_usl_2018( mobil )
  Endif

  return arr_dvn_usl

// 10.03.26 скорректировать массивы по диспансеризации
Function ret_arrays_disp( dateSl )

  Default dateSl To 0d20210101

  if dateSl >= 0d20260101
    dvn_arr_usl := arr_usl_2026()
  elseIf dateSl >= 0d20210101 .and. dateSl < 0d20260101
    dvn_arr_usl := arr_usl_2021( dateSl ) //, mobil, mdvozrast )
  Elseif ( dateSl >= 0d20190101 ) .and. ( dateSl < 0d20210101 )
    dvn_arr_usl := arr_usl_2019()
  else
    dvn_arr_usl := arr_usl_2018()
  Endif

  //
  dvn_arr_umolch := dvn_arr_umolch( dateSl )

  count_dvn_arr_usl := Len( dvn_arr_usl )
  count_dvn_arr_umolch := Len( dvn_arr_umolch )

  Return Nil

// 20.02.26
function dvn_700( dateSl )

  local arr

  if dateSl >= 0d20260101
    arr := {}
  else
    arr := { ; // какие услуги с ценой добавить к нулевым услугам
      { '2.3.5','2.90.3'  }, ; // приём терапевта дисп-ия 1 этап (1 раз в 3 года)
      { '2.3.6','2.90.4'  }, ; // приём терапевта дисп-ия 1 этап (1 раз в 2 года)
      { '2.3.3','2.90.2'  }, ; // посещение к фельдшеру
      { '3.4.9','3.4.709' }, ; // 'Измерение внутриглазного давления'
      { '4.12.174', '4.12.774' }, ; // 'Исследование крови на общий холестерин'
      { '4.12.169', '4.12.769' }, ; // 'Исследование уровня глюкозы в крови'
      { '4.8.4','4.8.704' }, ; // 'Исследование кала на скрытую кровь'
      { '4.14.66','4.14.766' }, ; // 'Кровь на простат-специфический антиген',
      { '4.1.12','4.1.712' }, ; // 'Осмотр акушеркой, взятие мазка (соскоба)'
      { '4.20.1','4.20.701' }, ; // 'Иссл-е взятого цитологического материала'
      { '7.57.3','7.57.703' }, ; // 'Маммография'
      { '7.61.3','7.61.703' }, ; // 'Флюорография лёгких'
      { '13.1.1','13.1.701' }, ; // 'Электрокардиография'
      { '3.1.5','3.1.705' }, ; // 'Измерение артериального давления'
      { '3.1.19','3.1.719' }, ; // 'Антропометрия'
      { '56.1.16','56.1.716' }, ; // 'Опрос (анкетирование)'
      { '56.1.18','56.1.718' }, ; // 'Определение относительного суммарного сердечно-сосудистого риска'
      { '56.1.19','56.1.719' }, ; // 'Определение абсолютного суммарного сердечно-сосудистого риска'
      { '56.1.21','56.1.721' };  // 'Индивидуальное профилактическое консультирование'
    }
  endif

  return arr

// 30.01.26
function dvn_85()
  
  return { ; // кол-во услуг, составляющих 85% - диспансеризация
    { 7, 6 }, { 8, 7 }, { 9, 8 }, { 10, 9 }, { 11, 9 }, { 12, 10 }, { 13, 11 }, { 14, 12 }, { 15, 13 }, { 16, 13 }, { 17, 14 };
  }

// 30.01.26
function prof_vn_85()
  
  return { ; // кол-во услуг, составляющих 85% - профилактика
    { 9, 8 }, { 10, 9 }, { 11, 10 }, { 12, 11 }, { 13, 11 }, { 14, 12 }, { 15, 13 }, { 16, 14 };
  }

  // 17.02.26
function mm_ndisp_dvn()
  
  return { ;
    { 'Диспансеризация I  этап', 1 }, ;
    { 'Диспансеризация II этап', 2 }, ;
    { 'Профилактический осмотр', 3 }, ;
    { 'Дисп.1этап(раз в 2года)', 4 }, ;
    { 'Дисп.2этап(раз в 2года)', 5 } }

// 23.02.26
function dvn_2_etap()
  
  return { ; // обязательное сочетание услуг второго этапа
            { { '2.84.1' }, { '8.23.706' }, 45, 90 }, ; // невролог
            { { '2.84.11' }, { '8.23.706' }, 45, 90 }, ; // терапевт
            { { '2.84.6' }, { '10.6.710', '10.4.701' }, 40, 75 };  // колопроктолог
          }
