// режимы настройки данных для диспансеризации взрослого населения - oms_DVN_setup.prg
#include 'inkey.ch'
#include 'function.ch'
#include 'edit_spr.ch'
#include 'chip_mo.ch'

// 30.01.26
function arr_vozrast_DVN()
  
  return { 21, 24, 27, 30, 33, 36, 39, 42, 45, 48, 51, 54, 57, 60, 63, 66, 69, 72, 75, 78, 81, 84, 87, 90, 93, 96, 99 }

// 30.01.26
function arr2m_vozrast_DVN()
  
  return { 49, 53, 55, 59, 61, 65, 67, 71, 73 } // 1 раз в 2 года все

// 30.01.26
function arr2g_vozrast_DVN()
  
  return { 50, 52, 56, 58, 62, 64, 68, 70 }    // 1 раз в 2 года женщины

// 08.03.26
function get_zamenauslugi_dvn( mdate, codeUsl )

  local i, retShifr := ''
  local arr_zam := replace_uslugi_otkaz( mdate )

  i := ascan( arr_zam, { | x | x[ 1 ] == codeUsl } )
  if i > 0
    retShifr := arr_zam[ i, 2 ]
  endif

  return retShifr

// 09.03.26
function replace_uslugi_otkaz( mdate )

  local arr := {}

  if mdate >= 0d20260101
    arr := { ;
      { '70.7.63', '2.3.7', }, ;
      { '70.7.64', '2.3.4', }, ;
      { '70.7.61', '2.3.15', }, ;
      { '70.7.62', '2.3.3', }, ;
      { '56.1.716', '56.1.16', }, ;
      { '3.1.719', '3.1.19', }, ;
      { '3.1.705', '3.1.5', }, ;
      { '4.12.967', '4.12.174', }, ;
      { '4.12.966', '4.12.169', }, ;
      { '56.1.718', '56.1.18', }, ;
      { '56.1.719', '56.1.19', }, ;
      { '7.61.703', '7.61.3', }, ;
      { '7.61.709', '7.61.4', }, ;
      { '13.1.701 ', '13.1.1', }, ;
      { '13.1.707', '13.1.2', }, ;
      { '3.4.709', '3.4.9', }, ;
      { '56.1.724', '56.1.14', }, ;
      { '4.11.737', '4.11.137', }, ;
      { '4.8.807', '4.8.4', }, ;
      { '7.57.703', '7.57.3', }, ;
      { '7.57.709', '7.57.4', }, ;
      { '4.20.709', '4.20.2', }, ;
      { '4.15.750', '4.15.546', }, ;
      { '10.3.713', '10.3.13', }, ;
      { '4.1.712', '4.1.12', }, ;
      { '4.20.701', '4.20.1', }, ;
      { '4.14.766', '4.14.66', }, ;
      { '72.5.17', '2.3.2' }, ;
      { '72.5.18', '2.3.4' }, ;
      { '72.5.19', '2.3.15' }, ;
      { '72.5.20', '2.3.3' } ;
    }
/*
      { '70.7.363', '2.3.7', }, ;
      { '70.7.364', '2.3.4', }, ;
      { '70.7.361', '2.3.15', }, ;
      { '70.7.362', '2.3.3', }, ;
      { '56.1.725', '56.1.16', }, ;
      { '3.1.720', '3.1.19', }, ;
      { '3.1.721', '3.1.5', }, ;
      { '4.12.962', '4.12.174', }, ;
      { '4.12.963', '4.12.169', }, ;
      { '56.1.726', '56.1.18', }, ;
      { '56.1.727', '56.1.19', }, ;
      { '7.61.705', '7.61.3', }, ;
      { '7.61.706', '7.61.4', }, ;
      { '13.1.703', '13.1.1', }, ;
      { '13.1.704', '13.1.2', }, ;
      { '3.4.710', '3.4.9', }, ;
      { '56.1.728', '56.1.14', }, ;
      { '4.11.741', '4.11.137', }, ;
      { '4.8.805', '4.8.4', }, ;
      { '7.57.705', '7.57.3', }, ;
      { '7.57.706', '7.57.4', }, ;
      { '4.20.704', '4.20.2', }, ;
      { '4.15.748', '4.15.546', }, ;
      { '10.3.714', '10.3.13', }, ;
      { '4.1.713', '4.1.12', }, ;
      { '4.20.703', '4.20.1', }, ;
      { '4.14.767', '4.14.66', }, ;
      { '70.7.762', '2.3.15', }, ;
      { '70.7.763', '2.3.3', }, ;
      { '70.7.764', '2.3.7', }, ;
      { '70.7.765', '2.3.4', }, ;
      { '56.1.729', '56.1.16', }, ;
      { '3.1.722', '3.1.19', }, ;
      { '3.1.723', '3.1.5', }, ;
      { '4.12.964', '4.12.174', }, ;
      { '4.12.965', '4.12.169', }, ;
      { '56.1.730', '56.1.18', }, ;
      { '56.1.731', '56.1.19', }, ;
      { '7.61.707', '7.61.3', }, ;
      { '7.61.708', '7.61.4', }, ;
      { '13.1.705', '13.1.1', }, ;
      { '13.1.706', '13.1.2', }, ;
      { '3.4.711', '3.4.9', }, ;
      { '56.1.732', '56.1.14', }, ;
      { '4.11.742', '4.11.137', }, ;
      { '4.8.806', '4.8.4', }, ;
      { '7.57.707', '7.57.3', }, ;
      { '7.57.708', '7.57.4', }, ;
      { '4.20.706', '4.20.2', }, ;
      { '4.15.749', '4.15.546', }, ;
      { '10.3.715', '10.3.13', }, ;
      { '4.1.714', '4.1.12', }, ;
      { '4.20.705', '4.20.1', }, ;
      { '4.14.768', '4.14.66', } ;
    }
*/
  endif
  return arr

// 12.03.26
function arr_usl_2026( mobil )

  local arr_u2026, blk
  local etap := 1
  local age_etap_3 := { 19, 20, 22, 23, 25, 26, 28, 29, 31, 32, 34, 35, 37, 38 }

  default mobil to 0

  blk := { | d1, d2, d |
    Local i, arr := {}
    Default d To 1
    For i := d1 To d2 Step d
      AAdd( arr, i )
    Next
    Return arr
  }
/*
  if __mvExist( 'METAP' )
    etap := metap
  endif
*/
  // 1- наименование меню
  // 2- шифр услуги
  // 3- этап (1, 2, 3, 4, 5)
  // 4- что-то связано с диагнозом
  // 5-
  // 6- возрост (мужчины)
  // 7- возрост (женщины)
  // 8- мужчины (0-нет, 1-да) - похоже вывод на экран 
  // 9- женщины (0-нет, 1-да) - похоже вывод на экран
  // 10- V002 - Классификатор профилей оказанной медицинской помощи
  // 11- V004 - Классификатор медицинских специальностей
//    arr_u2026 := { ; // Услуги на экран для ввода
    arr_u2026 := {}
    AAdd( arr_u2026, ;
      { ;
        'Измерение внутриглазного давления', '3.4.709', 1, 0, 1, ;
        Eval( blk, 40, 99 ), ;
        Eval( blk, 40, 99 ), ;
        1, 1, 65, { 1112 } ;
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Исследование крови на общий холестерин', '4.12.967', { 1, 3 }, 0, 1, ;
        1, 1, 1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Исследование уровня глюкозы в крови', '4.12.966', { 1, 3 }, 0, 1, ;
        1, 1, 1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Клинический анализ крови (3 показателя)', '4.11.737', 1, 0, 1, ;
        Eval( blk, 40, 99 ), ;
        Eval( blk, 40, 99 ), ;
        1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Исследование кала на скрытую кровь', '4.8.807', 1, 0, 1, ;
        { 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75 }, ;
        { 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75 }, ;
        1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Кровь на простат-специфический антиген', '4.14.766', 1, 0, 1, ;
        { 45, 50, 55, 60, 64 }, ;
        0, ;
        1, 0, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Осмотр акушеркой или акушером-гинекологом', { '70.7.61', '70.7.62' }, 1, 0, 1, ; // женщины not found
        0, 1, 0, 1, { 136, 3, 42 }, { 1101, 2003, 2002 }, ;
        { ;
          { '70.7.61', 136 }, ;
          { '70.7.62', 3 }, ;
          { '70.7.62', 42 } ;
        }, ;
        1, 1;
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Взятие мазка (соскоба) со слизистых полостей', '4.1.712', 1, 0, 1, ; // женщины
        0, ;
        { 18, 21, 24, 27, 30, 33, 36, 39, 42, 45, 48, 51, 54, 57, 60, 63 }, ;
        1, 1, { 3, 42, 136 }, { 2003, 2002, 1101 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Иссл-е взятого цитологического материала', '4.20.701', 1, 0, 1, ; // если невозможна 4.1.12
        0, ;
        { 18, 21, 24, 27, 30, 33, 36, 39, 42, 45, 48, 51, 54, 57, 60, 63 }, ;     // то очистить
        1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };               // эту услугу
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Маммография обеих молочных желез', '7.57.703', 1, 0, 1, ; // женщины
        0, ;
        { 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74 }, ;
        0, 1, 78, { 1118, 1802, 2020 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Флюорография лёгких профилактическая', '7.61.703', { 1, 3 }, 0, 1, ;
        Eval( blk, 18, 99, 2 ), ;
        Eval( blk, 18, 99, 2 ), ;
        Eval( blk, 18, 99, 2 ), ;
        Eval( blk, 18, 99, 2 ), ;
        78, { 1118, 1802, 2020 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Электрокардиография (в покое)', '13.1.701', { 1, 3 }, 0, 1, ;
        Eval( blk, 35, 99 ), ;
        Eval( blk, 35, 99 ), ;
        Eval( blk, 35, 99 ), ;
        Eval( blk, 35, 99 ), ;
        111, { 110103, 110303, 110906, 111006, 111905, 112212, 112611, 113418, 113509, 180202, 2021 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Исследование крови на Anti-HCV-total', '4.15.750', { 1, 3 }, 0, 1, ;
        { 25, 35, 45, 55, 65, 75, 85, 95 }, ;
        { 25, 35, 45, 55, 65, 75, 85, 95 }, ;
        1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Фиброэзофагогастродуоденоскопия', '10.3.713', 1, 0, 1, ;
        { 45 }, ;
        { 45 }, ;
        1, 1, 123, { 110104, 111007, 112221, 112609, 113419, 113511 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Спирометрия', '16.1.717', 2, 0, 1, ;
        1, 1, 1, 1, 111, { 110103, 110303, 110906, 111006, 111905, 112212, 112611, 113418, 113509, 180202, 2021 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Исследование крови на гликированный гемо-ин', '4.12.775', 2, 0, 1, ;   // '4.12.870' письмо Мызгина 10.03.26
        1, 1, 1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Фиброэзофагогастродуоденоскопия', '10.3.713', 2, 0, 1, ;
        1, 1, 1, 1, 123, { 110104, 111007, 112221, 112609, 113419, 113511 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Дуплексное сканир-ие брахиоцефальных артерий', '8.23.706', 2, 0, 1, ;
        1, 1, 1, 1, 106, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Рентгенография органов грудной клетки', '7.2.702', 2, 0, 1, ;
        1, 1, 1, 1, 78, { 1118, 1802 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'КТ органов грудной полости', '7.2.701', 2, 0, 1, ;
        1, 1, 1, 1, 78, { 1118, 1802 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Спиральная КТ легких', '7.2.703', 2, 0, 1, ;
        1, 1, 1, 1, 78, { 1118, 1802 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'КТ органов грудной полости (с контрастир-ием)', '7.2.704', 2, 0, 1, ;
        1, 1, 1, 1, 78, { 1118, 1802 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Однофотонная эмиссионная КТ легких', '7.2.705', 2, 0, 1, ;
        1, 1, 1, 1, 78, { 1118, 1802 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Ректосигмоколоноскопия диагностическая', '10.6.710', 2, 0, 1, ;
        1, 1, 1, 1, 123, { 110104, 111007, 112221, 112609, 113419, 113511 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Ректороманоскопия', '10.4.701', 2, 0, 1, ;
        1, 1, 1, 1, 123, { 110104, 111007, 112221, 112609, 113419, 113511 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Углубленное профилактическое консультирование', '56.1.723', 2, 0, 1, ;
        1, 1, 1, 1, { 97, 57, 42 }, { 1122, 1110, 2002 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Приём врача невролога', '2.84.1', 2, 1, 0, ;
        1, 1, 1, 1, 53, { 1109 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Приём врача офтальмолога', '2.84.3', 2, 1, 0, ;
        1, 1, 1, 1, 65, { 1112 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Приём врача оториноларинголога', '2.84.8', 2, 1, 0, ;
        1, 1, 1, 1, 162, { 1111 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Приём врача уролога (хирурга)', '2.84.10', 2, 1, 0, ;
        1, 1, 1, 0, { 108, 112 }, { 112603, 1126 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Приём врача акушера-гинеколога', '2.84.5', 2, 1, 0, ;
        1, 1, 0, 1, 136, { 1101 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Приём врача колопроктолога (хирурга)', '2.84.6', 2, 1, 0, ;
        1, 1, 1, 1, { 30, 30, 112 }, { 112601, 113503, 1126 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Приём врача дерматовенеролог', '2.84.14', 2, 1, 0, ;
        1, 1, 1, 1, 16, { 1104 };
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Приём врача терапевта (фельдшера)', '70.7.63', 1, 1, 0, ;
        1, 1, 1, 1, { 97, 57, 42 }, { 1122, 1110, 2002 }, ;
        { ;
          { '70.7.63', 57 }, ;
          { '70.7.63', 97 }, ;
          { '70.7.64', 42 } ;
        }, 1, 1;
      } ;
    )
    AAdd( arr_u2026, ;
      { ; 
        'Приём врача акушера-гинеколога (акушерки)', { '72.5.19', '72.5.20' }, ;
        3, 1, 0, ;
        0, ;
        age_etap_3, ;
        0, 1, { 136, 3, 42 }, { 1101, 2003, 2002 }, ;
        { ;
          { '72.5.19', 136 }, ;
          { '72.5.20', 3 }, ;
          { '72.5.20', 42 } ;
        }, 1, 1;
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Приём врача терапевта ( фельдшера )', { '72.5.17', '72.5.18' }, 3, 1, 0, ;
        age_etap_3, ;
        age_etap_3, ;
        1, 1, { 97, 57, 42 }, { 1122, 1110, 2002 }, ;
        { ;
          { '72.5.17', 57 }, ;
          { '72.5.17', 97 }, ;
          { '72.5.18', 42 } ;
        }, 1, 1;
      } ;
    )
    AAdd( arr_u2026, ;
      { ;
        'Приём врача терапевта для заключения 2 этап', '2.84.11', 2, 1, 0, ;
        1, 1, 1, 1, { 97, 57, 42 }, { 1122, 1110, 2002 }, ;
        { ;
          { '2.84.11', 57 }, ;
          { '2.84.11', 97 } ;
        }, ;
        1, 1;
      } ;
    )
//    }
//      { ;
//        'Исследование крови на Anti-HCV-total', iif( mobil == 0, '4.15.750', '4.15.748' ), 3, 0, 1, ;
//        { 25, 35 }, ;
//        { 25, 35 }, ;
//        1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
//      }, ;

  return arr_u2026

// 23.02.26
function dvn_arr_umolch( dateSl, mobil )
  
  local arr
  
  Default dateSl To 0d20260101  // 0d20210101
  default mobil to 0
  if dateSl >= 0d20260101
    arr := { ; // услуги, записываемые всегда по умолчанию
      { 'Опрос (анкетирование)', '56.1.716', { 1, 3 }, 1, 1, 1, 1, 0 }, ;
      { 'Измерение артериального давления', '3.1.705', { 1, 3 }, 1, 1, 1, 1, 0 }, ;
      { 'Антропометрия, расчёт индекса массы тела', '3.1.719', { 1, 3 }, 1, 1, 1, 1, 0 }, ;
      { 'Определение относительного суммарного сердечно-сосудистого риска', '56.1.718', { 1, 3 }, { 18, 39 }, { 18, 39 }, { 18, 39 }, { 18, 39 }, 1 }, ;
      { 'Определение абсолютного суммарного сердечно-сосудистого риска', '56.1.719', 1, { 40, 64 }, { 40, 64 }, 1, 1, 1 }, ;
      { 'Краткое индивидуальное профилактическое консультирование', '56.1.724', 1, '18, 65', '18, 65', 1, 1, 1 };
    }
  elseif dateSl >= 0d20190101 .and. dateSl < 0d20260101
    arr := { ; // услуги, записываемые всегда по умолчанию
      { 'Опрос (анкетирование)', '56.1.16', { 1, 3 }, 1, 1, 1, 1, 0 }, ;
      { 'Измерение артериального давления', '3.1.5', { 1, 3 }, 1, 1, 1, 1, 0 }, ;
      { 'Антропометрия, расчёт индекса массы тела', '3.1.19', { 1, 3 }, 1, 1, 1, 1, 0 }, ;
      { 'Определение относительного суммарного сердечно-сосудистого риска', '56.1.18', { 1, 3 }, { 18, 39 }, { 18, 39 }, { 18, 39 }, { 18, 39 }, 1 }, ;
      { 'Определение абсолютного суммарного сердечно-сосудистого риска', '56.1.19', 1, { 40, 64 }, { 40, 64 }, 1, 1, 1 }, ;
      { 'Краткое индивидуальное профилактическое консультирование', '56.1.14', 1, '18, 65', '18, 65', 1, 1, 1 };
    }
  else
    arr := { ; // услуги, записываемые всегда по умолчанию
      { 'Опрос (анкетирование)', '56.1.16', { 1, 3 }, 1, 1, 1, 1, 0 }, ;
      { 'Измерение артериального давления', '3.1.5', { 1, 3 }, 1, 1, 1, 1, 0 }, ;
      { 'Антропометрия', '3.1.19', { 1, 3 }, 1, 1, 1, 1, 0 }, ;
      { 'Определение относительного суммарного сердечно-сосудистого риска', '56.1.18', 1, { 21, 39 }, { 21, 39 }, 1, 1, 1 }, ;
      { 'Определение абсолютного суммарного сердечно-сосудистого риска', '56.1.19', 1, { 42, 63 }, { 42, 63 }, 1, 1, 1 }, ;
      { 'Индивидуальное профилактическое консультирование', '56.1.21', 1, 1, 1, 1, 1, 1 }, ; // new
      { 'Определение группы состояния здоровья', '56.1.13', 3, 1, 1, 1, 1, 1 }, ;
      { 'Краткое профилактическое консультирование', '56.1.14', 3, 1, 1, 1, 1, 1 }, ;
      { 'Определение суммарного сердечно-сосудистого риска', '56.1.17', 3, 1, 1, { 18, 65 }, { 18, 65 }, 1 };
    }
  Endif

  return arr

// 04.03.26
function dvn_arr_usl( dateSl, mobil )

  local arr_dvn_usl //  , blk
//  local age_etap_3 := { 19, 20, 22, 23, 25, 26, 28, 29, 31, 32, 34, 35, 37, 38 }

  Default dateSl To 0d20210101
  default mobil to 0

//  blk := { | d1, d2, d |
//    Local i, arr := {}
//    Default d To 1
//    For i := d1 To d2 Step d
//      AAdd( arr, i )
//    Next
//    Return arr
//  }
  // 1- наименование меню
  // 2- шифр услуги
  // 3- этап (1, 2, 3, 4, 5)
  // 4- что-то связано с диагнозом
  // 5-
  // 6- возрост (мужчины)
  // 7- возрост (женщины)
  // 8-
  // 9-
  // 10- V002 - Классификатор профилей оказанной медицинской помощи
  // 11- V004 - Классификатор медицинских специальностей
  arr_dvn_usl := {}
  If dateSl >= 0d20260101
    arr_dvn_usl := arr_usl_2026( mobil )
  elseIf ( dateSl >= 0d20210101 ) .and. ( dateSl < 0d20260101 )
    arr_dvn_usl := arr_usl_2021( dateSl, mobil, mdvozrast )
  Elseif ( dateSl >= 0d20190101 ) .and. ( dateSl < 0d20210101 )
    arr_dvn_usl := arr_usl_2019( mobil )
  else
    arr_dvn_usl := arr_usl_2018( mobil )
  Endif

  return arr_dvn_usl

// 10.03.26 скорректировать массивы по диспансеризации
Function ret_arrays_disp( dateSl )

  local blk

  Default dateSl To 0d20210101

  blk := { | d1, d2, d |
    Local i, arr := {}
    Default d To 1
    For i := d1 To d2 Step d
      AAdd( arr, i )
    Next
    Return arr
  }
  // 1- наименование меню
  // 2- шифр услуги
  // 3- этап (1, 2, 3, 4, 5)
  // 4- что-то связано с диагнозом
  // .
  // .
  // .
  // 10- V002 - Классификатор прифилей оказанной медицинской помощи
  // 11- V004 - Классификатор медицинских специальностей
  if dateSl >= 0d20260101
    dvn_arr_usl := arr_usl_2026()
  elseIf dateSl >= 0d20210101 .and. dateSl < 0d20260101
    dvn_arr_usl := arr_usl_2021( dateSl ) //, mobil, mdvozrast )
  Elseif ( dateSl >= 0d20190101 ) .and. ( dateSl < 0d20210101 )
    dvn_arr_usl := arr_usl_2019()
  else
    dvn_arr_usl := arr_usl_2018()
  Endif

  //
  dvn_arr_umolch := dvn_arr_umolch( dateSl )

  count_dvn_arr_usl := Len( dvn_arr_usl )
  count_dvn_arr_umolch := Len( dvn_arr_umolch )

  Return Nil

// 15.06.18 скорректировать возраст диспансеризации для ветеранов
Function ret_vozr_dvn_veteran( _dvozrast, _data )

  Local i, _arr_vozrast_DVN := ret_arr_vozrast_dvn( _data )

  If AScan( _arr_vozrast_DVN, _dvozrast ) == 0
    If _dvozrast < _arr_vozrast_DVN[ 1 ]
      _dvozrast := _arr_vozrast_DVN[ 1 ]
    Elseif _dvozrast > ATail( _arr_vozrast_DVN )
      _dvozrast := ATail( _arr_vozrast_DVN )
    Else
      For i := 2 To Len( _arr_vozrast_DVN )
        If Between( _dvozrast, _arr_vozrast_DVN[ i -1 ], _arr_vozrast_DVN[ i ] )
          If _dvozrast == _arr_vozrast_DVN[ i -1 ] + 1
            _dvozrast := _arr_vozrast_DVN[ i -1 ]
          Else
            _dvozrast := _arr_vozrast_DVN[ i ]
          Endif
          Exit
        Endif
      Next
    Endif
  Endif

  Return _dvozrast

// 15.06.19 вернуть массив возрастов дисп-ии для старого или нового Приказов МЗ РФ
Function ret_arr_vozrast_dvn( _data )

  Static sp := 0, arr := {}
  Local i, p := iif( _data < 0d20190501, 1, 2 )

  If p != sp
    arr := AClone( arr_vozrast_DVN() ) // по старому Приказу МЗ РФ
    If ( sp := p ) == 2 // по новому Приказу МЗ РФ
      ASize( arr, 7 ) // уберём хвост после 39 лет {21, 24, 27, 30, 33, 36, 39,
      ins_array( arr, 1, 18 ) // вставим в начало =18 лет
      For i := 40 To 99
        AAdd( arr, i ) // добавим в конец подряд с 40 по 99 лет
      Next
    Endif
  Endif

  Return arr

// 08.09.24
Function ret_ndisp( lkod_h, lkod_k, /*@*/new_etap, /*@*/msg)

  Local i, i1, i2, i3, i4, i5, is_disp, ar, fl := .t.

  is_disp_19 := !( mk_data < 0d20190501 )
  is_disp_21 := !( mk_data < 0d20210101 )
  is_disp_24 := !( mk_data < 0d20240901 )
  ret_arrays_disp( mk_data )
  msg := ' '
  new_etap := metap
  is_dostup_2_year := .f.
  If m1veteran == 1
    mdvozrast := ret_vozr_dvn_veteran( mdvozrast, mk_data )
  Endif
  If !( is_disp := AScan( ret_arr_vozrast_dvn( mk_data ), mdvozrast ) > 0 )
    If !is_disp_19 // по старому приказу МЗ РФ
      is_dostup_2_year := AScan( arr2m_vozrast_DVN(), mdvozrast ) > 0
      If !is_dostup_2_year .and. mpol == 'Ж'
        is_dostup_2_year := AScan( arr2g_vozrast_DVN(), mdvozrast ) > 0
      Endif
    Endif
  Endif
  If metap == 0
    If is_disp
      new_etap := 1
    Else
      new_etap := 3
    Endif
  Elseif metap == 3
    If is_disp
      new_etap := 1
    Else
      // остаётся = 3
    Endif
  Else
    If is_disp
      // остаётся = 1 или 2
    Elseif new_etap < 4
      new_etap := 3
    Endif
  Endif
  ar := ret_etap_dvn( lkod_h, lkod_k )
  If new_etap != 3
    If Empty( ar[ 1 ] ) // в этом году ещё ничего не делали
      // оставляем 1
    Else
      i1 := i2 := i3 := i4 := i5 := 0
      For i := 1 To Len( ar[ 1 ] )
        Do Case
        Case ar[ 1, i, 1 ] == 1 // дисп-ия 1 этап
          i1 := i
        Case ar[ 1, i, 1 ] == 2 // дисп-ия 2 этап
          i2 := i
        Case ar[ 1, i, 1 ] == 3 // профилактика
          i3 := i
          msg := date_8( ar[ 1, i, 2 ] ) + 'г. уже проведён профилактический медосмотр!'
        Case ar[ 1, i, 1 ] == 4 // дисп-ия 1 этап 1 раз в 2 года
          i4 := i
          msg := 'В ' + lstr( Year( mn_data ) ) + ' году уже проведена диспансеризации 1 раз в 2 года'
        Case ar[ 1, i, 1 ] == 5 // дисп-ия 2 этап 1 раз в 2 года
          i5 := i
          msg := 'В ' + lstr( Year( mn_data ) ) + ' году уже проведена диспансеризации 1 раз в 2 года'
        Endcase
      Next
      If eq_any( new_etap, 1, 2 ) .and. new_etap != metap
        If i1 == 0
          new_etap := 1 // делаем 1 этап
        Elseif i2 == 0
          new_etap := 2 // делаем 2 этап
        Endif
      Endif
      If i1 > 0 .and. i2 > 0
        msg := 'В ' + lstr( Year( mn_data ) ) + ' году уже проведены оба этапа диспансеризации!'
      Elseif i1 > 0 .and. !Empty( ar[ 1, i1, 2 ] ) .and. ar[ 1, i1, 2 ] > mn_data
        msg := 'Диспансеризация I этапа закончилась ' + date_8( ar[ 1, i1, 2 ] ) + 'г.!'
      Endif
      If eq_any( new_etap, 4, 5 ) .and. new_etap != metap
        If i4 == 0
          new_etap := 4 // делаем 1 этап
        Elseif i5 == 0
          new_etap := 5 // делаем 2 этап
        Endif
      Endif
      If i4 > 0 .and. i5 > 0
        msg := 'В ' + lstr( Year( mn_data ) ) + ' году уже проведены оба этапа диспансеризации (раз в 2 года)!'
      Elseif i4 > 0 .and. !Empty( ar[ 1, i4, 2 ] ) .and. ar[ 1, i4, 2 ] > mn_data
        msg := 'Диспансеризация I этапа (раз в 2 года) закончилась ' + date_8( ar[ 1, i4, 2 ] ) + 'г.!'
      Endif
    Endif
  Else // if new_etap == 3
    If Empty( ar[ 1 ] ) // в этом году ещё ничего не делали
      If Empty( ar[ 2 ] ) // посмотрим прошлый год
        // оставляем 3
      Elseif AScan( ar[ 2 ], {| x| x[ 1 ] == 3 } ) > 0 // профилактика была в прошлом году
        If is_dostup_2_year
          new_etap := 4 // сразу разрешаем дисп-ию 1 раз в 2 года, т.к. в прошлом
        Else
          msg := 'Профилактика проводится 1 раз в 2 года (' + date_8( ar[ 2, 1, 2 ] ) + 'г. уже проведена)'
        Endif
      Endif
    Else
      i1 := i2 := i3 := i4 := i5 := 0
      For i := 1 To Len( ar[ 1 ] )
        Do Case
        Case ar[ 1, i, 1 ] == 1 // дисп-ия 1 этап
          i1 := i
          msg := date_8( ar[ 1, i, 2 ] ) + 'г. уже проведена диспансеризация I этапа!'
        Case ar[ 1, i, 1 ] == 2 // дисп-ия 2 этап
          i2 := i
          msg := date_8( ar[ 1, i, 2 ] ) + 'г. уже проведена диспансеризация II этапа!'
        Case ar[ 1, i, 1 ] == 3 // профилактика
          i3 := i
          msg := date_8( ar[ 1, i, 2 ] ) + 'г. уже проведён профилактический медосмотр!'
        Case ar[ 1, i, 1 ] == 4 // дисп-ия 1 этап раз в 2 года
          i4 := i
        Case ar[ 1, i, 1 ] == 5 // дисп-ия 2 этап раз в 2 года
          i5 := i
        Endcase
      Next
      If i4 > 0
        If i5 > 0
          msg := 'В ' + lstr( Year( mn_data ) ) + ' году уже проведены оба этапа диспансеризации (раз в 2 года)!'
        Elseif !Empty( ar[ 1, i4, 2 ] ) .and. ar[ 1, i4, 2 ] > mn_data
          msg := 'Диспансеризация I этапа (раз в 2 года) закончилась ' + date_8( ar[ 1, i4, 2 ] ) + 'г.!'
        Else
          new_etap := 5 // делаем 2 этап
        Endif
      Endif
    Endif
  Endif
  If Empty( msg )
    metap := new_etap
    mndisp := inieditspr( A__MENUVERT, mm_ndisp_dvn(), metap )
  Else
    metap := 0
    mndisp := Space( 23 )
    func_error( 4, fam_i_o( mfio ) + ' ' + msg )
  Endif

  Return fl

// 15.06.19
Function ret_etap_dvn( lkod_h, lkod_k )

  Local ae := { {}, {} }, fl, i, d1 := Year( mn_data )

  r_use( dir_server() + 'human_', , 'HUMAN_' )
  r_use( dir_server() + 'human', dir_server() + 'humankk', 'HUMAN' )
  Set Relation To RecNo() into HUMAN_
  find ( Str( lkod_k, 7 ) )
  Do While human->kod_k == lkod_k .and. !Eof()
    fl := ( lkod_h != human->( RecNo() ) )
    If fl .and. human->schet > 0 .and. human_->oplata == 9
      fl := .f. // лист учёта снят по акту и выставлен повторно
    Endif
    If fl .and. Between( human->ishod, 201, 205 ) // ???
      i := human->ishod -200
      If Year( human->n_data ) == d1 // текущий год
        AAdd( ae[ 1 ], { i, human->k_data, human_->RSLT_NEW } )
        // elseif i >= 3 .and. mk_data < 0d20190501 .and. year(human->n_data) == d1-1 // профилактика прошлый год ???
        // aadd(ae[2], {i,human->k_data,human_->RSLT_NEW})
      Endif
    Endif
    Skip
  Enddo
  Close databases

  Return ae

// 08.08.13 вернуть тип массы в строке
Function ret_tip_mas( _WEIGHT, _HEIGHT, /*@*/ret)

  Static mm_tip_mas := { { 'Дефицит массы тела', 0, 18.4 }, ;
    { 'Нормальная масса тела', 18.5, 24.9 }, ;
    { 'Избыточная масса тела', 25.0, 29.9 }, ;
    { 'Ожирение I степени', 30.0, 34.9 }, ;
    { 'Ожирение II степени', 35.0, 39.9 }, ;
    { 'Ожирение III степени', 40.0, 9999 } }
  Local i, k, s := ''

  ret := 2
  If !emptyany( _WEIGHT, _HEIGHT )
    _HEIGHT /= 100  // рост из сантиметров в метры
    k := Round( _WEIGHT / _HEIGHT / _HEIGHT, 1 ) // индекс Кетле
    If ( i := AScan( mm_tip_mas, {| x| Between( k, x[ 2 ], x[ 3 ] ) } ) ) > 0
      ret := i
      s := mm_tip_mas[ i, 1 ]
    Endif
  Endif

  Return PadR( s, 21 )

// 06.05.15 вернуть 'правильный' профиль для диспансеризации/профилактики
Function ret_profil_dispans( lprofil, lprvs )

  If lprofil == 34 // если профиль по 'клинической лабораторной диагностике'
    If ret_old_prvs( lprvs ) == 2013 // и спец-ть 'Лабораторное дело'
      lprofil := 37 // сменим на профиль по 'лабораторному делу'
    Elseif ret_old_prvs( lprvs ) == 2011 // или 'Лабораторная диагностика'
      lprofil := 38 // сменим на профиль по 'лабораторной диагностике'
    Endif
  Endif

  Return lprofil

// 04.07.19 добавить шифр манипуляции в свой справочник MO_SU
Function append_shifr_mo_su( lshifr, fl_commit )

  Local lu_kod := 0, arr := {}

  Default fl_commit To .t.
  Select MOSU
  Set Order To 3 // по шифру ФФОМС
  find ( PadR( lshifr, 20 ) )
  Do While mosu->shifr1 == PadR( lshifr, 20 ) .and. !Eof()
    AAdd( arr, { iif( Left( mosu->shifr, 1 ) == '*', 1, 0 ), mosu->kod } )
    Skip
  Enddo
  If !Empty( arr )
    ASort( arr, , , {| x, y| x[ 1 ] < y[ 1 ] } ) // все старые стомат.услуги со звёздочкой в конец массива
    lu_kod := arr[ 1, 2 ]
  Else
    Select LUSLF
    find ( PadR( lshifr, 20 ) )
    Select MOSU
    Set Order To 1
    find ( Str( -1, 6 ) )
    If Found()
      g_rlock( forever )
    Else
      addrec( 6 )
    Endif
    lu_kod := mosu->kod := RecNo()
    mosu->name := luslf->name
    mosu->shifr1 := lshifr
    mosu->PROFIL := m1PROFIL
    If fl_commit
      Unlock
      Commit
    Endif
  Endif

  Return lu_kod

// 20.02.26
function dvn_700( dateSl )

  local arr

  if dateSl >= 0d20260101
    arr := {}
  else
    arr := { ; // какие услуги с ценой добавить к нулевым услугам
      { '2.3.5','2.90.3'  }, ; // приём терапевта дисп-ия 1 этап (1 раз в 3 года)
      { '2.3.6','2.90.4'  }, ; // приём терапевта дисп-ия 1 этап (1 раз в 2 года)
      { '2.3.3','2.90.2'  }, ; // посещение к фельдшеру
      { '3.4.9','3.4.709' }, ; // 'Измерение внутриглазного давления'
      { '4.12.174', '4.12.774' }, ; // 'Исследование крови на общий холестерин'
      { '4.12.169', '4.12.769' }, ; // 'Исследование уровня глюкозы в крови'
      { '4.8.4','4.8.704' }, ; // 'Исследование кала на скрытую кровь'
      { '4.14.66','4.14.766' }, ; // 'Кровь на простат-специфический антиген',
      { '4.1.12','4.1.712' }, ; // 'Осмотр акушеркой, взятие мазка (соскоба)'
      { '4.20.1','4.20.701' }, ; // 'Иссл-е взятого цитологического материала'
      { '7.57.3','7.57.703' }, ; // 'Маммография'
      { '7.61.3','7.61.703' }, ; // 'Флюорография лёгких'
      { '13.1.1','13.1.701' }, ; // 'Электрокардиография'
      { '3.1.5','3.1.705' }, ; // 'Измерение артериального давления'
      { '3.1.19','3.1.719' }, ; // 'Антропометрия'
      { '56.1.16','56.1.716' }, ; // 'Опрос (анкетирование)'
      { '56.1.18','56.1.718' }, ; // 'Определение относительного суммарного сердечно-сосудистого риска'
      { '56.1.19','56.1.719' }, ; // 'Определение абсолютного суммарного сердечно-сосудистого риска'
      { '56.1.21','56.1.721' };  // 'Индивидуальное профилактическое консультирование'
    }
  endif

  return arr

// 30.01.26
function dvn_85()
  
  return { ; // кол-во услуг, составляющих 85% - диспансеризация
    { 7, 6 }, { 8, 7 }, { 9, 8 }, { 10, 9 }, { 11, 9 }, { 12, 10 }, { 13, 11 }, { 14, 12 }, { 15, 13 }, { 16, 13 }, { 17, 14 };
  }

// 30.01.26
function prof_vn_85()
  
  return { ; // кол-во услуг, составляющих 85% - профилактика
    { 9, 8 }, { 10, 9 }, { 11, 10 }, { 12, 11 }, { 13, 11 }, { 14, 12 }, { 15, 13 }, { 16, 14 };
  }

  // 17.02.26
function mm_ndisp_dvn()
  
  return { ;
    { 'Диспансеризация I  этап', 1 }, ;
    { 'Диспансеризация II этап', 2 }, ;
    { 'Профилактический осмотр', 3 }, ;
    { 'Дисп.1этап(раз в 2года)', 4 }, ;
    { 'Дисп.2этап(раз в 2года)', 5 } }

// 23.02.26
function dvn_2_etap()
  
  return { ; // обязательное сочетание услуг второго этапа
            { { '2.84.1' }, { '8.23.706' }, 45, 90 }, ; // невролог
            { { '2.84.11' }, { '8.23.706' }, 45, 90 }, ; // терапевт
            { { '2.84.6' }, { '10.6.710', '10.4.701' }, 40, 75 };  // колопроктолог
          }
