// режимы настройки данных для диспансеризации взрослого населения до 2026 года
#include 'inkey.ch'
#include 'function.ch'
#include 'edit_spr.ch'
#include 'chip_mo.ch'

// 08.03.26
function arr_usl_2021( dateSl, mobil, mdvozrast )

  local arr_u2021, blk
  local age_etap_3 := { 19, 20, 22, 23, 25, 26, 28, 29, 31, 32, 34, 35, 37, 38 }

  default mobil to 0

  blk := { | d1, d2, d |
    Local i, arr := {}
    Default d To 1
    For i := d1 To d2 Step d
      AAdd( arr, i )
    Next
    Return arr
  }

  // 1- наименование меню
  // 2- шифр услуги
  // 3- этап (1, 2, 3, 4, 5)
  // 4- что-то связано с диагнозом
  // 5-
  // 6- возрост (мужчины)
  // 7- возрост (женщины)
  // 8- мужчины (0-нет, 1-да) - похоже вывод на экран 
  // 9- женщины (0-нет, 1-да) - похоже вывод на экран
  // 10- V002 - Классификатор профилей оказанной медицинской помощи
  // 11- V004 - Классификатор медицинских специальностей
    arr_u2021 := { ; // Услуги на экран для ввода
      { ;
        'Измерение внутриглазного давления', '3.4.9', 1, 0, 1, ;
        Eval( blk, 40, 99 ), ;
        Eval( blk, 40, 99 ), ;
        1, 1, 65, { 1112 };
      }, ;
      { ;
        'Исследование крови на общий холестерин', '4.12.174', { 1, 3 }, 0, 1, ;
        1, 1, 1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
      }, ;
      { ;
        'Исследование уровня глюкозы в крови', '4.12.169', { 1, 3 }, 0, 1, ;
        1, 1, 1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
      }, ;
      { ;
        'Исследование крови на гликированный гемо-ин', '4.12.775', 2, 0, 1, ;
        1, 1, 1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
      }, ;
          { ;
            'Клинический анализ крови (3 показателя)', '4.11.137', 1, 0, 1, ;
            Eval( blk, 40, 99 ), ;
            Eval( blk, 40, 99 ), ;
            1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
          }, ;
          { ;
            'Исследование кала на скрытую кровь', '4.8.4', 1, 0, 1, ;
            { 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75 }, ;
            { 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75 }, ;
            1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
          }, ;
          { ;
            'Кровь на простат-специфический антиген', '4.14.66', 1, 0, 1, ;
            { 45, 50, 55, 60, 64 }, ;
            0, ;
            1, 0, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
          }, ;
          { ;
            'Осмотр акушеркой или акушером-гинекологом', '2.3.1', { 1, 3 }, 0, 1, ; // женщины
            0, 1, 0, 1, { 3, 42, 136 }, { 2003, 2002, 1101 }, ;
            { { '2.3.1', 136 }, { '2.3.3', 3 }, { '2.3.3', 42 } }, 1, 1;
          }, ;
          { ;
            'Взятие мазка (соскоба) с пов-ти шейки матки', '4.1.12', 1, 0, 1, ; // женщины
            0, ;
            { 18, 21, 24, 27, 30, 33, 36, 39, 42, 45, 48, 51, 54, 57, 60, 63 }, ;
            1, 1, { 3, 42, 136 }, { 2003, 2002, 1101 };
          }, ;
          { ;
            'Иссл-е взятого цитологического материала', '4.20.1', 1, 0, 1, ; // если невозможна 4.1.12
            0, ;
            { 18, 21, 24, 27, 30, 33, 36, 39, 42, 45, 48, 51, 54, 57, 60, 63 }, ;     // то очистить
            1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };               // эту услугу
          }, ;
          { ;
            'Маммография обеих молочных желез', '7.57.3', 1, 0, 1, ; // женщины
            0, ;
            { 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74 }, ;
            0, 1, 78, { 1118, 1802, 2020 };
          }, ;
          { ;
            'Флюорография лёгких профилактическая', '7.61.3', { 1, 3 }, 0, 1, ;
            Eval( blk, 18, 99, 2 ), ;
            Eval( blk, 18, 99, 2 ), ;
            Eval( blk, 18, 99, 2 ), ;
            Eval( blk, 18, 99, 2 ), ;
            78, { 1118, 1802, 2020 };
          }, ;
          { ;
            'Электрокардиография (в покое)', '13.1.1', { 1, 3 }, 0, 1, ;
            Eval( blk, 35, 99 ), ;
            Eval( blk, 35, 99 ), ;
            Eval( blk, 35, 99 ), ;
            Eval( blk, 35, 99 ), ;
            111, { 110103, 110303, 110906, 111006, 111905, 112212, 112611, 113418, 113509, 180202, 2021 };
          }, ;
          { ;
            'Фиброэзофагогастродуоденоскопия', '10.3.13', 1, 0, 1, ;
            { 45 }, ;
            { 45 }, ;
            1, 1, 123, { 110104, 111007, 112221, 112609, 113419, 113511 };
          }, ;
          { ;
            'Фиброэзофагогастродуоденоскопия', '10.3.713', 2, 0, 1, ;
            1, 1, 1, 1, 123, { 110104, 111007, 112221, 112609, 113419, 113511 };
          }, ;
          { ;
            'Спирометрия', '16.1.717', 2, 0, 1, ;
            1, 1, 1, 1, 111, { 110103, 110303, 110906, 111006, 111905, 112212, 112611, 113418, 113509, 180202, 2021 };
          }, ;
          { ;
            'Дуплексное сканир-ие брахиоцефальных артерий', '8.23.706', 2, 0, 1, ;
            1, 1, 1, 1, 106, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 };
          }, ;
          { ;
            'Рентгенография органов грудной клетки', '7.2.702', 2, 0, 1, ;
            1, 1, 1, 1, 78, { 1118, 1802 };
          }, ;
          { ;
            'КТ органов грудной полости', '7.2.701', 2, 0, 1, ;
            1, 1, 1, 1, 78, { 1118, 1802 };
          }, ;
          { ;
            'Спиральная КТ легких', '7.2.703', 2, 0, 1, ;
            1, 1, 1, 1, 78, { 1118, 1802 };
          }, ;
          { ;
            'КТ органов грудной полости (с контрастир-ием)', '7.2.704', 2, 0, 1, ;
            1, 1, 1, 1, 78, { 1118, 1802 };
          }, ;
          { ;
            'Однофотонная эмиссионная КТ легких', '7.2.705', 2, 0, 1, ;
            1, 1, 1, 1, 78, { 1118, 1802 };
          }, ;
          { ;
            'Ректосигмоколоноскопия диагностическая', '10.6.710', 2, 0, 1, ;
            1, 1, 1, 1, 123, { 110104, 111007, 112221, 112609, 113419, 113511 };
          }, ;
          { ;
            'Ректороманоскопия', '10.4.701', 2, 0, 1, ;
            1, 1, 1, 1, 123, { 110104, 111007, 112221, 112609, 113419, 113511 };
          }, ;
          { ;
            'Углубленное профилактическое консультирование', '56.1.723', 2, 0, 1, ;
            1, 1, 1, 1, { 97, 57, 42 }, { 1122, 1110, 2002 };
          }, ;
          { ;
            'Приём врача невролога', '2.84.1', 2, 1, 0, ;
            1, 1, 1, 1, 53, { 1109 };
          }, ;
          { ;
            'Приём врача офтальмолога', '2.84.3', 2, 1, 0, ;
            1, 1, 1, 1, 65, { 1112 };
          }, ;
          { ;
            'Приём врача оториноларинголога', '2.84.8', 2, 1, 0, ;
            1, 1, 1, 1, 162, { 1111 };
          }, ;
          { ;
            'Приём врача уролога (хирурга)', '2.84.10', 2, 1, 0, ;
            1, 1, 1, 0, { 108, 112 }, { 112603, 1126 };
          }, ;
          { ;
            'Приём врача акушера-гинеколога', '2.84.5', 2, 1, 0, ;
            1, 1, 0, 1, 136, { 1101 };
          }, ;
          { ;
            'Приём врача колопроктолога (хирурга)', '2.84.6', 2, 1, 0, ;
            1, 1, 1, 1, { 30, 30, 112 }, { 112601, 113503, 1126 };
          }, ;
          { ;
            'Приём врача дерматовенеролог', '2.84.14', 2, 1, 0, ;
            1, 1, 1, 1, 16, { 1104 };
          }, ;
          { ;
            'Приём врача терапевта', { '2.3.7', '2.84.11', '2.3.2' }, { 1, 2, 3 }, 1, 0, ;
            1, 1, 1, 1, { 97, 57, 42 }, { 1122, 1110, 2002 }, ;
            { ;
              { '2.3.7', 57 }, ;
              { '2.3.7', 97 }, ;
              { '2.3.2', 57 }, ;
              { '2.3.2', 97 }, ;
              { '2.3.4', 42 }, ;
              { '2.84.11', 57 }, ;
              { '2.84.11', 97 } ;
            }, 1, 1;
          };
        }

  If ( ( dateSl >= 0d20240901 ) .and. ( i := ascan( { 25, 35, 45, 55, 65, 75, 85, 95 }, mdvozrast ) ) ) > 0
    hb_AIns( arr_u2021, 24, ;
      { ;
        'Исследование крови на Anti-HCV-total (гепатит C)', '4.15.546', { 1, 3 }, 0, 1, ;
        { 25, 35, 45, 55, 65, 75, 85, 95 }, ;
        { 25, 35, 45, 55, 65, 75, 85, 95 }, ;
        1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
      }, ;
      .t. ;
    )
  endif
  return arr_u2021

// 08.03.26
function arr_usl_2019( mobil )

  local arr_u2019, blk
  local age_etap_3 := { 19, 20, 22, 23, 25, 26, 28, 29, 31, 32, 34, 35, 37, 38 }

  default mobil to 0

  blk := { | d1, d2, d |
    Local i, arr := {}
    Default d To 1
    For i := d1 To d2 Step d
      AAdd( arr, i )
    Next
    Return arr
  }

  // 1- наименование меню
  // 2- шифр услуги
  // 3- этап (1, 2, 3, 4, 5)
  // 4- что-то связано с диагнозом
  // 5-
  // 6- возрост (мужчины)
  // 7- возрост (женщины)
  // 8- мужчины (0-нет, 1-да) - похоже вывод на экран 
  // 9- женщины (0-нет, 1-да) - похоже вывод на экран
  // 10- V002 - Классификатор профилей оказанной медицинской помощи
  // 11- V004 - Классификатор медицинских специальностей
  arr_u2019 := { ; // Услуги на экран для ввода
          { ;
            'Измерение внутриглазного давления', '3.4.9', 1, 0, 1, ;
            Eval( blk, 40, 99 ), ;
            Eval( blk, 40, 99 ), ;
            1, 1, 65, { 1112 };
          }, ;
          { ;
            'Исследование крови на общий холестерин', '4.12.174', { 1, 3 }, 0, 1, ;
            1, 1, 1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
          }, ;
          { ;
            'Исследование уровня глюкозы в крови', '4.12.169', { 1, 3 }, 0, 1, ;
            1, 1, 1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
          }, ;
          { ;
            'Клинический анализ крови (3 показателя)', '4.11.137', 1, 0, 1, ;
            Eval( blk, 40, 99 ), ;
            Eval( blk, 40, 99 ), ;
            1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
          }, ;
          { ;
            'Исследование кала на скрытую кровь', '4.8.4', 1, 0, 1, ;
            { 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75 }, ;
            { 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75 }, ;
            1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
          }, ;
          { ;
            'Кровь на простат-специфический антиген', '4.14.66', 1, 0, 1, ;
            { 45, 50, 55, 60, 64 }, ;
            0, ;
            1, 0, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
          }, ;
          { ;
            'Осмотр акушеркой или акушером-гинекологом', '2.3.1', { 1, 3 }, 0, 1, ; // женщины
            0, 1, 0, 1, { 3, 42, 136 }, { 2003, 2002, 1101 }, ;
            { { '2.3.1', 136 }, { '2.3.3', 3 }, { '2.3.3', 42 } }, 1, 1;
          }, ;
          { ;
            'Взятие мазка (соскоба) с пов-ти шейки матки', '4.1.12', 1, 0, 1, ; // женщины
            0, ;
            { 18, 21, 24, 27, 30, 33, 36, 39, 42, 45, 48, 51, 54, 57, 60, 63 }, ;
            1, 1, { 3, 42, 136 }, { 2003, 2002, 1101 };
          }, ;
          { ;
            'Иссл-е взятого цитологического материала', '4.20.1', 1, 0, 1, ; // если невозможна 4.1.12
            0, ;
            { 18, 21, 24, 27, 30, 33, 36, 39, 42, 45, 48, 51, 54, 57, 60, 63 }, ;     // то очистить
            1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };               // эту услугу
          }, ;
          { ;
            'Маммография обеих молочных желез', '7.57.3', 1, 0, 1, ; // женщины
            0, ;
            { 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74 }, ;
            0, 1, 78, { 1118, 1802, 2020 };
          }, ;
          { ;
            'Флюорография лёгких профилактическая', '7.61.3', { 1, 3 }, 0, 1, ;
            Eval( blk, 18, 99, 2 ), ;
            Eval( blk, 18, 99, 2 ), ;
            Eval( blk, 18, 99, 2 ), ;
            Eval( blk, 18, 99, 2 ), ;
            78, { 1118, 1802, 2020 };
          }, ;
          { ;
            'Электрокардиография (в покое)', '13.1.1', { 1, 3 }, 0, 1, ;
            Eval( blk, 35, 99 ), ;
            Eval( blk, 35, 99 ), ;
            Eval( blk, 35, 99 ), ;
            Eval( blk, 35, 99 ), ;
            111, { 110103, 110303, 110906, 111006, 111905, 112212, 112611, 113418, 113509, 180202, 2021 };
          }, ;
          { ;
            'Фиброэзофагогастродуоденоскопия', '10.3.13', 1, 0, 1, ;
            { 45 }, ;
            { 45 }, ;
            1, 1, 123, { 110104, 111007, 112221, 112609, 113419, 113511 };
          }, ;
          { ;
            'Фиброэзофагогастродуоденоскопия', '10.3.713', 2, 0, 1, ;
            1, 1, 1, 1, 123, { 110104, 111007, 112221, 112609, 113419, 113511 };
          }, ;
          { ;
            'Спирометрия', '16.1.717', 2, 0, 1, ;
            1, 1, 1, 1, 111, { 110103, 110303, 110906, 111006, 111905, 112212, 112611, 113418, 113509, 180202, 2021 };
          }, ;
          { ;
            'Дуплексное сканир-ие брахиоцефальных артерий', '8.23.706', 2, 0, 1, ;
            1, 1, 1, 1, 106, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 };
          }, ;
          { ;
            'Рентгенография органов грудной клетки', '7.2.702', 2, 0, 1, ;
            1, 1, 1, 1, 78, { 1118, 1802 };
          }, ;
          { ;
            'КТ органов грудной полости', '7.2.701', 2, 0, 1, ;
            1, 1, 1, 1, 78, { 1118, 1802 };
          }, ;
          { ;
            'Спиральная КТ легких', '7.2.703', 2, 0, 1, ;
            1, 1, 1, 1, 78, { 1118, 1802 };
          }, ;
          { ;
            'КТ органов грудной полости (с контрастир-ием)', '7.2.704', 2, 0, 1, ;
            1, 1, 1, 1, 78, { 1118, 1802 };
          }, ;
          { ;
            'Однофотонная эмиссионная КТ легких', '7.2.705', 2, 0, 1, ;
            1, 1, 1, 1, 78, { 1118, 1802 };
          }, ;
          { ;
            'Ректосигмоколоноскопия диагностическая', '10.6.710', 2, 0, 1, ;
            1, 1, 1, 1, 123, { 110104, 111007, 112221, 112609, 113419, 113511 };
          }, ;
          { ;
            'Ректороманоскопия', '10.4.701', 2, 0, 1, ;
            1, 1, 1, 1, 123, { 110104, 111007, 112221, 112609, 113419, 113511 };
          }, ;
          { ;
            'Углубленное профилактическое консультирование', '56.1.723', 2, 0, 1, ;
            1, 1, 1, 1, { 97, 57, 42 }, { 1122, 1110, 2002 };
          }, ;
          { ;
            'Приём врача невролога', '2.84.1', 2, 1, 0, ;
            1, 1, 1, 1, 53, { 1109 };
          }, ;
          { ;
            'Приём врача офтальмолога', '2.84.3', 2, 1, 0, ;
            1, 1, 1, 1, 65, { 1112 };
          }, ;
          { ;
            'Приём врача оториноларинголога', '2.84.8', 2, 1, 0, ;
            1, 1, 1, 1, 162, { 1111 };
          }, ;
          { ;
            'Приём врача уролога (хирурга)', '2.84.10', 2, 1, 0, ;
            1, 1, 1, 0, { 108, 112 }, { 112603, 1126 };
          }, ;
          { ;
            'Приём врача акушера-гинеколога', '2.84.5', 2, 1, 0, ;
            1, 1, 0, 1, 136, { 1101 };
          }, ;
          { ;
            'Приём врача колопроктолога (хирурга)', '2.84.6', 2, 1, 0, ;
            1, 1, 1, 1, { 30, 30, 112 }, { 112601, 113503, 1126 };
          }, ;
          { ;
            'Приём врача терапевта', { '2.3.7', '2.84.11', '2.3.2' }, { 1, 2, 3 }, 1, 0, ;
            1, 1, 1, 1, { 97, 57, 42 }, { 1122, 1110, 2002 }, ;
            { ;
              { '2.3.7', 57 }, ;
              { '2.3.7', 97 }, ;
              { '2.3.2', 57 }, ;
              { '2.3.2', 97 }, ;
              { '2.3.4', 42 }, ;
              { '2.84.11', 57 }, ;
              { '2.84.11', 97 } ;
            }, 1, 1;
          };
        }

  return arr_u2019

// 08.03.26
function arr_usl_2018( mobil )

  local arr_u2018, blk
  local age_etap_3 := { 19, 20, 22, 23, 25, 26, 28, 29, 31, 32, 34, 35, 37, 38 }

  default mobil to 0

  blk := { | d1, d2, d |
    Local i, arr := {}
    Default d To 1
    For i := d1 To d2 Step d
      AAdd( arr, i )
    Next
    Return arr
  }

  // 1- наименование меню
  // 2- шифр услуги
  // 3- этап (1, 2, 3, 4, 5)
  // 4- что-то связано с диагнозом
  // 5-
  // 6- возрост (мужчины)
  // 7- возрост (женщины)
  // 8- мужчины (0-нет, 1-да) - похоже вывод на экран 
  // 9- женщины (0-нет, 1-да) - похоже вывод на экран
  // 10- V002 - Классификатор профилей оказанной медицинской помощи
  // 11- V004 - Классификатор медицинских специальностей
  arr_u2018 := { ; // Услуги на экран для ввода
      { ;
        'Измерение внутриглазного давления', '3.4.9', 1, 0, 1, ;
        { 60, 63, 66, 69, 72, 75, 78, 81, 84, 87, 90, 93, 96, 99 }, ;
        { 60, 63, 66, 69, 72, 75, 78, 81, 84, 87, 90, 93, 96, 99 }, ;
        1, 1, 65, { 1112 };
      }, ;
      { ;
        'Исследование крови на общий холестерин', '4.12.174', { 1, 3 }, 0, 1, ;
        { 21, 24, 27, 30, 33, 36, 39, 42, 45, 48, 51, 54, 57, 60, 63, 66, 69, 72, 75, 78, 81, 84 }, ;
        { 21, 24, 27, 30, 33, 36, 39, 42, 45, 48, 51, 54, 57, 60, 63, 66, 69, 72, 75, 78, 81, 84 }, ;
        1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
      }, ;
      { ;
        'Исследование уровня глюкозы в крови', '4.12.169', { 1, 3 }, 0, 1, ;
        1, 1, 1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
      }, ;
      { ;
        'Клинический анализ крови (3 показателя)', '4.11.137', 3, 0, 1, 0, 0, ;
        1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
      }, ;
      { ;
        'Исследование кала на скрытую кровь', '4.8.4', { 1, 3, 4 }, 0, 1, ;
        { 51, 57, 63, 69 }, ;
        { 51, 57, 63, 69 }, ;
        { 46, 98 }, { 46, 98 }, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 },, arr2m_vozrast_DVN(), arr2m_vozrast_DVN();
      }, ;
      { ;
        'Кровь на простат-специфический антиген', '4.14.66', 1, 0, 1, ;
        { 45, 51 }, ;
        0, ;
        1, 0, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
      }, ;
      { ;
        'Осмотр акушеркой, взятие мазка (соскоба)', '4.1.12', 1, 0, 1, ; // женщины
        0, ;
        { 30, 33, 36, 39, 42, 45, 48, 51, 54, 57, 60 }, ;
        1, 1, { 3, 42, 136 }, { 2003, 2002, 1101 };
      }, ;
      { ;
        'Иссл-е взятого цитологического материала', '4.20.1', 1, 0, 1, ; // если невозможна
        0, ;                                                        // 4.1.12,
        { 30, 33, 36, 39, 42, 45, 48, 51, 54, 57, 60 }, ;     // то очистить
        1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };               // эту услугу
      }, ;
      { ;
        'Маммография обеих молочных желез', '7.57.3', { 1, 3, 4 }, 0, 1, ; // женщины
        0, ;
        { 39, 42, 45, 48, 54, 60, 66 }, ;
        0, { 40, 74 }, 78, { 1118, 1802, 2020 },, 0, arr2g_vozrast_DVN() ;
      }, ;
      { ;
        'Флюорография лёгких', '7.61.3', { 1, 3 }, 0, 1, ;
        1, 1, 1, 1, 78, { 1118, 1802, 2020 };
      }, ;
      { ;
        'Электрокардиография (в покое)', '13.1.1', 1, 0, 1, ;
        { 36, 39, 42, 45, 48, 51, 54, 57, 60, 63, 66, 69, 72, 75, 78, 81, 84, 87, 90, 93, 96, 99 }, ; // для мужчин обязательно с 36 лет
        { 45, 48, 51, 54, 57, 60, 63, 66, 69, 72, 75, 78, 81, 84, 87, 90, 93, 96, 99 }, ; // для женщин обязательно с 45 лет
        1, 1, 111, { 110103, 110303, 110906, 111006, 111905, 112212, 112611, 113418, 113509, 180202, 2021 };
      }, ;
      { ;
        'Спирометрия', '16.1.717', 2, 0, 1, ;
        1, 1, 1, 1, 111, { 110103, 110303, 110906, 111006, 111905, 112212, 112611, 113418, 113509, 180202, 2021 };
      }, ;
      { ;
        'Дуплексное сканир-ие брахиоцефальных артерий', '8.23.706', 2, 0, 1, ;
        1, 1, 1, 1, 106, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 };
      }, ;
      { ;
        'Ректосигмоколоноскопия диагностическая', '10.6.710', { 2, 5 }, 0, 1, ;
        1, 1, 1, 1, 123, { 110104, 111007, 112221, 112609, 113419, 113511 },, arr2m_vozrast_DVN(), arr2m_vozrast_DVN() ;
      }, ;
      { ;
        'Углубленное профилактическое консультирование', '56.1.723', 2, 0, 1, ;
        1, 1, 1, 1, { 97, 57, 42 }, { 1122, 1110, 2002 };
      }, ;
      { ;
        'Приём врача невролога', '2.84.1', 2, 1, 0, ;
        1, 1, 1, 1, 53, { 1109 };
      }, ;
      { ;
        'Приём врача офтальмолога', '2.84.3', 2, 1, 0, ;
        1, 1, 1, 1, 65, { 1112 };
      }, ;
      { ;
        'Приём врача оториноларинголога', '2.84.8', 2, 1, 0, ;
        1, 1, 1, 1, 162, { 1111 };
      }, ;
      { ;
        'Приём врача уролога (хирурга)', '2.84.10', 2, 1, 0, ;
        1, 1, 1, 0, { 108, 112 }, { 112603, 1126 };
      }, ;
      { ;
        'Приём врача акушера-гинеколога', '2.84.5', { 2, 5 }, 1, 0, ;
        1, 1, 0, 1, 136, { 1101 },, 0, arr2g_vozrast_DVN() ;
      }, ;
      { ;
        'Приём врача колопроктолога (хирурга)', '2.84.6', { 2, 5 }, 1, 0, ;
        1, 1, 1, 1, { 30, 30, 112 }, { 112601, 113503, 1126 },, arr2m_vozrast_DVN(), arr2m_vozrast_DVN();
      }, ;
      { ;
        'Приём врача терапевта', { '2.3.5', '2.84.11', '2.3.2', '2.3.6', '2.84.11' }, { 1, 2, 3, 4, 5 }, 1, 0, ;
        1, 1, 1, 1, { 97, 57, 42 }, { 1122, 1110, 2002 }, ;
        { ;
          { '2.3.2', 57 }, ;
          { '2.3.2', 97 }, ;
          { '2.3.3', 42 }, ;
          { '2.3.5', 57 }, ;
          { '2.3.5', 97 }, ;
          { '2.3.6', 57 }, ;
          { '2.3.6', 97 }, ;
          { '2.84.11', 57 }, ;
          { '2.84.11', 97 } ;
        }, 1, 1;
      } ;
    }
  return arr_u2018
