// 27.02.21 вернуть массив Классификатор ведомственной принадлежности медицинской организации F007.xml
function getF007()
  // F007.xml - Классификатор ведомственной принадлежности медицинской организации
  //  1 - VEDNAME(C)  2 - IDVED(N)  3 - DATEBEG(D)  4 - DATEEND(D)
  static _arr := {}

  if len(_arr) == 0
    aadd(_arr, {'Муниципального образования', 1, stod('20110101'), stod('')})
    aadd(_arr, {'Субъекта Российской Федерации', 2, stod('20110101'), stod('')})
    aadd(_arr, {'Минздравсоцразвития России', 3, stod('20110101'), stod('')})
    aadd(_arr, {'Минобрнауки России', 4, stod('20110101'), stod('')})
    aadd(_arr, {'Минобороны России', 5, stod('20110101'), stod('')})
    aadd(_arr, {'МВД России', 6, stod('20110101'), stod('')})
    aadd(_arr, {'Минюста России ГУИН', 7, stod('20110101'), stod('')})
    aadd(_arr, {'ФСБ России', 8, stod('20110101'), stod('')})
    aadd(_arr, {'РАМН', 9, stod('20110101'), stod('')})
    aadd(_arr, {'ФМБА России', 10, stod('20110101'), stod('')})
    aadd(_arr, {'Прочих федеральных министерств и ведомств', 11, stod('20110101'), stod('')})
    aadd(_arr, {'НУЗ ОАО "РЖД"', 12, stod('20110101'), stod('')})
    aadd(_arr, {'Автономные МО', 13, stod('20110101'), stod('')})
    aadd(_arr, {'Общественных, религиозных организаций', 14, stod('20110101'), stod('')})
    aadd(_arr, {'Иные', 15, stod('20110101'), stod('')})
  endif

  return _arr