* 04.03.21 вернуть Классификатор типов документов, удостоверяющих личность F011.xml
function getF011()
  // F011.xml - Классификатор типов документов, удостоверяющих личность
  //  1 - DocName(C)  2 - IDDoc(N)  3 - DATEBEG(D)  4 - DATEEND(D)  5 - DocSer(C)  6 - DocNum(C)
  static _arr := {}
  local dbName := '_mo_f011'

  if len(_arr) == 0
    dbUseArea( .t.,, exe_dir + dbName, dbName, .f., .f. )
    (dbName)->(dbGoTop())
    do while !(dbName)->(EOF())
      if empty((dbName)->DATEEND)
        aadd(_arr, { alltrim((dbName)->DOCNAME), (dbName)->IDDOC, (dbName)->DATEBEG, (dbName)->DATEEND, (dbName)->DOCSER, (dbName)->DOCNUM })
      endif
      (dbName)->(dbSkip())
    enddo
    (dbName)->(dbCloseArea())
  endif

  // if len(_arr) == 0
  //   aadd(_arr, {"Паспорт гражданина СССР",1,stod("20110101"),stod(""),"R-ББ","999999"})
  //   aadd(_arr, {"Загранпаспорт гражданина СССР",2,stod("20110101"),stod(""),"S","00000009"})
  //   aadd(_arr, {"Свидетельство о рождении, выданное в Российской Федерации",3,stod("20110101"),stod(""),"R-ББ","999999"})
  //   aadd(_arr, {"Удостоверение личности офицера",4,stod("20110101"),stod(""),"ББ","9999999"})
  //   aadd(_arr, {"Справка об освобождении из места лишения свободы",5,stod("20110101"),stod(""),"S","00000009"})
  //   aadd(_arr, {"Паспорт Минморфлота",6,stod("20110101"),stod(""),"ББ","999999"})
  //   aadd(_arr, {"Военный билет",7,stod("20110101"),stod(""),"ББ","9999990"})
  //   aadd(_arr, {"Дипломатический паспорт гражданина Российской Федерации",8,stod("20110101"),stod(""),"99","9999999"})
  //   aadd(_arr, {"Паспорт иностранного гражданина",9,stod("20110101"),stod(""),"S","0000000009"})
  //   aadd(_arr, {"Свидетельство о регистрации ходатайства о признании иммигранта беженцем на территории Российской Федерации",10,stod("20110101"),stod(""),"S","00000009"})
  //   aadd(_arr, {"Вид на жительство",11,stod("20110101"),stod(""),"S1","00000009"})
  //   aadd(_arr, {"Удостоверение беженца в Российской Федерации",12,stod("20110101"),stod(""),"S","00000009"})
  //   aadd(_arr, {"Временное удостоверение личности гражданина Российской Федерации",13,stod("20110101"),stod(""),"S","00000009"})
  //   aadd(_arr, {"Паспорт гражданина Российской Федерации",14,stod("20110101"),stod(""),"99 99","9999990"})
  //   aadd(_arr, {"Заграничный паспорт гражданина Российской Федерации",15,stod("20110101"),stod(""),"99","9999999"})
  //   aadd(_arr, {"Паспорт моряка",16,stod("20110101"),stod(""),"ББ","9999990"})
  //   aadd(_arr, {"Военный билет офицера запаса",17,stod("20110101"),stod(""),"ББ","999999"})
  //   aadd(_arr, {"Иные документы",18,stod("20110101"),stod(""),"S1","0000000009"})
  //   aadd(_arr, {"Документ иностранного гражданина",21,stod("20130704"),stod(""),"S1","000000000009"})
  //   aadd(_arr, {"Документ лица без гражданства",22,stod("20130704"),stod(""),"S1","000000000009"})
  //   aadd(_arr, {"Разрешение на временное проживание",23,stod("20130704"),stod(""),"S1","000000000009"})
  //   aadd(_arr, {"Свидетельство о рождении, выданное не в Российской Федерации",24,stod("20130704"),stod(""),"S1","000000000009"})
  // endif

  return _arr