
* 17.02.21 вернуть массив справочнику ТФОМС F015.xml
function getF015()
  // F015.xml - Классификатор федеральных округов
  //  1 - OKRNAME(C)  2 - KOD_OK(N)  3 - DATEBEG(D)  4 - DATEEND(D)
  local dbName := "f015"
  local _f015 := {}

  aadd(_f015, {"Центральный федеральный округ",1,stod("20110101"),stod("")})
  aadd(_f015, {"Южный федеральный округ",2,stod("20110101"),stod("")})
  aadd(_f015, {"Северо-Западный федеральный округ",3,stod("20110101"),stod("")})
  aadd(_f015, {"Дальневосточный федеральный округ",4,stod("20110101"),stod("")})
  aadd(_f015, {"Сибирский федеральный округ",5,stod("20110101"),stod("")})
  aadd(_f015, {"Уральский федеральный округ",6,stod("20110101"),stod("")})
  aadd(_f015, {"Приволжский федеральный округ",7,stod("20110101"),stod("")})
  aadd(_f015, {"Северо-Кавказский федеральный округ",8,stod("20110101"),stod("")})
  aadd(_f015, {"-",0,stod("20110101"),stod("")})

  return _f015

