
// 17.02.21 вернуть массив справочнику ТФОМС F015.xml
function getF015()
  // F015.xml - Классификатор федеральных округов
  //  1 - OKRNAME(C)  2 - KOD_OK(N)  3 - DATEBEG(D)  4 - DATEEND(D)
  local dbName := "f015"
  static _arr := {}

  if len(_arr) == 0
    aadd(_arr, {"Центральный федеральный округ",1,stod("20110101"),stod("")})
    aadd(_arr, {"Южный федеральный округ",2,stod("20110101"),stod("")})
    aadd(_arr, {"Северо-Западный федеральный округ",3,stod("20110101"),stod("")})
    aadd(_arr, {"Дальневосточный федеральный округ",4,stod("20110101"),stod("")})
    aadd(_arr, {"Сибирский федеральный округ",5,stod("20110101"),stod("")})
    aadd(_arr, {"Уральский федеральный округ",6,stod("20110101"),stod("")})
    aadd(_arr, {"Приволжский федеральный округ",7,stod("20110101"),stod("")})
    aadd(_arr, {"Северо-Кавказский федеральный округ",8,stod("20110101"),stod("")})
    aadd(_arr, {"-",0,stod("20110101"),stod("")})
  endif

  return _arr