#include 'function.ch'
#include 'chip_mo.ch'


***** 14.06.21
Function create_mo_add()
  local sbase := 'mo_add'

  if !hb_FileExists(dir_server+sbase+sdbf)
    adbf := {;
     { 'MCOD',      'C',   6, 0 }, ; // 
     { 'CODEM',     'C',   6, 0 }, ; // 
     { 'NAMEF',     'C', 250, 0 }, ; // 
     { 'NAMES',     'C',  80, 0 }, ; //
     { 'ADRES',     'C', 250, 0 }, ; // 
     { 'DEND',      'D',   8, 0 } ; // 
    }
    reconstruct(dir_server + sbase, adbf, "index_base('mo_add')", , .t.)
    fill_mo_add(sbase)

  endif
  return nil

***** 14.06.21
Function fill_mo_add(sbase)
  local aa := { ;
    {'080044','999919','БУ р.Калмыкия "Республиканский детский мед.центр им.Манджиевой Валентины Джамаловны"','БУ р.Калмыкия "Республиканский детский мед.центр им.Манджиевой Валентины Джамало"','',,0d20251231}, ;
    {'080007','999928','БУ РК "Приютенская РБ" республики Калмыкия','БУ РК "Приютенская РБ" республики Калмыкия','',0d20251231}, ;
    {'080030','999918','Бюджетное учреждение Республики Калмыкия "Перинатальный центр им.О.А.Шунгаевой"','Бюджетное учреждение Республики Калмыкия "Перинатальный центр им. О.А. Шунгаевой"','',0d20251231}, ;
    {'772275','999998','ГБУЗ "Городская поликлиника "107 ДЗМ"','ГБУЗ Городская поликлиника "107 ДЗМ"','','',0d20251231}, ;
    {'580046','999922','ГБУЗ "Пензенская РБ"','ГБУЗ "Пензенская РБ"','',0d20251231}, ;
    {'300034','999997','ГБУЗ АО "Капустиноярская участковая больница"','ГБУЗ АО "Капустиноярская участковая больница"','',0d20251231}, ;
    {'300049','999927','ГБУЗ АО "ЧЕРНОЯРСКАЯ РБ"','ГБУЗ АО "ЧЕРНОЯРСКАЯ РБ"','',0d20251231}, ;
    {'300026','999996','ГБУЗ АО Ахтубинская РБ.','ГБУЗ АО Ахтубинская ЦРБ','',0d20251231}, ;
    {'300033','999917','ГБУЗ Астраханской области "Ахтубинская районная больница"','ГБУЗ Астраханской области "Ахтубинская районная больница"','',0d20251231}, ;
    {'772286','999921','ГБУЗ города Москвы "Городская клиническая больница № 52 департамента здравоохранения города Москвы"','ГБУЗ города Москвы "Городская клиническая больница № 52 департамента здравоохран"','',0d20251231}, ;
    {'481601','999924','ГУЗ "Липецкая РБ"','ГУЗ "Липецкая РБ"','','1','',0d20251231}, ;
    {'640251','999913','ГУЗ СГП N 14','ГУЗ СГП N 14','',0d20251231}, ;
    {'640961','999915','ГУЗ СГП N 16','ГУЗ СГП N 16','',0d20251231}, ;
    {'640431','999912','ГУЗ СГП N 17','ГУЗ СГП N 17','',0d20251231}, ;
    {'640261','999911','ГУЗ СГП N 19','ГУЗ СГП N 19','',0d20251231}, ;
    {'640680','999914','ГУЗ СО "КРАСНОКУТСКАЯ РБ"','ГУЗ СО "КРАСНОКУТСКАЯ РБ"','',0d20251231}, ;
    {'640040','999916','ГУЗ СО госпиталь для ветеранов','ГУЗ СО госпиталь для ветеранов','',0d20251231}, ;
    {'050081','999995','Дагестан ГБУ РД "Кизлярская центральная районная больница"','Дагестан ГБУ РД "Кизлярская центральная районная больница"','368870, Республика Дагестан, Кизляр, ул.Радищева, 7',0d20251231}, ;
    {'750046','999992','Забайкальский край ГУЗ Борзинская ЦРБ','Забайкальский край ГУЗ "Борзинская ЦРБ"','674600, Забайкальский край, г.Борзя, ул.Ленина, 10',0d20251231}, ;
    {'080005','999994','Калмыкия БУ РК "Малодербетовская районная больница"','Калмыкия БУ РК "Малодербетовская районная больница"','359420, Республика калмыкия,Малодербентовский район, С.Малые Дербентф, ул. Больничная д.1',0d20251231}, ;
    {'430173','999920','КОГБУЗ "Малмыжская ЦРБ"','КОГБУЗ "Малмыжская ЦРБ"','',0d20251231}, ;
    {'610155','999926','МБУЗ "ЦРБ" Морозовского района Ростовской области','МБУЗ "ЦРБ" Морозовского района Ростовской области','',0d20251231}, ;
    {'610159','999925','МБУЗ "ЦРБ" Обливского района Ростовской области','МБУЗ "ЦРБ" Обливского района Ростовской области','',0d20251231}, ;
    {'610176','999929','МБУЗ "ЦРБ" Цимлянского района Ростовской области','МБУЗ "ЦРБ" Цимлянского района Ростовской области','',0d20251231}, ;
    {'300050','999910','МО ГБУЗ АО "ГБ ЗАТО ЗНАМЕНСК"','МО ГБУЗ АО "ГБ ЗАТО ЗНАМЕНСК"','',0d20251231}, ;
    {'640471','999993','Саратовская область ГУЗ СО "Городская поликлиника #1 Балаково"','Саратовская область ГУЗ СО "Городская поликлиника N1 Балаково"','413841, Саратовская область, г.Балаково, ул.Комарова,126',0d20251231}, ;
    {'780153','999923','СПБ ГБУЗ "Детский городской многопрофильный клинический специализированный центр высоких медицинских технологий"','СПБ ГБУЗ "Детский городской многопрофильный клинический специализированный центр"','',0d20251231}, ;
    {'260061','999991','Ставропольский край ГБУЗ СК "Городская больница" г.Невинномысск','Ставропольский край ГБУЗ СК "Городская больница" г. Невинномысск','357108, Ставропольский край, г.Невинномысск, улица Павлова, 5, оф.0',0d20251231}, ;
    {'150112','999930','ГБУЗ "Моздокская ЦРБ"','ГБУЗ "Моздокская ЦРБ"','',0d20251231} ;
  }

  if G_Use(dir_server + sbase, dir_server + sbase, sbase, , .t.,)
    for i := 1 to len(aa)
      (sbase)->(dbappend())
      (sbase)->MCOD := aa[i,1]
      (sbase)->CODEM := aa[i,2]
      (sbase)->NAMEF := aa[i,3]
      (sbase)->NAMES := aa[i,4]
      (sbase)->ADRES := aa[i,5]
      // (sbase)->DEND := aa[i,6]
    next
    (sbase)->(dbCloseArea())
  endif

  return nil

****** 13.06.2021  вернуть массив _mo_dbb.dbb
function getMo_mo(nfile)
  local i, arr, arr1
  local ret_arr := {}

  arr1 := rest_arr(nfile)
  for i := 1 to len(arr1)
    arr := array(_MO_LEN_ARR)
    if !(valtype(arr1[i]) == 'A') .or. len(arr1[i]) < 12
      func_error(4,'Разрушен файл '+upper(nfile))
      loop
    endif
    arr[_MO_KOD_FFOMS]  := crypt(arr1[i,1],gpasskod)
    arr[_MO_KOD_TFOMS]  := crypt(arr1[i,2],gpasskod)
    arr[_MO_FULL_NAME]  := crypt(arr1[i,3],gpasskod)
    arr[_MO_SHORT_NAME] := crypt(arr1[i,4],gpasskod)
    arr[_MO_ADRES]      := crypt(arr1[i,5],gpasskod)
    arr[_MO_PROD]       := crypt(arr1[i,9],gpasskod)
    arr[_MO_DEND]       := ctod(crypt(arr1[i,10],gpasskod))
    arr[_MO_STANDART]   := arr1[i,11]
    arr[_MO_UROVEN]     := arr1[i,12]
    arr[_MO_IS_MAIN]    := (arr1[i,6]=='1')
    arr[_MO_IS_UCH]     := (arr1[i,7]=='1')
    arr[_MO_IS_SMP]     := (arr1[i,8]=='1')
    if valtype(arr[_MO_UROVEN]) != 'A'
      arr[_MO_UROVEN] := {}
    endif
    aadd(ret_arr, aclone(arr))
  next

  return ret_arr

* 13.06.21 вернуть массив _mo_dbb.dbf
function getMo_mo_New(dbName, reload)
  // reload - флаг указывающий на перезагрузку справочника, .T. - перезагрузить, .F. - нет
  
  // _mo_mo.dbf - справочник медучреждений
  //  1 - MCOD(C)  2 - CODEM(C)  3 - NAMEF(C)  4 - NAMES(C) 5 - ADRES(C) 6 - MAIN(C)
  //  7 - PFA(C) 8 - PFS(C) 9 - PROD(C) 10 - DOLG(C) 
  //  11 - DEND(D)  12 - STANDART(C)  13 - UROVEN(C)
  static _arr := {}
  // local dbName := '_mo_mo'
  local standart, uroven
  local row, tmp
  local sbase := 'mo_add'
  
  DEFAULT reload TO .f.
  
  if reload
    // очистим массив для новой загрузки справочника
    _arr := {}
  endif
  
  if len(_arr) == 0
    dbUseArea( .t.,, dir_exe + dbName, dbName, .f., .f. )
    // dbUseArea( .t., , dbName, dbName, .f., .f. )
    (dbName)->(dbGoTop())
    do while !(dbName)->(EOF())
      standart := {}
      uroven := {}

      hb_jsonDecode( (dbName)->STANDART, @standart )
      hb_jsonDecode( (dbName)->UROVEN, @uroven )

      for each row in standart
        row[1] := hb_SToD(row[1])
      next
      for each row in uroven
        row[1] := hb_SToD(row[1])
      next

      aadd(_arr, { ;
              alltrim((dbName)->NAMES), ;
              alltrim((dbName)->CODEM), ;
              (dbName)->PROD, ;
              (dbName)->DEND, ;
              alltrim((dbName)->MCOD), ;
              alltrim((dbName)->NAMEF), ;
              uroven, ; // уровень оплаты, с 2013 года 4 - индивидуальные тарифы
              standart, ;
              (dbName)->MAIN == '1', ;
              (dbName)->PFA == '1', ;
              (dbName)->PFS == '1', ;
              alltrim((dbName)->ADRES) ;
        } )

      (dbName)->(dbSkip())
    enddo
    (dbName)->(dbCloseArea())

    if hb_FileExists(dir_server + sbase + sdbf)
      dbUseArea( .t.,, dir_server + sbase, sbase, .f., .f. )
      // dbUseArea( .t., , dbName, dbName, .f., .f. )
      (sbase)->(dbGoTop())
      do while !(sbase)->(EOF())

      aadd(_arr, { ;
              alltrim((sbase)->NAMES), ;
              alltrim((sbase)->CODEM), ;
              '', ;
              (sbase)->DEND, ;
              alltrim((sbase)->MCOD), ;
              alltrim((sbase)->NAMEF), ;
              {}, ; // уровень оплаты, с 2013 года 4 - индивидуальные тарифы
              {}, ;
              '1', ;
              '0', ;
              '0', ;
              alltrim((sbase)->ADRES) ;
        } )
        (sbase)->(dbSkip())
      enddo
      (sbase)->(dbCloseArea())
      endif
  endif

  
  return _arr

