* 17.02.21 вернуть массив по справочнику ТФОМС V012.xml
function getV012()
  // V012.xml - Классификатор исходов заболевания
  //  1 - IZNAME(C)  2 - IDIZ(N)  3 - DATEBEG(D)  4 - DATEEND(D)  5 - DL_USLOV(N)
  local _v012 := {}

  aadd(_v012, {"101/ст-р/Выздоровление",101,stod("20110101"),stod(""),1})
  aadd(_v012, {"102/ст-р/Улучшение",102,stod("20110101"),stod(""),1})
  aadd(_v012, {"103/ст-р/Без перемен",103,stod("20110101"),stod(""),1})
  aadd(_v012, {"104/ст-р/Ухудшение",104,stod("20110101"),stod(""),1})
  aadd(_v012, {"201/дн.с/Выздоровление",201,stod("20110101"),stod(""),2})
  aadd(_v012, {"202/дн.с/Улучшение",202,stod("20110101"),stod(""),2})
  aadd(_v012, {"203/дн.с/Без перемен",203,stod("20110101"),stod(""),2})
  aadd(_v012, {"204/дн.с/Ухудшение",204,stod("20110101"),stod(""),2})
  aadd(_v012, {"301/п-ка/Выздоровление",301,stod("20110101"),stod(""),3})
  aadd(_v012, {"302/п-ка/Ремиссия",302,stod("20110101"),stod(""),3})
  aadd(_v012, {"303/п-ка/Улучшение",303,stod("20110101"),stod(""),3})
  aadd(_v012, {"304/п-ка/Без перемен",304,stod("20110101"),stod(""),3})
  aadd(_v012, {"305/п-ка/Ухудшение",305,stod("20110101"),stod(""),3})
  aadd(_v012, {"306/п-ка/Осмотр",306,stod("20120123"),stod(""),3})
  aadd(_v012, {"401/Улучшение",401,stod("20110101"),stod(""),4})
  aadd(_v012, {"402/Без эффекта",402,stod("20110101"),stod(""),4})
  aadd(_v012, {"403/Ухудшение",403,stod("20110101"),stod(""),4})

  return _v012