***** 04.03.21 инициализация справочников ФФОМС
Function InitSpravFFOMS()
  /////////////////////////////////////////////////
  // F005.xml - Классификатор статусов оплаты медицинской помощи
  // F006.xml - Классификатор видов контроля
  // F007.xml - Классификатор ведомственной принадлежности медицинской организации
  // F008.xml - Классификатор типов документов, подтверждающих факт страхования по ОМС
  // F009.xml - Классификатор статуса застрахованного лица
  // F010.xml - Классификатор субъектов Российской Федерации
  // F011.xml - Классификатор типов документов, удостоверяющих личность
  // F012.xml - Справочник ошибок форматно-логического контроля
  // F014.xml - Классификатор причин отказа в оплате медицинской помощи
  // F015.xml - Классификатор федеральных округов
  // O001.dbf - Общероссийский классификатор стран мира (ОКСМ)
  // V002.dbf - Классификатор профилей оказанной медицинской помощи
  // V004.xml - Классификатор медицинских специальностей
  // V005.xml - Классификатор пола застрахованного
  // V006.xml - Классификатор условий оказания медицинской помощи
  // V008.xml - Классификатор видов медицинской помощи
  // V009.xml - Классификатор результатов обращения за медицинской помощью
  // V010.xml - Классификатор способов оплаты медицинской помощи
  // V012.xml - Классификатор исходов заболевания
  // V014.xml - Классификатор форм медицинской помощи
  // V015.xml - Классификатор медицинских специальностей
  // V018.xml - Классификатор видов ВМП
  // V019.xml - Классификатор методов ВМП
  Local i, j, s, ar
  
  /////////////////////////////////////////////////
  // F005.xml - Классификатор статусов оплаты медицинской помощи
  //  1 - STNAME(C)  2 - IDIDST(N)  3 - DATEBEG(D)  4 - DATEEND(D)
  Public glob_F005 := getF005() //{}
  // aadd(glob_F005, {"Не принято решение об оплате",0,stod("20110101"),stod("")})
  // aadd(glob_F005, {"Оплачена",1,stod("20110101"),stod("")})
  // aadd(glob_F005, {"Не оплачена",2,stod("20110101"),stod("")})
  // aadd(glob_F005, {"Частично оплачена",3,stod("20110101"),stod("")})

  // F006.xml - Классификатор видов контроля
  //  1 - VIDNAME(C)  2 - IDVID(N)  3 - DATEBEG(D)  4 - DATEEND(D)
  Public glob_F006 := getF006() //{}

  // F007.xml - Классификатор ведомственной принадлежности медицинской организации
  //  1 - VEDNAME(C)  2 - IDVED(N)  3 - DATEBEG(D)  4 - DATEEND(D)
  Public glob_F007 := getF007() //{}
  // aadd(glob_F007, {"Муниципального образования",1,stod("20110101"),stod("")})
  // aadd(glob_F007, {"Субъекта Российской Федерации",2,stod("20110101"),stod("")})
  // aadd(glob_F007, {"Минздравсоцразвития России",3,stod("20110101"),stod("")})
  // aadd(glob_F007, {"Минобрнауки России",4,stod("20110101"),stod("")})
  // aadd(glob_F007, {"Минобороны России",5,stod("20110101"),stod("")})
  // aadd(glob_F007, {"МВД России",6,stod("20110101"),stod("")})
  // aadd(glob_F007, {"Минюста России ГУИН",7,stod("20110101"),stod("")})
  // aadd(glob_F007, {"ФСБ России",8,stod("20110101"),stod("")})
  // aadd(glob_F007, {"РАМН",9,stod("20110101"),stod("")})
  // aadd(glob_F007, {"ФМБА России",10,stod("20110101"),stod("")})
  // aadd(glob_F007, {"Прочих федеральных министерств и ведомств",11,stod("20110101"),stod("")})
  // aadd(glob_F007, {'НУЗ ОАО "РЖД"',12,stod("20110101"),stod("")})
  // aadd(glob_F007, {"Автономные МО",13,stod("20110101"),stod("")})
  // aadd(glob_F007, {"Общественных, религиозных организаций",14,stod("20110101"),stod("")})
  // aadd(glob_F007, {"Иные",15,stod("20110101"),stod("")})

  // F008.xml - Классификатор типов документов, подтверждающих факт страхования по ОМС
  //  1 - DOCNAME(C)  2 - IDDOC(N)  3 - DATEBEG(D)  4 - DATEEND(D)
  Public glob_F008 := getF008() // {}
  // aadd(glob_F008, {"Полис ОМС старого образца",1,stod("20110101"),stod("")})
  // aadd(glob_F008, {"Временное свидетельство, подтверждающее оформление полиса обязательного медицинского страхования",2,stod("20110101"),stod("")})
  // aadd(glob_F008, {"Полис ОМС единого образца",3,stod("20110101"),stod("")})

  // F009.xml - Классификатор статуса застрахованного лица
  //  1 - StatusName(C)  2 - IDStatus(N)  3 - DATEBEG(D)  4 - DATEEND(D)
  Public glob_F009 := getF009() // {}
  // aadd(glob_F009, {"Работающий",1,stod("20110101"),stod("")})
  // aadd(glob_F009, {"Неработающий",2,stod("20110101"),stod("")})

  // F010.xml - Классификатор субъектов Российской Федерации
  //  1 - SUBNAME(C) 2 - KOD_TF(N)  3 - OKRUG(N)  4 - KOD_OKATO(C)  5 - DATEBEG(D)  6 - DATEEND(D)
  Public glob_F010 := getf010()

  // F011.xml - Классификатор типов документов, удостоверяющих личность
  Public glob_F011 := getF011()

  // F012.xml - Справочник ошибок форматно-логического контроля
  //  1 - Opis(C)  2 - Kod(N)  3 - DATEBEG(D)  4 - DATEEND(D)  5 - DopInfo(C)
  Public glob_F012 := getF012() // {}
  // aadd(glob_F012, {"Ошибочный порядок тегов",901,stod("20110101"),stod(""),"Нарушен порядок следования тегов, либо отсутствует обязательный тег."})
  // aadd(glob_F012, {"Отсутствует обязательное поле",902,stod("20110101"),stod(""),"Отсутствует значение в обязательном теге."})
  // aadd(glob_F012, {"Неверный тип данных",903,stod("20110101"),stod(""),"Заполненное поле содержит данные, не соответствующие его типу."})
  // aadd(glob_F012, {"Неверный код",904,stod("20110101"),stod(""),"Значение не соответствует допустимому."})
  // aadd(glob_F012, {"Дубль ключевого идентификатора",905,stod("20110101"),stod(""),"Уникальный код уже использовался в данном файле."})
  // aadd(glob_F012, {"Неверный формат пакета",801,stod("20110101"),stod(""),"Пакет не упакован в архив формата zip."})
  // aadd(glob_F012, {"Неверное имя пакета",802,stod("20110101"),stod(""),"Имя пакета не соответствует документации"})
  // aadd(glob_F012, {"В пакете содержатся не все файлы",803,stod("20110101"),stod(""),"Один или два файлы не найдены в zip архиве"})
  // aadd(glob_F012, {"Неверное значение элемента",804,stod("20110101"),stod(""),"Неверное значение элемента"})
  // aadd(glob_F012, {"Пакет с таким именем был зарегистрирован ранее",805,stod("20110101"),stod(""),"Пакет с таким именем был зарегистрирован ранее"})

  // F014.xml - Классификатор причин отказа в оплате медицинской помощи
  //  1 - Komment(C)  2 - Kod(N)  3 - DATEBEG(D)  4 - DATEEND(D)  5 - IDVID(N)  6 - Naim(C)  7 - Osn(C)  8 - KodPG(C)
  Public glob_F014 := getF014()   // {}  // теперь добавлен в Т005
  
  // F015.xml - Классификатор федеральных округов
  //  1 - OKRNAME(C)  2 - KOD_OK(N)  3 - DATEBEG(D)  4 - DATEEND(D)
  Public glob_F015 := getF015()   // {}

  // O001.dbf - Общероссийский классификатор стран мира (ОКСМ)
  //  1 - NAME11(C)  2 - KOD(C)  3 - DATEBEG(D)  4 - DATEEND(D)  5 - ALFA2(C)  6 - ALFA3(C)
  Public glob_O001 := getO001() // {}
  
  // V002.dbf - Классификатор профилей оказанной медицинской помощи
  //  1 - PRNAME(C)  2 - IDPR(N)  3 - DATEBEG(D)  4 - DATEEND(D)
  Public glob_V002 := getV002()   //{}

  // V004.xml - Классификатор медицинских специальностей
  //  1 - MSPNAME(C)  2 - IDMSP(N)  3 - DATEBEG(D)  4 - DATEEND(D)
  Public glob_V004 := getV004()   //{}

  // V005.xml - Классификатор пола застрахованного
  //  1 - POLNAME(C)  2 - IDPOL(N)  3 - DATEBEG(D)  4 - DATEEND(D)
  Public glob_V005 := getV005() // {}
  // aadd(glob_V005, {"Мужской",1,stod(""),stod("")})
  // aadd(glob_V005, {"Женский",2,stod(""),stod("")})

  // V006.xml - Классификатор условий оказания медицинской помощи
  //  1 - UMPNAME(C)  2 - IDUMP(N)  3 - DATEBEG(D)  4 - DATEEND(D)
  Public glob_V006 := getV006() // {}
  // aadd(glob_V006, {"Стационар",1,stod("20110101"),stod("")})
  // aadd(glob_V006, {"Дневной стационар",2,stod("20110101"),stod("")})
  // aadd(glob_V006, {"Поликлиника",3,stod("20110101"),stod("")})
  // aadd(glob_V006, {"Скорая помощь",4,stod("20130101"),stod("")})

  // V008.xml - Классификатор видов медицинской помощи
  //  1 - VMPNAME(C)  2 - IDVMP(N)  3 - DATEBEG(D)  4 - DATEEND(D)
  Public glob_V008 := getV008() // {}
  // aadd(glob_V008, {"Первичная медико-санитарная помощь",1,stod("20110101"),stod("")})
  // aadd(glob_V008, {"Скорая, в том числе специализированная (санитарно-авиационная), медицинская помощь",2,stod("20130101"),stod("")})
  // aadd(glob_V008, {"Специализированная, в том числе высокотехнологичная, медицинская помощь",3,stod("20110101"),stod("")})

  // V009.xml - Классификатор результатов обращения за медицинской помощью
  //  1 - RMPNAME(C)  2 - IDRMP(N)  3 - DATEBEG(D)  4 - DATEEND(D)  5 - DL_USLOV(N)
  Public glob_V009 := getV009()   // {}

  // V010.xml - Классификатор способов оплаты медицинской помощи
  //  1 - SPNAME(C)  2 - IDSP(N)  3 - DATEBEG(D)  4 - DATEEND(D)
  Public glob_V010 := getV010()   // {}

  // V012.xml - Классификатор исходов заболевания
  //  1 - IZNAME(C)  2 - IDIZ(N)  3 - DATEBEG(D)  4 - DATEEND(D)  5 - DL_USLOV(N)
  Public glob_V012 := getV012()   // {}

  // V014.xml - Классификатор форм медицинской помощи
  //  1 - FRMMPNAME(C)  2 - IDFRMMP(N)  3 - DATEBEG(D)  4 - DATEEND(D)
  Public glob_V014 := getV014() // {}
  // aadd(glob_V014, {"Экстренная",1,stod("20130101"),stod("")})
  // aadd(glob_V014, {"Неотложная",2,stod("20130101"),stod("")})
  // aadd(glob_V014, {"Плановая",3,stod("20130101"),stod("")})
  
  // V015.xml - Классификатор медицинских специальностей
  //  1 - NAME(C)  2 - CODE(N)  3 - HIGH(C)  4 - OKSO(C)  5 - DATEBEG(D)  6 - DATEEND(D)
  Public glob_V015 := getV015()   // {}

  // V021.xml - Классификатор медицинских специальностей (последний)
  //  1 - SPECNAME(C)  2 - IDSPEC(N)  3 - DATEBEG(D)  4 - DATEEND(D)
  Public glob_V021 := getV021()   // {}

  // V016.xml - Классификатор видов диспансеризации/профосмотров
  //  1 - kod(N), 2 - IDDT(C)  3 - DTNAME(C)  4 - DATEBEG(D)
  Public glob_V016 := getV016() // {}
  // aadd(glob_V016, {201,"ДВ1","Первый этап диспансеризации определенных групп взрослого населения (1 раз в 3 года)",stod("2016-01-01")})
  // aadd(glob_V016, {202,"ДВ2","Второй этап диспансеризации определенных групп взрослого населения (1 раз в 3 года)",stod("2016-01-01")})
  // aadd(glob_V016, {203,"ОПВ","Профилактические медицинские осмотры взрослого населения",stod("2013-12-26")})
  // aadd(glob_V016, {204,"ДВ3","Первый этап диспансеризации определенных групп взрослого населения (1 раз в 2 года)",stod("2018-01-01")})
  // aadd(glob_V016, {205,"ДВ2","Второй этап диспансеризации определенных групп взрослого населения (1 раз в 2 года)",stod("2018-01-01")})
  // aadd(glob_V016, {101,"ДС1","Диспансеризация пребывающих в стационарных учреждениях детей-сирот и детей, находящихся в трудной жизненной ситуации (состоящая из 1 этапа)",stod("2017-01-01")})
  // aadd(glob_V016, {102,"ДС2","Диспансеризация пребывающих в стационарных учреждениях детей-сирот и детей, находящихся в трудной жизненной ситуации  (состоящая из 2-х этапов)",stod("2017-01-01")})
  // aadd(glob_V016, {101,"ДУ1","Диспансеризация детей-сирот и детей, оставшихся без попечения родителей, в том числе усыновленных (удочеренных), принятых под опеку (попечительство) в приемную или патронатную семью  (состоящая из 1 этапа)",stod("2017-01-01")})
  // aadd(glob_V016, {102,"ДУ2","Диспансеризация детей-сирот и детей, оставшихся без попечения родителей, в том числе усыновленных (удочеренных), принятых под опеку (попечительство) в приемную или патронатную семью  (состоящая из 2-х этапов)",stod("2017-01-01")})
  // aadd(glob_V016, {301,"ОН1","Медицинские осмотры несовершеннолетних, в том числе при поступлении в образовательные учреждения и в период обучения в них (профилактические) (состоящие из 1 этапа)",stod("2017-01-01")})
  // aadd(glob_V016, {302,"ОН2","Медицинские осмотры несовершеннолетних, в том числе при поступлении в образовательные учреждения и в период обучения в них (профилактические) (состоящие из 2-х этапов)",stod("2017-01-01")})
  // aadd(glob_V016, {303,"ПО1","Медицинские осмотры несовершеннолетних, в том числе при поступлении в образовательные учреждения и в период обучения в них (предварительные) (состоящие из 1 этапа)",stod("2017-01-01")})
  // aadd(glob_V016, {304,"ПО2","Медицинские осмотры несовершеннолетних, в том числе при поступлении в образовательные учреждения и в период обучения в них (предварительные) (состоящие из 2-х этапов)",stod("2017-01-01")})
  // aadd(glob_V016, {305,"ОПН","Медицинские осмотры несовершеннолетних, в том числе при поступлении в образовательные учреждения и в период обучения в них (периодические)",stod("2017-01-01")})

  // V018.xml - Классификатор видов ВМП
  //  1 - IDHVID(C)  2 - HVIDNAME(C)  3 - DATEBEG(D)  4 - DATEEND(D)
  Public glob_V018 := {}, _glob_V018 := {}
  if is_MO_VMP
    _glob_V018 := getV018table()
  endif

  // V019.xml - Классификатор методов ВМП
  //  1 - IDHM(N)  2 - HMNAME(C)  3 - DIAG(C)  4 - HVID(C)  5 - DATEBEG(D)  6 - DATEEND(D)
  Public glob_V019 := {}, _glob_V019 := {} 
  if is_MO_VMP
    _glob_V019 := getV019table()
    make_V018_V019(0d20210101)  // 07.02.2021
  endif
  
  // V020.xml - Классификатор профилей койки
  //  1 - K_PRNAME(C)  2 - IDK_PR(N)  3 - DATEBEG(D)  4 - DATEEND(D)
  Public glob_V020 := getV020()   // {}

  // T008.xml - Коды ошибок в протоколах обработки инф.пакетов
  // 1 - NAME (C), 2 - CODE (N), 3 - NAME_F (C), 4 - DATE_B (D), 5 - DATE_E (D)
  Public glob_T008 := getT008() // {}
  // aadd(glob_T008,{"Файл уже был загружен",0,"",stod("20140701"),stod("22220101")})
  // aadd(glob_T008,{"Файл не соответствует xsd-схеме",1,"",stod("20140701"),stod("22220101")})
  // aadd(glob_T008,{"Некорректное сочетание кодов МО (codeM и Mcod)",2,"",stod("20140701"),stod("22220101")})
  // aadd(glob_T008,{"Некорректный код профиля",3,"",stod("20140701"),stod("22220101")})
  // aadd(glob_T008,{"Некорректный код профиля койки",4,"",stod("20140701"),stod("22220101")})
  // aadd(glob_T008,{"Некорректный код диагноза",5,"",stod("20140701"),stod("22220101")})
  // aadd(glob_T008,{"Некорректная форма оказания МП (V014)",6,"",stod("20140701"),stod("22220101")})
  // aadd(glob_T008,{"Некорректный тип документа (F008)",7,"",stod("20140701"),stod("22220101")})
  // aadd(glob_T008,{"Некорректный пол (V005)",8,"",stod("20140701"),stod("22220101")})
  // aadd(glob_T008,{"Некорректный реестровый код МО юридического лица",9,"",stod("20140701"),stod("22220101")})
  // aadd(glob_T008,{"Некорректный регистрационный код МО по ТФОМС",10,"",stod("20140701"),stod("22220101")})
  // aadd(glob_T008,{"Данного направления нет в выписанных",11,"",stod("20140701"),stod("22220101")})
  // aadd(glob_T008,{"Некорректный код причины аннулирования",12,"",stod("20140701"),stod("22220101")})
  // aadd(glob_T008,{"Некорректный реестровый код СМО",13,"",stod("20140701"),stod("22220101")})
  // aadd(glob_T008,{"Профиль койки не соответствует профилю МП",14,"",stod("20140701"),stod("22220101")})
  // aadd(glob_T008,{"Некорректная дата госпитализации",15,"",stod("20140701"),stod("22220101")})
  // aadd(glob_T008,{"Запись по данному направлению уже была загружена",16,"",stod("20140701"),stod("22220101")})
  // aadd(glob_T008,{"Отсутствуют сведения о выполненных объемах для СМО",17,"",stod("20160915"),stod("22220101")})
  // aadd(glob_T008,{"Отчетная дата отлична от текущей",18,"",stod("20170220"),stod("22220101")})
  // aadd(glob_T008,{"Нарушена уникальность ID_D",19,"",stod("20180829"),stod("22220101")})
  // aadd(glob_T008,{"Дата в имени файла не соответствует DATE_R",20,"",stod("20180907"),stod("22220101")})
  // aadd(glob_T008,{"Дата в записи не соответствует DATE_R",21,"",stod("20180907"),stod("22220101")})
  // aadd(glob_T008,{"Превышен срок действия направления (30 дней)",22,"",stod("20180907"),stod("22220101")})
  // aadd(glob_T008,{"Ошибка в других записях файла",999,"",stod("20140701"),stod("22220101")})

  // T012.xml - Классификатор ошибок ИСОМП
  //  1 - NAME(C)  2 - CODE(N)  3 - STAGE_TK(C)  4 - DATE_B(D)  5 - DATE_E(D)
  Public glob_T012 := getT012() // {}
  // aadd(glob_T012, {"Файл не соответствует xsd-схеме",100,"ТК1",stod("20170101"),stod("22220101")})
  // aadd(glob_T012, {"Дублирование записи для одного ИП или для ИП за один отчетный период",101,"ТК2",stod("20170101"),stod("22220101")})
  // aadd(glob_T012, {"Неверный код МО",102,"ТК1",stod("20170101"),stod("22220101")})
  // aadd(glob_T012, {"Неверная дата формирования файла",103,"ТК1",stod("20170101"),stod("22220101")})
  // aadd(glob_T012, {"Имя файла не соответствует значению в поле NAME_F",104,"ТК1",stod("20170101"),stod("22220101")})
  // aadd(glob_T012, {"Неверно указан отчетный год",105,"ТК1",stod("20170101"),stod("22220101")})
  // aadd(glob_T012, {"Неверно указан отчетный квартал",106,"ТК1",stod("20170101"),stod("22220101")})
  // aadd(glob_T012, {"Отсутствует уникальность номера пакета за отчетный квартал отчетного года",107,"ТК1",stod("20170101"),stod("22220101")})
  // aadd(glob_T012, {"Отсутствует уникальность номера записи (ZAP)",108,"ТК1",stod("20170101"),stod("22220101")})
  // aadd(glob_T012, {"Отсутствует уникальность кода записи о пациенте (IDPAC) для одного информационного пакета",109,"ТК1",stod("20170101"),stod("22220101")})
  // aadd(glob_T012, {"Код типа ДПФС отсутствует в классификаторе F008",110,"ТК1",stod("20170101"),stod("22220101")})
  // aadd(glob_T012, {"Код типа УДЛ отсутствуте в классификаторе УДЛ",111,"ТК1",stod("20170101"),stod("22220101")})
  // aadd(glob_T012, {"Для пациента в отчетном году указанное профилаткическое мероприятие не проводится.",112,"ТК1",stod("20170101"),stod("22220101")})
  // aadd(glob_T012, {"Застрахованному лицу в отчетном году меньше 18 лет",113,"ТК1",stod("20170101"),stod("22220101")})
  // aadd(glob_T012, {"Несвоевременное предоставление сведений (несоответствие отчетному периоду)",115,"ТК1",stod("20170101"),stod("22220101")})
  // aadd(glob_T012, {"Несоответствие номера пакета в имени файла и в файле",116,"ТК1",stod("20170101"),stod("22220101")})
  // aadd(glob_T012, {"Код DS не найден в справочнике",117,"ТК1",stod("20170101"),stod("22220101")})
  // aadd(glob_T012, {"Дата постановки (DATE_B) на диспансерный учет некорректна",118,"ТК1",stod("20170101"),stod("22220101")})
  // aadd(glob_T012, {'Неверный тип записи (I, U)',120,"ТК2",stod("20170101"),stod("22220101")})
  // aadd(glob_T012, {"Пациенту уже проведены профилактические мероприятия в отчетном году",121,"ТК2",stod("20170101"),stod("22220101")})
  // aadd(glob_T012, {"Превышена установленная на месяц  численность (Общая по диспансеризации(O))",122,"ТК1",stod("20170101"),stod("22220101")})
  // aadd(glob_T012, {"Некорректная дата начала или окончания периода",123,"ТК1",stod("20170101"),stod("22220101")})
  // aadd(glob_T012, {"Дублирование записей о ЗЛ по Д-учету для разных МО",124,"ТК1",stod("20170101"),stod("22220101")})
  // aadd(glob_T012, {"Некорректная дата рождения ЗЛ",125,"ТК1",stod("20170101"),stod("22220101")})
  // aadd(glob_T012, {"Некорректный пол ЗЛ",126,"ТК1",stod("20170101"),stod("22220101")})
  // aadd(glob_T012, {"Повторяющиеся записи по ЕНП и коду специальности",130,"ТК1",stod("20170101"),stod("22220101")})
  // aadd(glob_T012, {"Повторяющиеся записи по ЕНП и коду диагноза",131,"ТК1",stod("20170101"),stod("22220101")})
  // aadd(glob_T012, {'Превышена установленная на месяц  численность (Общая по профосмотрам (R))',133,"ТК1",stod("20170101"),stod("22220101")})
  // aadd(glob_T012, {'Превышена установленная на месяц  численность (Диспансеризация "старше трудоспособного возраста"(D))',134,"ТК1",stod("20170101"),stod("22220101")})
  // aadd(glob_T012, {'Превышена установленная на месяц  численность (Диспансеризация 65 лет (P))',135,"ТК1",stod("20170101"),stod("22220101")})
  // aadd(glob_T012, {'Превышена установленная на месяц  численность (Диспансеризация старше 65 лет (Y))',136,"ТК1",stod("20170101"),stod("22220101")})
  // aadd(glob_T012, {"ЕНП проинформированного ЗЛ в списках отсутствует",201,"ТК1",stod("20170101"),stod("22220101")})
  // aadd(glob_T012, {"Дата информирования не соответствует отчетному периоду",202,"ТК1",stod("20170101"),stod("22220101")})
  // aadd(glob_T012, {"Обнаружено несоответствие части персональных данных пациента информации из списков",203,"ТК1",stod("20170101"),stod("22220101")})
  // aadd(glob_T012, {"Файл с таким именем был зарегистрирован (импортирован) ранее.",501,"ТК1",stod("20170101"),stod("22220101")})
  // aadd(glob_T012, {"Код МО в поле CODEM не соответствует коду МО в имени файла.",502,"ТК1",stod("20170101"),stod("22220101")})
  // aadd(glob_T012, {"Повторное предоставление первичных сведений в отчетном году.",503,"ТК1",stod("20170101"),stod("22220101")})
  // aadd(glob_T012, {"Неверное использование полей PREVENTIVE_ACTION.",504,"ТК1",stod("20170101"),stod("22220101")})
  // aadd(glob_T012, {"Неверное количество или порядок месяцев.",505,"ТК1",stod("20170101"),stod("22220101")})
  // aadd(glob_T012, {"Неверное использование полей PR_ACTION.",506,"ТК1",stod("20170101"),stod("22220101")})
  // aadd(glob_T012, {"Повторяющиеся порядковые номера (поле CODE_R).",507,"ТК1",stod("20170101"),stod("22220101")})
  // aadd(glob_T012, {"Численность ЗЛ за год не равна сумме численностей ЗЛ по месяцам.",508,"ТК1",stod("20170101"),stod("22220101")})
  // aadd(glob_T012, {"Численность ЗЛ за месяц не равна сумме численностей ЗЛ по участкам.",509,"ТК1",stod("20170101"),stod("22220101")})
  // aadd(glob_T012, {"Численность ЗЛ за год не равна утвержденным показателям.",510,"ТК1",stod("20170101"),stod("22220101")})
  // aadd(glob_T012, {"Отчетный год в имени файла не соответствует отчетному году в поле YEAR.",511,"ТК1",stod("20170101"),stod("22220101")})
  // aadd(glob_T012, {"Предоставление сведений об изменениях без предоставления первичных сведений.",512,"ТК1",stod("20170101"),stod("22220101")})

  // массив перекодировки специальностей из V015 в V021
  Public glob_arr_V015_V021 := {;
    {  1,  49  },; //    Педиатрия
    {  2,  96  },; //    Медико-профилактическое дело
    {  3,  69  },; //    Стоматология общей практики
    {  4,  101 },; //    Фармация
    {  5,  100 },; //    Сестринское дело
    {  6,  97  },; //    Медицинская биохимия
    {  7,  98  },; //    Медицинская биофизика
    {  8,  2   },; //    Акушерство и гинекология
    {  9,  4   },; //    Анестезиология-реаниматология
    { 10,  17  },; //    Дерматовенерология
    { 11,  21  },; //    Детская хирургия
    { 12,  10  },; //    Генетика
    { 13,  26  },; //    Клиническая лабораторная диагностика
    { 14,  35  },; //    Неврология
    { 15,  37  },; //    Неонатология
    { 16,  39  },; //    Общая врачебная практика (семейная медицина)
    { 17,  41  },; //    Онкология
    { 18,  42  },; //    Организация здравоохранения и общественное здоровье
    { 19,  45  },; //    Оториноларингология
    { 20,  46  },; //    Офтальмология
    { 21,  48  },; //    Патологическая анатомия
    { 22,  49  },; //    Педиатрия
    { 23,  52  },; //    Психиатрия
    { 24,  60  },; //    Рентгенология
    { 25,  66  },; //    Скорая медицинская помощь
    { 26,  73  },; //    Судебно-медицинская экспертиза
    { 27,  76  },; //    Терапия
    { 28,  79  },; //    Травматология и ортопедия
    { 29,  88  },; //    Фтизиатрия
    { 30,  90  },; //    Хирургия
    { 31,  92  },; //    Эндокринология
    { 32,  24  },; //    Инфекционные болезни
    { 33,  81  },; //    Ультразвуковая диагностика
    { 34,  87  },; //    Физиотерапия
    { 35,  89  },; //    Функциональная диагностика
    { 36,  93  },; //    Эндоскопия
    { 37,  77  },; //    Токсикология
    { 38,  80  },; //    Трансфузиология
    { 39,  89  },; //    Функциональная диагностика
    { 40,  17  },; //    Дерматовенерология
    { 41,  19  },; //    Детская онкология
    { 42,  20  },; //    Детская урология-андрология
    { 43,  28  },; //    Колопроктология
    { 44,  36  },; //    Нейрохирургия
    { 45,  65  },; //    Сердечно-сосудистая хирургия
    { 46,  78  },; //    Торакальная хирургия
    { 47,  80  },; //    Трансфузиология
    { 48,  81  },; //    Ультразвуковая диагностика
    { 49,  89  },; //    Функциональная диагностика
    { 50,  91  },; //    Челюстно-лицевая хирургия
    { 51,  93  },; //    Эндоскопия
    { 52,  31  },; //    Лабораторная генетика
    { 53,  24  },; //    Инфекционные болезни
    { 54,  5   },; //    Бактериология
    { 55,  6   },; //    Вирусология
    { 56,  31  },; //    Лабораторная генетика
    { 57,  26  },; //    Клиническая лабораторная диагностика
    { 58,  32  },; //    Лечебная физкультура и спортивная медицина
    { 59,  32  },; //    Лечебная физкультура и спортивная медицина
    { 61,  33  },; //    Мануальная терапия
    { 62,  62  },; //    Рефлексотерапия
    { 63,  87  },; //    Физиотерапия
    { 64,  89  },; //    Функциональная диагностика
    { 65,  32  },; //    Лечебная физкультура и спортивная медицина
    { 66,  11  },; //    Гериатрия
    { 67,  32  },; //    Лечебная физкультура и спортивная медицина
    { 69,  81  },; //    Ультразвуковая диагностика
    { 70,  87  },; //    Физиотерапия
    { 71,  89  },; //    Функциональная диагностика
    { 72,  93  },; //    Эндоскопия
    { 73,  19  },; //    Детская онкология
    { 74,  57  },; //    Радиология
    { 75,  75  },; //    Сурдология-оториноларингология
    { 77,  3   },; //    Аллергология и иммунология
    { 78,  32  },; //    Лечебная физкультура и спортивная медицина
    { 79,  8   },; //    Гастроэнтерология
    { 80,  9   },; //    Гематология
    { 81,  18  },; //    Детская кардиология
    { 82,  19  },; //    Детская онкология
    { 83,  22  },; //    Детская эндокринология
    { 84,  23  },; //    Диетология
    { 85,  27  },; //    Клиническая фармакология
    { 86,  32  },; //    Лечебная физкультура и спортивная медицина
    { 88,  33  },; //    Мануальная терапия
    { 89,  38  },; //    Нефрология
    { 90,  55  },; //    Пульмонология
    { 91,  59  },; //    Ревматология
    { 92,  80  },; //    Трансфузиология
    { 93,  81  },; //    Ультразвуковая диагностика
    { 94,  87  },; //    Физиотерапия
    { 95,  89  },; //    Функциональная диагностика
    { 96,  93  },; //    Эндоскопия
    { 97,  53  },; //    Психиатрия-наркология
    { 98,  54  },; //    Психотерапия
    { 99,  64  },; //    Сексология
    {100,  74  },; //    Судебно-психиатрическая экспертиза
    {102,  57  },; //    Радиология
    {103,  81  },; //    Ультразвуковая диагностика
    {104,  32  },; //    Лечебная физкультура и спортивная медицина
    {105,  32  },; //    Лечебная физкультура и спортивная медицина
    {107,  81  },; //    Ультразвуковая диагностика
    {108,  87  },; //    Физиотерапия
    {109,  89  },; //    Функциональная диагностика
    {110,  1   },; //    Авиационная и космическая медицина
    {112,  3   },; //    Аллергология и иммунология
    {113,  32  },; //    Лечебная физкультура и спортивная медицина
    {114,  8   },; //    Гастроэнтерология
    {115,  9   },; //    Гематология
    {116,  11  },; //    Гериатрия
    {117,  23  },; //    Диетология
    {118,  25  },; //    Кардиология
    {119,  27  },; //    Клиническая фармакология
    {120,  32  },; //    Лечебная физкультура и спортивная медицина
    {122,  33  },; //    Мануальная терапия
    {123,  38  },; //    Нефрология
    {124,  51  },; //    Профпатология
    {125,  55  },; //    Пульмонология
    {126,  59  },; //    Ревматология
    {127,  62  },; //    Рефлексотерапия
    {128,  80  },; //    Трансфузиология
    {129,  81  },; //    Ультразвуковая диагностика
    {130,  87  },; //    Физиотерапия
    {131,  89  },; //    Функциональная диагностика
    {132,  93  },; //    Эндоскопия
    {133,  32  },; //    Лечебная физкультура и спортивная медицина
    {134,  32  },; //    Лечебная физкультура и спортивная медицина
    {136,  33  },; //    Мануальная терапия
    {137,  87  },; //    Физиотерапия
    {138,  55  },; //    Пульмонология
    {139,  28  },; //    Колопроктология
    {140,  36  },; //    Нейрохирургия
    {141,  65  },; //    Сердечно-сосудистая хирургия
    {142,  78  },; //    Торакальная хирургия
    {143,  80  },; //    Трансфузиология
    {144,  81  },; //    Ультразвуковая диагностика
    {145,  84  },; //    Урология
    {146,  89  },; //    Функциональная диагностика
    {147,  91  },; //    Челюстно-лицевая хирургия
    {148,  93  },; //    Эндоскопия
    {149,  22  },; //    Детская эндокринология
    {150,  92  },; //    Эндокринология
    {151,  26  },; //    Клиническая лабораторная диагностика
    {152,  40  },; //    Общая гигиена
    {153,  67  },; //    Социальная гигиена и организация госсанэпидслужбы
    {154,  94  },; //    Эпидемиология
    {155,  5   },; //    Бактериология
    {156,  6   },; //    Вирусология
    {157,  31  },; //    Лабораторная генетика
    {158,  26  },; //    Клиническая лабораторная диагностика
    {159,  12  },; //    Гигиена детей и подростков
    {160,  13  },; //    Гигиена питания
    {161,  14  },; //    Гигиена труда
    {162,  15  },; //    Гигиеническое воспитание
    {163,  29  },; //    Коммунальная гигиена
    {164,  56  },; //    Радиационная гигиена
    {165,  63  },; //    Санитарно-гигиенические лабораторные исследования
    {167,  5   },; //    Бактериология
    {168,  6   },; //    Вирусология
    {169,  16  },; //    Дезинфектология
    {170,  47  },; //    Паразитология
    {171,  69  },; //    Стоматология общей практики
    {172,  26  },; //    Клиническая лабораторная диагностика
    {173,  43  },; //    Ортодонтия
    {174,  68  },; //    Стоматология детская
    {175,  70  },; //    Стоматология ортопедическая
    {176,  71  },; //    Стоматология терапевтическая
    {177,  72  },; //    Стоматология хирургическая
    {178,  91  },; //    Челюстно-лицевая хирургия
    {179,  87  },; //    Физиотерапия
    {180,  5   },; //    Бактериология
    {181,  6   },; //    Вирусология
    {182,  31  },; //    Лабораторная генетика
    {183,  26  },; //    Клиническая лабораторная диагностика
    {184,  82  },; //    Управление и экономика фармации
    {185,  86  },; //    Фармацевтическая химия и фармакогнозия
    {186,  83  },; //    Управление сестринской деятельностью
    {187,  10  },; //    Генетика
    {188,  31  },; //    Лабораторная генетика
    {189,  26  },; //    Клиническая лабораторная диагностика
    {190,  5   },; //    Бактериология
    {191,  6   },; //    Вирусология
    {192,  26  },; //    Клиническая лабораторная диагностика
    {193,  31  },; //    Лабораторная генетика
    {194,  73  },; //    Судебно-медицинская экспертиза
    {195,  26  },; //    Клиническая лабораторная диагностика
    {196,  60  },; //    Рентгенология
    {197,  5   },; //    Бактериология
    {198,  6   },; //    Вирусология
    {199,  31  },; //    Лабораторная генетика
    {200,  26  },; //    Клиническая лабораторная диагностика
    {201,  57  },; //    Радиология
    {202,  89  },; //    Функциональная диагностика
    {203,  81  },; //    Ультразвуковая диагностика
    {206,  206 },; //    Лечебное дело (средний медперсонал)
    {207,  207 },; //    Акушерское дело (средний медперсонал)
    {208,  208 },; //    Стоматология (средний медперсонал)
    {209,  209 },; //    Стоматология ортопедическая
    {215,  215 },; //    Лабораторная диагностика
    {217,  217 },; //    Лабораторное дело
    {219,  219 },; //    Сестринское дело
    {221,  221 },; //    Сестринское дело в педиатрии
    {223,  223 },; //    Анестезиология и реаниматология
    {224,  224 },; //    Общая практика
    {226,  226 },; //    Функциональная диагностика
    {227,  227 },; //    Физиотерапия
    {228,  228 },; //    Медицинский массаж
    {229,  85  },; //    Фармацевтическая технология
    {230,  230 },; //    Лечебная физкультура
    {231,  231 },; //    Диетология
    {233,  233 },; //    Стоматология профилактическая
    {236,  34  },; //    Медико-социальная экспертиза
    {237,  34  },; //    Медико-социальная экспертиза
    {238,  34  },; //    Медико-социальная экспертиза
    {239,  34  },; //    Медико-социальная экспертиза
    {240,  34  },; //    Медико-социальная экспертиза
    {241,  34  },; //    Медико-социальная экспертиза
    {242,  34  },; //    Медико-социальная экспертиза
    {243,  34  },; //    Медико-социальная экспертиза
    {244,  34  },; //    Медико-социальная экспертиза
    {245,  34  },; //    Медико-социальная экспертиза
    {246,  34  },; //    Медико-социальная экспертиза
    {247,  50  },; //    Пластическая хирургия
    {248,  61  },; //    Рентгенэндоваскулярные диагностика и лечение
    {249,  81  },; //    Ультразвуковая диагностика
    {250,  61  },; //    Рентгенэндоваскулярные диагностика и лечение
    {251,  80  },; //    Трансфузиология
    {252,  30  },; //    Косметология
    {253,  61  },; //    Рентгенэндоваскулярные диагностика и лечение
    {254,  61  },; //    Рентгенэндоваскулярные диагностика и лечение
    {255,  3   },; //    Аллергология и иммунология
    {256,  7   },; //    Водолазная медицина
    {257,  8   },; //    Гастроэнтерология
    {258,  9   },; //    Гематология
    {259,  23  },; //    Диетология
    {260,  25  },; //    Кардиология
    {261,  38  },; //    Нефрология
    {262,  55  },; //    Пульмонология
    {263,  59  },; //    Ревматология
    {264,  80  },; //    Трансфузиология
    {265,  61  },; //    Рентгенэндоваскулярные диагностика и лечение
    {266,  61  },; //    Рентгенэндоваскулярные диагностика и лечение
    {267,  42  },; //    Организация здравоохранения и общественное здоровье
    {268,  42  },; //    Организация здравоохранения и общественное здоровье
    {269,  99  },; //    Медицинская кибернетика
    {270,  26  },; //    Клиническая лабораторная диагностика
    {271,  60  },; //    Рентгенология
    {272,  5   },; //    Бактериология
    {273,  6   },; //    Вирусология
    {274,  31  },; //    Лабораторная генетика
    {275,  26  },; //    Клиническая лабораторная диагностика
    {276,  57  },; //    Радиология
    {277,  89  },; //    Функциональная диагностика
    {278,  81  },; //    Ультразвуковая диагностика
    {280,  280 },; //    Наркология
    {281,  281 },; //    Реабилитационное сестринское дело
    {283,  283 },; //    Скорая и неотложная помощь
    {286,  87  },; //    Физиотерапия
    {288,  98  },; //    Медицинская биофизика
    {289,  98  },; //    Медицинская биофизика
    {290,  99  },; //    Медицинская кибернетика
    {3200, 97  },; //    Медицинская биохимия
    {3201, 97  };  //    Медицинская биохимия
  }

  // массив перекодировки специальностей из V004 в V015
  Public glob_arr_V004_V015 := {;
    {     1,  0,"Высшее медицинское образование"},;
    {    11,  1,"Лечебное дело. Педиатрия"},;
    {  1101,  8,"Акушерство и гинекология"},;
    {110101, 33,"Ультразвуковая диагностика"},;
    {110102, 34,"Физиотерапия"},;
    {110103, 35,"Функциональная диагностика"},;
    {110104, 36,"Эндоскопия"},;
    {  1103,  9,"Анестезиология и реаниматология"},;
    {110301, 37,"Токсикология"},;
    {110302, 38,"Трансфузиология"},;
    {110303, 39,"Функциональная диагностика"},;
    {  1104, 10,"Дерматовенерология"},;
    {110401, 40,"Клиническая микология"},;
    {  1105, 12,"Генетика"},;
    {110501, 52,"Лабораторная генетика"},;
    {  1106, 32,"Инфекционные болезни"},;
    {110601, 53,"Клиническая микология"},;
    {  1107, 13,"Клиническая лабораторная диагностика"},;
    {110701, 54,"Бактериология"},;
    {110702, 55,"Вирусология"},;
    {110703, 56,"Лабораторная генетика"},;
    {110704, 57,"Лабораторная микология"},;
    {  1109, 14,"Неврология"},;
    {110901, 61,"Мануальная терапия"},;
    {110902, 62,"Рефлексотерапия"},;
    {110903, 58,"Восстановительная медицина"},;
    {110904, 59,"Лечебная физкультура и спортивная медицина"},;
    {110905, 63,"Физиотерапия"},;
    {110906, 64,"Функциональная диагностика"},;
    {  1110, 16,"Общая врачебная практика (семейная медицина)"},;
    {111001, 65,"Восстановительная медицина"},;
    {111002, 66,"Гериатрия"},;
    {111003, 67,"Лечебная физкультура и спортивная медицина"},;
    {111004, 69,"Ультразвуковая диагностика"},;
    {111005, 70,"Физиотерапия"},;
    {111006, 71,"Функциональная диагностика"},;
    {111007, 72,"Эндоскопия"},;
    {  1111, 19,"Отоларингология"},;
    {111101, 75,"Сурдология-отоларингология"},;
    {  1112, 20,"Офтальмология"},;
    {  1113, 21,"Патологическая анатомия"},;
    {  1115, 23,"Психиатрия"},;
    {111501, 98,"Психотерапия"},;
    {111502, 99,"Сексология"},;
    {111503,100,"Судебно-психиатрическая экспертиза"},;
    {111504, 97,"Психиатрия-наркология"},;
    {  1118, 24,"Рентгенология"},;
    {111801,102,"Радиология"},;
    {111802,103,"Ультразвуковая диагностика"},;
    {  1119, 25,"Скорая медицинская помощь"},;
    {111901,104,"Восстановительная медицина"},;
    {111902,105,"Лечебная физкультура и спортивная медицина"},;
    {111903,107,"Ультразвуковая диагностика"},;
    {111904,108,"Физиотерапия"},;
    {111905,109,"Функциональная диагностика"},;
    {  1120, 18,"Организация здравоохранения и общественное здоровье"},;
    {  1121, 26,"Судебно-медицинская экспертиза"},;
    {  1122, 27,"Терапия"},;
    {112201,114,"Гастроэнтерология"},;
    {112202,115,"Гематология"},;
    {112203,116,"Гериатрия"},;
    {112204,117,"Диетология"},;
    {112205,118,"Кардиология"},;
    {112206,119,"Клиническая фармакология"},;
    {112207,123,"Нефрология"},;
    {112208,125,"Пульмонология"},;
    {112209,126,"Ревматология"},;
    {112210,128,"Трансфузиология"},;
    {112211,129,"Ультразвуковая диагностика"},;
    {112212,131,"Функциональная диагностика"},;
    {112213,110,"Авиационная и космическая медицина"},;
    {112214,112,"Аллергология и иммунология"},;
    {112215,113,"Восстановительная медицина"},;
    {112216,120,"Лечебная физкультура и спортивная медицина"},;
    {112217,122,"Мануальная терапия"},;
    {112218,124,"Профпатология"},;
    {112219,127,"Рефлексотерапия"},;
    {112220,130,"Физиотерапия"},;
    {112221,132,"Эндоскопия"},;
    {  1123, 28,"Травматология и ортопедия"},;
    {112301,136,"Мануальная терапия"},;
    {112302,133,"Восстановительная медицина"},;
    {112303,134,"Лечебная физкультура и спортивная медицина"},;
    {112304,285,"Физиология"},;
    {  1124,137,"Физиотерапия"},;
    {  1125, 29,"Фтизиатрия"},;
    {112501,138,"Пульмонология"},;
    {  1126, 30,"Хирургия"},;
    {112601,139,"Колопроктология"},;
    {112602,140,"Нейрохирургия"},;
    {112603,145,"Урология"},;
    {112604,141,"Сердечно-сосудистая хирургия"},;
    {112605,142,"Торакальная хирургия"},;
    {112606,143,"Трансфузиология"},;
    {112608,147,"Челюстно-лицевая хирургия"},;
    {112609,148,"Эндоскопия"},;
    {112610,144,"Ультразвуковая диагностика"},;
    {112611,146,"Функциональная диагностика"},;
    {  1127, 31,"Эндокринология"},;
    {112701,150,"Диабетология"},;
    {112702,149,"Детская эндокринология"},;
    {  1128, 17,"Онкология"},;
    {112801, 73,"Детская онкология"},;
    {112802, 74,"Радиология"},;
    {  1134, 22,"Педиатрия"},;
    {113401, 82,"Детская онкология"},;
    {113402, 83,"Детская эндокринология"},;
    {113403, 81,"Детская кардиология"},;
    {113404, 86,"Лечебная физкультура и спортивная медицина"},;
    {113405, 77,"Аллергология и иммунология"},;
    {113406, 78,"Восстановительная медицина"},;
    {113407, 79,"Гастроэнтерология"},;
    {113408, 80,"Гематология"},;
    {113409, 84,"Диетология"},;
    {113410, 85,"Клиническая фармакология"},;
    {113411, 88,"Мануальная терапия"},;
    {113412, 89,"Нефрология"},;
    {113413, 90,"Пульмонология"},;
    {113414, 91,"Ревматология"},;
    {113415, 92,"Трансфузиология"},;
    {113416, 93,"Ультразвуковая диагностика"},;
    {113417, 94,"Физиотерапия"},;
    {113418, 95,"Функциональная диагностика"},;
    {113419, 96,"Эндоскопия"},;
    {  1135, 11,"Детская хирургия"},;
    {113501, 41,"Детская онкология"},;
    {113502, 42,"Детская урология-андрология"},;
    {113503, 43,"Колопроктология"},;
    {113504, 44,"Нейрохирургия"},;
    {113505, 45,"Сердечно-сосудистая хирургия"},;
    {113506, 46,"Торакальная хирургия"},;
    {113507, 47,"Трансфузиология"},;
    {113508, 48,"Ультразвуковая диагностика"},;
    {113509, 49,"Функциональная диагностика"},;
    {113510, 50,"Челюстно-лицевая хирургия"},;
    {113511, 51,"Эндоскопия"},;
    {  1136, 15,"Неонатология"},;
    {    13,  2,"Медико-профилактическое дело"},;
    {  1301,151,"Клиническая лабораторная диагностика"},;
    {130101,155,"Бактериология"},;
    {130102,156,"Вирусология"},;
    {130103,157,"Лабораторная генетика"},;
    {130104,158,"Лабораторная микология"},;
    {  1302,154,"Эпидемиология"},;
    {130201,167,"Бактериология"},;
    {130203,169,"Дезинфектология"},;
    {130204,170,"Паразитология"},;
    {130205,168,"Вирусология"},;
    {  1303,152,"Общая гигиена"},;
    {130301,159,"Гигиена детей и подростков"},;
    {130302,162,"Гигиеническое воспитание"},;
    {130303,160,"Гигиена питания"},;
    {130304,161,"Гигиена труда"},;
    {130305,163,"Коммунальная гигиена"},;
    {130306,164,"Радиационная гигиена"},;
    {130307,165,"Санитарно-гигиенические лабораторные исследования"},;
    {  1306,153,"Социальная гигиена и организация госсанэпидслужбы"},;
    {    14,  3,"Стоматология"},;
    {  1401,171,"Стоматология общей практики"},;
    {140101,173,"Ортодонтия"},;
    {140102,174,"Стоматология детская"},;
    {140103,176,"Стоматология терапевтическая"},;
    {140104,175,"Стоматология ортопедическая"},;
    {140105,177,"Стоматология хирургическая"},;
    {140106,178,"Челюстно-лицевая хирургия"},;
    {140107,179,"Физиотерапия"},;
    {  1402,172,"Клиническая лабораторная диагностика"},;
    {140201,180,"Бактериология"},;
    {140202,181,"Вирусология"},;
    {140203,182,"Лабораторная генетика"},;
    {140204,183,"Лабораторная микология"},;
    {    15,  4,"Фармация"},;
    {  1501,184,"Управление и экономика фармации"},;
    {  1502,229,"Фармацевтическая технология"},;
    {  1503,185,"Фармацевтическая химия и фармакогнозия"},;
    {    16,  5,"Сестринское дело"},;
    {  1601,186,"Управление сестринской деятельностью"},;
    {    17,  6,"Медицинская биохимия"},;
    {  1701,187,"Генетика"},;
    {170101,188,"Лабораторная генетика"},;
    {  1702,189,"Клиническая лабораторная диагностика"},;
    {170201,190,"Бактериология"},;
    {170202,191,"Вирусология"},;
    {170203,193,"Лабораторная генетика"},;
    {170204,192,"Лабораторная микология"},;
    {  1703,194,"Судебно-медицинская экспертиза"},;
    {    18,  7,"Медицинская биофизика. Медицинская кибернетика"},;
    {  1801,195,"Клиническая лабораторная диагностика"},;
    {180101,197,"Бактериология"},;
    {180102,198,"Вирусология"},;
    {180103,199,"Лабораторная генетика"},;
    {180104,200,"Лабораторная микология"},;
    {  1802,196,"Рентгенология"},;
    {180201,201,"Радиология"},;
    {180202,202,"Функциональная диагностика"},;
    {180203,203,"Ультразвуковая диагностика"},;
    {     2,204,"Среднее медицинское и фармацевтическое образование"},;
    {  2001,205,"Организация сестринского дела"},;
    {  2002,206,"Лечебное дело"},;
    {  2003,207,"Акушерское дело"},;
    {  2004,208,"Стоматология"},;
    {  2005,209,"Стоматология ортопедическая"},;
    {  2006,210,"Эпидемиология (паразитология)"},;
    {  2007,211,"Гигиена и санитария"},;
    {  2008,212,"Дезинфекционное дело"},;
    {  2009,213,"Гигиеническое воспитание"},;
    {  2010,214,"Энтомология"},;
    {  2011,215,"Лабораторная диагностика"},;
    {  2012,216,"Гистология"},;
    {  2013,217,"Лабораторное дело"},;
    {  2014,218,"Фармация"},;
    {  2015,219,"Сестринское дело"},;
    {  2016,221,"Сестринское дело в педиатрии"},;
    {  2017,222,"Операционное дело"},;
    {  2018,223,"Анестезиология и реаниматология"},;
    {  2019,224,"Общая практика"},;
    {  2020,225,"Рентгенология"},;
    {  2021,226,"Функциональная диагностика"},;
    {  2022,227,"Физиотерапия"},;
    {  2023,228,"Медицинский массаж"},;
    {  2024,230,"Лечебная физкультура"},;
    {  2025,231,"Диетология"},;
    {  2026,232,"Медицинская статистика"},;
    {  2027,233,"Стоматология профилактическая"},;
    {  2028,234,"Судебно-медицинская экспертиза"},;
    {  2029,235,"Медицинская оптика"},;
    {     3,287,"Естественные науки"},;
    {    31,288,"Биофизика"},;
    {  3101,289,"Медицинская биофизика"},;
    {  3102,290,"Медицинская кибернетика"},;
    {    32,3200,"Биохимия"},;
    {  3201,3201,"Медицинская биохимия"};
   }

  // массив перекодировки новых специальностей из V015 в V004
  Public glob_arr_V015_V004 := {;
    { 1122,"Медико-социальная экспертиза", 236, 27},;
    { 1123,"Медико-социальная экспертиза", 237, 28},;
    { 1125,"Медико-социальная экспертиза", 238, 29},;
    { 1126,"Медико-социальная экспертиза", 239, 30},;
    { 1127,"Медико-социальная экспертиза", 240, 31},;
    { 1135,"Медико-социальная экспертиза", 241, 11},;
    { 1109,"Медико-социальная экспертиза", 242, 14},;
    { 1128,"Медико-социальная экспертиза", 243, 17},;
    { 1111,"Медико-социальная экспертиза", 244, 19},;
    { 1112,"Медико-социальная экспертиза", 245, 20},;
    { 1134,"Медико-социальная экспертиза", 246, 22},;
    { 1126,"Пластическая хирургия", 247, 30},;
    { 1126,"Рентгенэндоваскулярные диагностика и лечение", 248, 30},;
    { 112610,"Ультразвуковая диагностика", 249, 31},;
    { 110103,"Рентгенэндоваскулярные диагностика и лечение", 250, 8},;
    { 1101,"Трансфузиология", 251, 8},;
    { 1104,"Косметология", 252, 10},;
    { 113509,"Рентгенэндоваскулярные диагностика и лечение", 253, 11},;
    { 110906,"Рентгенэндоваскулярные диагностика и лечение", 254, 14},;
    { 112214,"Аллергология и иммунология", 255, 16},;
    { 112215,"Водолазная медицина", 256, 16},;
    { 112201,"Гастроэнтерология", 257, 16},;
    { 112202,"Гематология", 258, 16},;
    { 112204,"Диетология", 259, 16},;
    { 112205,"Кардиология", 260, 16},;
    { 112207,"Нефрология", 261, 16},;
    { 112208,"Пульмонология", 262, 16},;
    { 112209,"Ревматология", 263, 16},;
    { 112210,"Трансфузиология", 264, 16},;
    { 1118,"Рентгенэндоваскулярные диагностика и лечение", 265, 17},;
    { 1118,"Рентгенэндоваскулярные диагностика и лечение", 266, 24},;
    { 13,"Организация здравоохранения и общественное здоровье", 267, 2},;
    { 14,"Организация здравоохранения и общественное здоровье", 268, 3},;
    { 18,"Медицинская кибернетика", 269, 0},;
    { 1801,"Клиническая лабораторная диагностика", 270, 269},;
    { 1802,"Рентгенология", 271, 269},;
    { 180101,"Бактериология", 272, 270},;
    { 180102,"Вирусология", 273, 270},;
    { 180103,"Лабораторная генетика", 274, 270},;
    { 180104,"Лабораторная микология", 275, 270},;
    { 180201,"Радиология", 276, 271},;
    { 180202,"Функциональная диагностика", 277, 271},;
    { 180203,"Ультразвуковая диагностика", 278, 271},;
    { 2019,"Медико-социальная помощь", 279, 204},;
    { 2015,"Наркология", 280, 204},;
    { 2015,"Реабилитационное сестринское дело", 281, 204},;
    { 2015,"Сестринское дело в косметологии", 282, 204},;
    { 2002,"Скорая и неотложная помощь", 283, 204},;
    { 2006,"Бактериология", 284, 204},;
    { 2022,"Физиотерапия", 286, 1};
  }
  //

  Public glob_array_PZ_18 := {;
    { 1,207,"случай госпитализации ВМП 18-01","ВМП-01","к/д",""},;
    { 2,208,"случай госпитализации ВМП 18-02","ВМП-02","к/д",""},;
    { 3,209,"случай госпитализации ВМП 18-03","ВМП-03","к/д",""},;
    { 4,210,"случай госпитализации ВМП 18-04","ВМП-04","к/д",""},;
    { 5,211,"случай госпитализации ВМП 18-05","ВМП-05","к/д",""},;
    { 6,212,"случай госпитализации ВМП 18-06","ВМП-06","к/д",""},;
    { 7,213,"случай госпитализации ВМП 18-07","ВМП-07","к/д",""},;
    { 8,214,"случай госпитализации ВМП 18-08","ВМП-08","к/д",""},;
    { 9,215,"случай госпитализации ВМП 18-09","ВМП-09","к/д",""},;
    {10,216,"случай госпитализации ВМП 18-10","ВМП-10","к/д",""},;
    {11,217,"случай госпитализации ВМП 18-11","ВМП-11","к/д",""},;
    {12,218,"случай госпитализации ВМП 18-12","ВМП-12","к/д",""},;
    {13,219,"случай госпитализации ВМП 18-13","ВМП-13","к/д",""},;
    {14,220,"случай госпитализации ВМП 18-14","ВМП-14","к/д",""},;
    {15,221,"случай госпитализации ВМП 18-15","ВМП-15","к/д",""},;
    {16,222,"случай госпитализации ВМП 18-16","ВМП-16","к/д",""},;
    {17,223,"случай госпитализации ВМП 18-17","ВМП-17","к/д",""},;
    {18,224,"случай госпитализации ВМП 18-18","ВМП-18","к/д",""},;
    {19,225,"случай госпитализации ВМП 18-19","ВМП-19","к/д",""},;
    {20,226,"случай госпитализации ВМП 18-20","ВМП-20","к/д",""},;
    {21,227,"случай госпитализации ВМП 18-21","ВМП-21","к/д",""},;
    {22,228,"случай госпитализации ВМП 18-22","ВМП-22","к/д",""},;
    {23,229,"случай госпитализации ВМП 18-23","ВМП-23","к/д",""},;
    {24,230,"случай госпитализации ВМП 18-24","ВМП-24","к/д",""},;
    {25,231,"случай госпитализации ВМП 18-25","ВМП-25","к/д",""},;
    {26,232,"случай госпитализации ВМП 18-26","ВМП-26","к/д",""},;
    {27,233,"случай госпитализации ВМП 18-27","ВМП-27","к/д",""},;
    {28,234,"случай госпитализации ВМП 18-28","ВМП-28","к/д",""},;
    {29,235,"случай госпитализации ВМП 18-29","ВМП-29","к/д",""},;
    {30,236,"случай госпитализации ВМП 18-30","ВМП-30","к/д",""},;
    {31,237,"случай госпитализации ВМП 18-31","ВМП-31","к/д",""},;
    {32,238,"случай госпитализации ВМП 18-32","ВМП-32","к/д",""},;
    {33,239,"случай госпитализации ВМП 18-33","ВМП-33","к/д",""},;
    {34,240,"случай госпитализации ВМП 18-34","ВМП-34","к/д",""},;
    {35,241,"случай госпитализации ВМП 18-35","ВМП-35","к/д",""},;
    {36,242,"случай госпитализации ВМП 18-36","ВМП-36","к/д",""},;
    {37,243,"случай госпитализации ВМП 18-37","ВМП-37","к/д",""},;
    {38,244,"случай госпитализации ВМП 18-38","ВМП-38","к/д",""},;
    {39,245,"случай госпитализации ВМП 18-39","ВМП-39","к/д",""},;
    {40,246,"случай госпитализации ВМП 18-40","ВМП-40","к/д",""},;
    {41,247,"случай госпитализации ВМП 18-41","ВМП-41","к/д",""},;
    {42,248,"случай госпитализации ВМП 18-42","ВМП-42","к/д",""},;
    {43,249,"случай госпитализации ВМП 18-43","ВМП-43","к/д",""},;
    {44,250,"случай госпитализации ВМП 18-44","ВМП-44","к/д",""},;
    {45,251,"случай госпитализации ВМП 18-45","ВМП-45","к/д",""},;
    {46,252,"случай госпитализации ВМП 18-46","ВМП-46","к/д",""},;
    {47,253,"случай госпитализации ВМП 18-47","ВМП-47","к/д",""},;
    {48,254,"случай госпитализации ВМП 18-48","ВМП-48","к/д",""},;
    {49,255,"случай госпитализации ВМП 18-49","ВМП-49","к/д",""},;
    {50,256,"случай госпитализации ВМП 18-50","ВМП-50","к/д",""},;
    {51,257,"случай госпитализации ВМП 18-51","ВМП-51","к/д",""},;
    {52,258,"случай госпитализации ВМП 18-52","ВМП-52","к/д",""},;
    {60, 26,"Вызов СМП","вызовСМП","",{"71.*"}},; //
    {61, 29,"случай госпитализации","случГоспит","к/д",""},; //
    {62,142,"случай госпитализации при реабилитации","случГоспРеаб","к/д",""},; //
    {63,205,"обращение для ЗПТ","обр.ЗПТ","",""},;
    {64,206,"резус-фактор плода","р/ф плода","",""},;
    {65,141,"случай ЗПТ","случайЗПТ","",""},;
    {66,143,"случай лечения","случЛечения","п/д",""},;
    {67,259,"случай диализа","случДиализа","п/д",""},; //
    {68, 30,"Посещение профилактическое","амбПрофил.","",{"2.79.*","2.81.*","2.88.*"},{"2.79.52","2.79.53","2.79.54","2.79.55","2.79.56","2.79.57","2.79.58","2.88.40","2.88.41","2.88.42","2.88.43","2.88.44","2.88.45"}},;
    {69, 31,"Посещение неотложное","амбНеотлож.","",{"2.80.*","2.82.*"},{"2.80.29","2.80.30","2.80.31","2.80.32","2.80.33"}},;
    {70, 32,"Обращение","амбОбращен.","",{"2.78.*","2.89.*"},{"2.78.47","2.78.48","2.78.49","2.78.50","2.78.51","2.78.52","2.78.53"}},;
    {71, 38,"Посещение профилактическое Центра здоровья","ПосПрофЦЗ","",{"2.76.*"}},;
    {72,260,"комплексное посещение при диспансеризации","ПосДиспанс.","",""},; //
    {73,261,"комплексное посещение при ДВН 1 этап","ДВН 1","",""},; //
    {74,262,"комплексное посещение при ДВН 2 этап","ДВН 2","",""},; //
    {75,145,"посещение профилактическое в стоматологии","стомПроф.","",""},;
    {76,146,"посещение неотложное в стоматологии","стомНеотл.","",""},;
    {77,147,"обращение в стоматологии","стомОбращ.","",""},;
    {78, 33,"Р-исследование","Р-исслед.","",{"60.2.*"}},;
    {79,153,"пренатальный скрининг","ПренСкрининг","",{"4.15.746"}},;
    {80, 69,"жидкостная цитология","ЖидкЦитология","",{"4.20.702"}},;
    {81,148,"исследование биохимическое","исслБиохим.","",""},;
    {82,149,"исследование гематологическое","исслГематол.","",""},;
    {83,150,"исследование коагулогическое","исслКоагул.","",""},;
    {84,151,"исследование ИХЛ","исслИХЛ","",""},;
    {85,161,"исследование микробиологическое","исслМикробиол","",""},;
    {86,162,"исследование ПЦР","исслПЦР","",""};
  }

  Public glob_array_PZ_19 := {;
    { 1,263,"случай госпитализации ВМП 19-01","ВМП-01","к/д",""},;
    { 2,264,"случай госпитализации ВМП 19-02","ВМП-02","к/д",""},;
    { 3,265,"случай госпитализации ВМП 19-03","ВМП-03","к/д",""},;
    { 4,266,"случай госпитализации ВМП 19-04","ВМП-04","к/д",""},;
    { 5,267,"случай госпитализации ВМП 19-05","ВМП-05","к/д",""},;
    { 6,268,"случай госпитализации ВМП 19-06","ВМП-06","к/д",""},;
    { 7,269,"случай госпитализации ВМП 19-07","ВМП-07","к/д",""},;
    { 8,270,"случай госпитализации ВМП 19-08","ВМП-08","к/д",""},;
    { 9,271,"случай госпитализации ВМП 19-09","ВМП-09","к/д",""},;
    {10,272,"случай госпитализации ВМП 19-10","ВМП-10","к/д",""},;
    {11,273,"случай госпитализации ВМП 19-11","ВМП-11","к/д",""},;
    {12,274,"случай госпитализации ВМП 19-12","ВМП-12","к/д",""},;
    {13,275,"случай госпитализации ВМП 19-13","ВМП-13","к/д",""},;
    {14,276,"случай госпитализации ВМП 19-14","ВМП-14","к/д",""},;
    {15,277,"случай госпитализации ВМП 19-15","ВМП-15","к/д",""},;
    {16,278,"случай госпитализации ВМП 19-16","ВМП-16","к/д",""},;
    {17,279,"случай госпитализации ВМП 19-17","ВМП-17","к/д",""},;
    {18,280,"случай госпитализации ВМП 19-18","ВМП-18","к/д",""},;
    {19,281,"случай госпитализации ВМП 19-19","ВМП-19","к/д",""},;
    {20,282,"случай госпитализации ВМП 19-20","ВМП-20","к/д",""},;
    {21,283,"случай госпитализации ВМП 19-21","ВМП-21","к/д",""},;
    {22,284,"случай госпитализации ВМП 19-22","ВМП-22","к/д",""},;
    {23,285,"случай госпитализации ВМП 19-23","ВМП-23","к/д",""},;
    {24,286,"случай госпитализации ВМП 19-24","ВМП-24","к/д",""},;
    {25,287,"случай госпитализации ВМП 19-25","ВМП-25","к/д",""},;
    {26,288,"случай госпитализации ВМП 19-26","ВМП-26","к/д",""},;
    {27,289,"случай госпитализации ВМП 19-27","ВМП-27","к/д",""},;
    {28,290,"случай госпитализации ВМП 19-28","ВМП-28","к/д",""},;
    {29,291,"случай госпитализации ВМП 19-29","ВМП-29","к/д",""},;
    {30,292,"случай госпитализации ВМП 19-30","ВМП-30","к/д",""},;
    {31,293,"случай госпитализации ВМП 19-31","ВМП-31","к/д",""},;
    {32,294,"случай госпитализации ВМП 19-32","ВМП-32","к/д",""},;
    {33,295,"случай госпитализации ВМП 19-33","ВМП-33","к/д",""},;
    {34,296,"случай госпитализации ВМП 19-34","ВМП-34","к/д",""},;
    {35,297,"случай госпитализации ВМП 19-35","ВМП-35","к/д",""},;
    {36,298,"случай госпитализации ВМП 19-36","ВМП-36","к/д",""},;
    {37,299,"случай госпитализации ВМП 19-37","ВМП-37","к/д",""},;
    {38,300,"случай госпитализации ВМП 19-38","ВМП-38","к/д",""},;
    {39,301,"случай госпитализации ВМП 19-39","ВМП-39","к/д",""},;
    {40,302,"случай госпитализации ВМП 19-40","ВМП-40","к/д",""},;
    {41,303,"случай госпитализации ВМП 19-41","ВМП-41","к/д",""},;
    {42,304,"случай госпитализации ВМП 19-42","ВМП-42","к/д",""},;
    {43,305,"случай госпитализации ВМП 19-43","ВМП-43","к/д",""},;
    {44,306,"случай госпитализации ВМП 19-44","ВМП-44","к/д",""},;
    {45,307,"случай госпитализации ВМП 19-45","ВМП-45","к/д",""},;
    {46,308,"случай госпитализации ВМП 19-46","ВМП-46","к/д",""},;
    {47,309,"случай госпитализации ВМП 19-47","ВМП-47","к/д",""},;
    {48,310,"случай госпитализации ВМП 19-48","ВМП-48","к/д",""},;
    {49,311,"случай госпитализации ВМП 19-49","ВМП-49","к/д",""},;
    {50,312,"случай госпитализации ВМП 19-50","ВМП-50","к/д",""},;
    {51,313,"случай госпитализации ВМП 19-51","ВМП-51","к/д",""},;
    {52,314,"случай госпитализации ВМП 19-52","ВМП-52","к/д",""},;
    {53,315,"случай госпитализации ВМП 19-53","ВМП-53","к/д",""},;
    {54,316,"случай госпитализации ВМП 19-54","ВМП-54","к/д",""},;
    {60, 26,"вызов СМП","вызовСМП","",""},; //
    {61, 29,"случай госпитализации","случГоспит","к/д",""},; //
    {62,142,"случай госпитализации при реабилитации","случГоспРеаб","к/д",""},; //
    {63,205,"обращение для ЗПТ","обр.ЗПТ","",""},;
    {64,206,"резус-фактор плода","р/ф плода","",""},;
    {65,141,"случай ЗПТ","случайЗПТ","",""},;
    {66,143,"случай лечения","случЛечения","п/д",""},;
    {67,259,"случай диализа","случДиализа","п/д",""},; //
    {68, 30,"посещение профилактическое","амбПрофил.","",""},;
    {69, 31,"посещение неотложное","амбНеотлож.","",""},;
    {70, 32,"обращение","амбОбращен.","",""},;
    {71, 38,"посещение профилактическое Центра здоровья","ПосПрофЦЗ","",""},;
    {72,260,"комплексное посещение при диспансеризации","ПосДиспанс.","",""},; //
    {73,261,"комплексное посещение при ДВН 1 этап","ДВН 1","",""},; //
    {74,262,"комплексное посещение при ДВН 2 этап","ДВН 2","",""},; //
    {75,145,"посещение профилактическое в стоматологии","стомПроф.","",""},;
    {76,146,"посещение неотложное в стоматологии","стомНеотл.","",""},;
    {77,147,"обращение в стоматологии","стомОбращ.","",""},;
    {78, 33,"Р-исследование","Р-исслед.","",""},;
    {79,153,"пренатальный скрининг","ПренСкрининг","",""},;
    {80, 69,"жидкостная цитология","ЖидкЦитология","",""},;
    {81,148,"исследование биохимическое","исслБиохим.","",""},;
    {82,149,"исследование гематологическое","исслГематол.","",""},;
    {83,150,"исследование коагулогическое","исслКоагул.","",""},;
    {84,151,"исследование ИХЛ","исслИХЛ","",""},;
    {85,161,"исследование микробиологическое","исслМикробиол","",""},;
    {86,162,"исследование ПЦР","исслПЦР","",""},;
    {87,317,"посещение профилактическое по ДН","ДиспНаб.","",""};
  }

  Public glob_array_PZ_20 := {;
    { 1,330,"случай госпитализации ВМП 20-01","ВМП-01","к/д",""},;
    { 2,331,"случай госпитализации ВМП 20-02","ВМП-02","к/д",""},;
    { 3,332,"случай госпитализации ВМП 20-03","ВМП-03","к/д",""},;
    { 4,333,"случай госпитализации ВМП 20-04","ВМП-04","к/д",""},;
    { 5,334,"случай госпитализации ВМП 20-05","ВМП-05","к/д",""},;
    { 6,335,"случай госпитализации ВМП 20-06","ВМП-06","к/д",""},;
    { 7,336,"случай госпитализации ВМП 20-07","ВМП-07","к/д",""},;
    { 8,337,"случай госпитализации ВМП 20-08","ВМП-08","к/д",""},;
    { 9,338,"случай госпитализации ВМП 20-09","ВМП-09","к/д",""},;
    {10,339,"случай госпитализации ВМП 20-10","ВМП-10","к/д",""},;
    {11,340,"случай госпитализации ВМП 20-11","ВМП-11","к/д",""},;
    {12,341,"случай госпитализации ВМП 20-12","ВМП-12","к/д",""},;
    {13,342,"случай госпитализации ВМП 20-13","ВМП-13","к/д",""},;
    {14,343,"случай госпитализации ВМП 20-14","ВМП-14","к/д",""},;
    {15,344,"случай госпитализации ВМП 20-15","ВМП-15","к/д",""},;
    {16,345,"случай госпитализации ВМП 20-16","ВМП-16","к/д",""},;
    {17,346,"случай госпитализации ВМП 20-17","ВМП-17","к/д",""},;
    {18,347,"случай госпитализации ВМП 20-18","ВМП-18","к/д",""},;
    {19,348,"случай госпитализации ВМП 20-19","ВМП-19","к/д",""},;
    {20,349,"случай госпитализации ВМП 20-20","ВМП-20","к/д",""},;
    {21,350,"случай госпитализации ВМП 20-21","ВМП-21","к/д",""},;
    {22,351,"случай госпитализации ВМП 20-22","ВМП-22","к/д",""},;
    {23,352,"случай госпитализации ВМП 20-23","ВМП-23","к/д",""},;
    {24,353,"случай госпитализации ВМП 20-24","ВМП-24","к/д",""},;
    {25,354,"случай госпитализации ВМП 20-25","ВМП-25","к/д",""},;
    {26,355,"случай госпитализации ВМП 20-26","ВМП-26","к/д",""},;
    {27,356,"случай госпитализации ВМП 20-27","ВМП-27","к/д",""},;
    {28,357,"случай госпитализации ВМП 20-28","ВМП-28","к/д",""},;
    {29,358,"случай госпитализации ВМП 20-29","ВМП-29","к/д",""},;
    {30,359,"случай госпитализации ВМП 20-30","ВМП-30","к/д",""},;
    {31,360,"случай госпитализации ВМП 20-31","ВМП-31","к/д",""},;
    {32,361,"случай госпитализации ВМП 20-32","ВМП-32","к/д",""},;
    {33,362,"случай госпитализации ВМП 20-33","ВМП-33","к/д",""},;
    {34,363,"случай госпитализации ВМП 20-34","ВМП-34","к/д",""},;
    {35,364,"случай госпитализации ВМП 20-35","ВМП-35","к/д",""},;
    {36,365,"случай госпитализации ВМП 20-36","ВМП-36","к/д",""},;
    {37,366,"случай госпитализации ВМП 20-37","ВМП-37","к/д",""},;
    {38,367,"случай госпитализации ВМП 20-38","ВМП-38","к/д",""},;
    {39,368,"случай госпитализации ВМП 20-39","ВМП-39","к/д",""},;
    {40,369,"случай госпитализации ВМП 20-40","ВМП-40","к/д",""},;
    {41,370,"случай госпитализации ВМП 20-41","ВМП-41","к/д",""},;
    {42,371,"случай госпитализации ВМП 20-42","ВМП-42","к/д",""},;
    {43,372,"случай госпитализации ВМП 20-43","ВМП-43","к/д",""},;
    {44,373,"случай госпитализации ВМП 20-44","ВМП-44","к/д",""},;
    {45,374,"случай госпитализации ВМП 20-45","ВМП-45","к/д",""},;
    {46,375,"случай госпитализации ВМП 20-46","ВМП-46","к/д",""},;
    {47,376,"случай госпитализации ВМП 20-47","ВМП-47","к/д",""},;
    {48,377,"случай госпитализации ВМП 20-48","ВМП-48","к/д",""},;
    {49,378,"случай госпитализации ВМП 20-49","ВМП-49","к/д",""},;
    {50,379,"случай госпитализации ВМП 20-50","ВМП-50","к/д",""},;
    {51,380,"случай госпитализации ВМП 20-51","ВМП-51","к/д",""},;
    {52,381,"случай госпитализации ВМП 20-52","ВМП-52","к/д",""},;
    {53,382,"случай госпитализации ВМП 20-53","ВМП-53","к/д",""},;
    {54,383,"случай госпитализации ВМП 20-54","ВМП-54","к/д",""},;
    {55,384,"случай госпитализации ВМП 20-55","ВМП-55","к/д",""},;
    {56,385,"случай госпитализации ВМП 20-56","ВМП-56","к/д",""},;
    {57,386,"случай госпитализации ВМП 20-57","ВМП-57","к/д",""},;
    {60, 26,"вызов СМП","вызовСМП","",""},; //
    {61, 29,"случай госпитализации","случГоспит","к/д",""},; //
    {62,142,"случай госпитализации при реабилитации","случГоспРеаб","к/д",""},; //
    {63,205,"обращение для ЗПТ","обр.ЗПТ","",""},;
    {64,206,"резус-фактор плода","р/ф плода","",""},;  //   {65,141,"случай ЗПТ","случайЗПТ","",""},;
    {66,143,"случай лечения","случЛечения","п/д",""},;
    {67,259,"случай диализа","случДиализа","п/д",""},; //
    {68, 30,"посещение профилактическое","амбПрофил.","",""},;
    {69, 31,"посещение неотложное","амбНеотлож.","",""},;
    {70, 32,"обращение","амбОбращен.","",""},;
    {71, 38,"посещение профилактическое Центра здоровья","ПосПрофЦЗ","",""},; // {72,260,"комплексное посещение при диспансеризации","ПосДиспанс.","",""},; //
    {73,261,"комплексное посещение при ДВН 1 этап","ДВН 1","",""},; //
    {74,262,"комплексное посещение при ДВН 2 этап","ДВН 2","",""},; //
    {75,145,"посещение профилактическое в стоматологии","стомПроф.","",""},;
    {76,146,"посещение неотложное в стоматологии","стомНеотл.","",""},;
    {77,147,"обращение в стоматологии","стомОбращ.","",""},;
    {79,153,"пренатальный скрининг","ПренСкрининг","",""},;
    {80, 69,"жидкостная цитология","ЖидкЦитология","",""},;
    {81,148,"исследование биохимическое","исслБиохим.","",""},;
    {82,149,"исследование гематологическое","исслГематол.","",""},;
    {83,150,"исследование коагулогическое","исслКоагул.","",""},;
    {84,151,"исследование ИХЛ","исслИХЛ","",""},;
    {85,161,"исследование микробиологическое","исслМикробиол","",""},;
    {86,162,"исследование ПЦР","исслПЦР","",""},;  //  {87,317,"посещение профилактическое по ДН","ДиспНаб.","",""};
    {87,318,"комплексное посещение при ПОВН","ПОВН","",""},;
    {88,319,"комплексное посещение при ПОД","ПОД","",""},;
    {89,320,"комплексное посещение при ДДУ","ДДУ","",""},;
    {90,321,"комплексное посещение при ДДС","ДДС","",""},;
    {91,322,"обращение в ЦАОП","ЦАОПобращ","",""},;
    {92,323,"обращение для реабилитации","реабОбращ","",""},;
    {93,324,"КТ","КТ","",""},;
    {94,325,"МРТ","МРТ","",""},;
    {95,326,"УЗИ ССС","УЗИ ССС","",""},;
    {96,327,"эндоскопия","эндоскопия","",""},;
    {97,328,"гистология","гистология","",""},;
    {98,329,"МГИ","МГИ","",""},;
    {99,387,"исследование ИХГ","исследование ИХГ","",""};
  }
  
  Public glob_array_PZ_21 := {;
  { 1,389,"случай госпитализации ВМП 21-01","ВМП-01","к/д",""},;
  { 2,390,"случай госпитализации ВМП 21-02","ВМП-02","к/д",""},;
  { 3,391,"случай госпитализации ВМП 21-03","ВМП-03","к/д",""},;
  { 4,392,"случай госпитализации ВМП 21-04","ВМП-04","к/д",""},;
  { 5,393,"случай госпитализации ВМП 21-05","ВМП-05","к/д",""},;
  { 6,394,"случай госпитализации ВМП 21-06","ВМП-06","к/д",""},;
  { 7,395,"случай госпитализации ВМП 21-07","ВМП-07","к/д",""},;
  { 8,396,"случай госпитализации ВМП 21-08","ВМП-08","к/д",""},;
  { 9,397,"случай госпитализации ВМП 21-09","ВМП-09","к/д",""},;
  {10,398,"случай госпитализации ВМП 21-10","ВМП-10","к/д",""},;
  {11,399,"случай госпитализации ВМП 21-11","ВМП-11","к/д",""},;
  {12,400,"случай госпитализации ВМП 21-12","ВМП-12","к/д",""},;
  {13,401,"случай госпитализации ВМП 21-13","ВМП-13","к/д",""},;
  {14,402,"случай госпитализации ВМП 21-14","ВМП-14","к/д",""},;
  {15,403,"случай госпитализации ВМП 21-15","ВМП-15","к/д",""},;
  {16,404,"случай госпитализации ВМП 21-16","ВМП-16","к/д",""},;
  {17,405,"случай госпитализации ВМП 21-17","ВМП-17","к/д",""},;
  {18,406,"случай госпитализации ВМП 21-18","ВМП-18","к/д",""},;
  {19,407,"случай госпитализации ВМП 21-19","ВМП-19","к/д",""},;
  {20,408,"случай госпитализации ВМП 21-20","ВМП-20","к/д",""},;
  {21,409,"случай госпитализации ВМП 21-21","ВМП-21","к/д",""},;
  {22,410,"случай госпитализации ВМП 21-22","ВМП-22","к/д",""},;
  {23,411,"случай госпитализации ВМП 21-23","ВМП-23","к/д",""},;
  {24,412,"случай госпитализации ВМП 21-24","ВМП-24","к/д",""},;
  {25,413,"случай госпитализации ВМП 21-25","ВМП-25","к/д",""},;
  {26,414,"случай госпитализации ВМП 21-26","ВМП-26","к/д",""},;
  {27,415,"случай госпитализации ВМП 21-27","ВМП-27","к/д",""},;
  {28,416,"случай госпитализации ВМП 21-28","ВМП-28","к/д",""},;
  {29,417,"случай госпитализации ВМП 21-29","ВМП-29","к/д",""},;
  {30,418,"случай госпитализации ВМП 21-30","ВМП-30","к/д",""},;
  {31,419,"случай госпитализации ВМП 21-31","ВМП-31","к/д",""},;
  {32,420,"случай госпитализации ВМП 21-32","ВМП-32","к/д",""},;
  {33,421,"случай госпитализации ВМП 21-33","ВМП-33","к/д",""},;
  {34,422,"случай госпитализации ВМП 21-34","ВМП-34","к/д",""},;
  {35,423,"случай госпитализации ВМП 21-35","ВМП-35","к/д",""},;
  {36,424,"случай госпитализации ВМП 21-36","ВМП-36","к/д",""},;
  {37,425,"случай госпитализации ВМП 21-37","ВМП-37","к/д",""},;
  {38,426,"случай госпитализации ВМП 21-38","ВМП-38","к/д",""},;
  {39,427,"случай госпитализации ВМП 21-39","ВМП-39","к/д",""},;
  {40,428,"случай госпитализации ВМП 21-40","ВМП-40","к/д",""},;
  {41,429,"случай госпитализации ВМП 21-41","ВМП-41","к/д",""},;
  {42,430,"случай госпитализации ВМП 21-42","ВМП-42","к/д",""},;
  {43,431,"случай госпитализации ВМП 21-43","ВМП-43","к/д",""},;
  {44,432,"случай госпитализации ВМП 21-44","ВМП-44","к/д",""},;
  {45,433,"случай госпитализации ВМП 21-45","ВМП-45","к/д",""},;
  {46,434,"случай госпитализации ВМП 21-46","ВМП-46","к/д",""},;
  {47,435,"случай госпитализации ВМП 21-47","ВМП-47","к/д",""},;
  {48,436,"случай госпитализации ВМП 21-48","ВМП-48","к/д",""},;
  {49,437,"случай госпитализации ВМП 21-49","ВМП-49","к/д",""},;
  {50,438,"случай госпитализации ВМП 21-50","ВМП-50","к/д",""},;
  {51,439,"случай госпитализации ВМП 21-51","ВМП-51","к/д",""},;
  {52,440,"случай госпитализации ВМП 21-52","ВМП-52","к/д",""},;
  {53,441,"случай госпитализации ВМП 21-53","ВМП-53","к/д",""},;
  {54,442,"случай госпитализации ВМП 21-54","ВМП-54","к/д",""},;
  {55,443,"случай госпитализации ВМП 21-55","ВМП-55","к/д",""},;
  {56,444,"случай госпитализации ВМП 21-56","ВМП-56","к/д",""},;
  {57,445,"случай госпитализации ВМП 21-57","ВМП-57","к/д",""},;
  {58,446,"случай госпитализации ВМП 21-58","ВМП-58","к/д",""},;  // НОВЫЙ
  {60, 26,"вызов СМП","вызовСМП","",""},;                        // 1
  {61, 29,"случай госпитализации","случГоспит","к/д",""},;       // 1
  {62,142,"случай госпитализации при реабилитации","случГоспРеаб","к/д",""},; //1
  {63,205,"обращение для ЗПТ","обр.ЗПТ","",""},;   // 1
  {64,206,"резус-фактор плода","р/ф плода","",""},;  // 1   {65,141,"случай ЗПТ","случайЗПТ","",""},;
  {65,388,"исслелования на COVID-19","COVID-19","",""},;   //  НОВЫЙ
  {66,143,"случай лечения","случЛечения","п/д",""},;  // 1
  {67,259,"случай диализа","случДиализа","п/д",""},; //  1
  {68, 30,"посещение профилактическое","амбПрофил.","",""},;  // 1
  {69, 31,"посещение неотложное","амбНеотлож.","",""},;       // 1
  {70, 32,"обращение","амбОбращен.","",""},;                  // 1
  {71, 38,"посещение профилактическое Центра здоровья","ПосПрофЦЗ","",""},; //1 // {72,260,"комплексное посещение при диспансеризации","ПосДиспанс.","",""},; //
  {73,261,"комплексное посещение при ДВН 1 этап","ДВН 1","",""},; //  1
  {74,262,"комплексное посещение при ДВН 2 этап","ДВН 2","",""},; //  1
  {75,145,"посещение профилактическое в стоматологии","стомПроф.","",""},; // 1
  {76,146,"посещение неотложное в стоматологии","стомНеотл.","",""},;      // 1
  {77,147,"обращение в стоматологии","стомОбращ.","",""},;                 // 1 
  {79,153,"пренатальный скрининг","ПренСкрининг","",""},;                  // 1     
  {80, 69,"жидкостная цитология","ЖидкЦитология","",""},;                  // 1
  {81,148,"исследование биохимическое","исслБиохим.","",""},;              // 1
  {82,149,"исследование гематологическое","исслГематол.","",""},;          // 1
  {83,150,"исследование коагулогическое","исслКоагул.","",""},;            // 1
  {84,151,"исследование ИХЛ","исслИХЛ","",""},;                            // 1 
  {85,161,"исследование микробиологическое","исслМикробиол","",""},;       // 1
  {86,162,"исследование ПЦР","исслПЦР","",""},;  // 1 //  {87,317,"посещение профилактическое по ДН","ДиспНаб.","",""};
  {87,318,"комплексное посещение при ПОВН","ПОВН","",""},;   //  1
  {88,319,"комплексное посещение при ПОД","ПОД","",""},;     //  1
  {89,320,"комплексное посещение при ДДУ","ДДУ","",""},;     //  1
  {90,321,"комплексное посещение при ДДС","ДДС","",""},;     //  1   
  {91,322,"обращение в ЦАОП","ЦАОПобращ","",""},;            //  1
  {92,323,"обращение для реабилитации","реабОбращ","",""},;  //  1 
  {93,324,"КТ","КТ","",""},;                                 //  1
  {94,325,"МРТ","МРТ","",""},;                               //  1  
  {95,326,"УЗИ ССС","УЗИ ССС","",""},;                       //  1 
  {96,327,"эндоскопия","эндоскопия","",""},;                 //  1
  {97,328,"гистология","гистология","",""},;                 //  1
  {98,329,"МГИ","МГИ","",""},;                               //  1
  {99,387,"исследование ИХГ","исследование ИХГ","",""};      //  1  
  }
  G_Use(exe_dir+"_mo1unit",cur_dir+"_mo1unit","UNIT")
  for i := 1 to len(glob_array_PZ_21)
    find (str(glob_array_PZ_21[i,2],3))
    if found() .and. !(unit->pz == glob_array_PZ_21[i,1] .and. unit->ii == i)
      G_RLock(forever)
      unit->pz := glob_array_PZ_21[i,1]
      unit->ii := i
    endif
  next
  unit->(dbCloseArea())
  /*
  G_Use(exe_dir+"_mo0unit",cur_dir+"_mo0unit","UNIT")
  for i := 1 to len(glob_array_PZ_20)
    find (str(glob_array_PZ_20[i,2],3))
    if found() .and. !(unit->pz == glob_array_PZ_20[i,1] .and. unit->ii == i)
      G_RLock(forever)
      unit->pz := glob_array_PZ_20[i,1]
      unit->ii := i
    endif
  next
  unit->(dbCloseArea())*/
  return NIL
  