#include 'inkey.ch'
#include 'function.ch'
#include 'edit_spr.ch'
#include 'chip_mo.ch'



// 27.01.18 инициализация программы
Function init_program_old_func()

/*
  // диспансеризация взрослого населения 2013 год
  Public dvn_arr_usl13 := { ; // Услуги на экран для ввода
  { 'Измерение внутриглазного давления', '3.4.9', 1, 0, 1, ;
    { 39, 42, 45, 48, 51, 54, 57, 60, 63, 66, 69, 72, 75, 78, 81, 84, 87, 90, 93, 96, 99 }, ;
    { 39, 42, 45, 48, 51, 54, 57, 60, 63, 66, 69, 72, 75, 78, 81, 84, 87, 90, 93, 96, 99 }, ;
    1, 1, 65, { 1112 };
  }, ;
  { 'Исследование крови на общий холестерин', '4.12.174', { 1, 3 }, 0, 1, ;
    { 21, 24, 27, 30, 33, 36, 42, 48, 54, 60, 66, 72, 78, 84, 90, 96 }, ;
    { 21, 24, 27, 30, 33, 36, 42, 48, 54, 60, 66, 72, 78, 84, 90, 96 }, ;
    1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
  }, ;
  { 'Исследование уровня глюкозы в крови', '4.12.169', { 1, 3 }, 0, 1, ;
    { 21, 24, 27, 30, 33, 36, 42, 48, 54, 60, 66, 72, 78, 84, 90, 96 }, ;
    { 21, 24, 27, 30, 33, 36, 42, 48, 54, 60, 66, 72, 78, 84, 90, 96 }, ;
    1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
  }, ;
  { 'Клинический анализ мочи', '4.2.153', 1, 0, 1, ;
    1, 1, 1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
  }, ;
  { 'Клинический анализ крови (3 показателя)', '4.11.137', { 1, 3 }, 0, 1, ;
    { 21, 24, 27, 30, 33, 36, 42, 48, 54, 60, 66, 72, 78, 84, 90, 96 }, ;
    { 21, 24, 27, 30, 33, 36, 42, 48, 54, 60, 66, 72, 78, 84, 90, 96 }, ;
    1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
  }, ;
  { 'Клинический анализ крови (развёрнутый)', '4.11.136', 1, 0, 1, ;
    { 39, 45, 51, 57, 63, 69, 75, 81, 87, 93, 99 }, ;
    { 39, 45, 51, 57, 63, 69, 75, 81, 87, 93, 99 }, ;
    1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
  }, ;
  { 'Биохимический общетерапевтическ.анализ крови', '4.12.172', 1, 0, 1, ;
    { 39, 45, 51, 57, 63, 69, 75, 81, 87, 93, 99 }, ;
    { 39, 45, 51, 57, 63, 69, 75, 81, 87, 93, 99 }, ;
    1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
  }, ;
  { 'Кровь на простат-специфический антиген', '4.14.66', 1, 0, 1, ;
    { 51, 54, 57, 60, 63, 66, 69, 72, 75, 78, 81, 84, 87, 90, 93, 96, 99 }, ;
    0, ;
    1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
  }, ;
  { 'Исследование кала на скрытую кровь', '4.8.4', { 1, 3 }, 0, 1, ;
    { 45, 48, 51, 54, 57, 60, 63, 66, 69, 72, 75, 78, 81, 84, 87, 90, 93, 96, 99 }, ;
    { 45, 48, 51, 54, 57, 60, 63, 66, 69, 72, 75, 78, 81, 84, 87, 90, 93, 96, 99 }, ;
    { 46, 98 }, { 46, 98 }, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
  }, ;
  { 'Иссл-е взятого цитологического материала', '4.20.1', 1, 0, 1, ;
    0, 1, 1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
  }, ;
  { 'Маммография', '7.57.3', { 1, 3 }, 0, 1, ;
    0, ;
    { 39, 42, 45, 48, 51, 54, 57, 60, 63, 66, 69, 72, 75, 78, 81, 84, 87, 90, 93, 96, 99 }, ;
    0, { 40, 98 }, 78, { 1118, 1802, 2020 };
  }, ;
  { 'Флюорография лёгких', '7.61.3', { 1, 3 }, 0, 1, ;
    1, 1, 1, 1, 78, { 1118, 1802, 2020 };
  }, ;
  { 'УЗИ органов брюшной полости', '8.2.1', 1, 0, 1, ;
    { 39, 45, 51, 57, 63, 69, 75, 81, 87, 93, 99 }, ;
    { 39, 45, 51, 57, 63, 69, 75, 81, 87, 93, 99 }, ;
    1, 1, 106, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 };
  }, ;
  { 'Электрокардиография', '13.1.1', 1, 0, 1, ;
    -36, ; // для мужчин обязательно с 36 лет
    -45, ; // для женщин обязательно с 45 лет
    1, 1, 111, { 110103, 110303, 110906, 111006, 111905, 112212, 112611, 113418, 113509, 180202, 2021 };
  }, ;
  { 'Определение гликированного гемоглобина крови', '4.12.170', 2, 0, 1, ; // "2.84.2"
    1, 1, 1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
  }, ;
  { 'Тест на толерантность к глюкозе', '4.12.171', 2, 0, 1, ; // "2.84.2"
    1, 1, 1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
  }, ;
  { 'Исследование липидного спектра крови', '4.12.173', 2, 0, 1, ; // "2.84.2"
    1, 1, 1, 1, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 };
  }, ;
  { 'Дуплексное сканир-ие брахиоцефальных артерий', '8.23.6', 2, 0, 1, ; // "2.84.1"
    1, 1, 1, 1, 106, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 };
  }, ;
  { 'Фиброэзофагогастродуоденоскопия', '10.3.13', 2, 0, 1, ; // "2.84.2"
    1, 1, 1, 1, 123, { 110104, 111007, 112221, 112609, 113419, 113511 };
  }, ;
  { 'Ректоскопия диагностическая', '10.4.1', 2, 0, 1, ; // "2.84.6"
    1, 1, 1, 1, 123, { 110104, 111007, 112221, 112609, 113419, 113511 };
  }, ;
  { 'Ректосигмоколоноскопия диагностическая', '10.6.10', 2, 0, 1, ; // "2.84.6"
    1, 1, 1, 1, 123, { 110104, 111007, 112221, 112609, 113419, 113511 };
  }, ;
  { 'Приём врача невролога', { '2.3.1', '2.84.1' }, { 1, 2 }, 1, 0, ;
    { 51, 57, 63, 69, 75, 81, 87, 93, 99 }, ;
    { 51, 57, 63, 69, 75, 81, 87, 93, 99 }, ;
    1, 1, 53, { 1109 }, ;
    { { '2.3.1', 53 }, { '2.84.1', 53 } };
  }, ;
  { 'Приём врача офтальмолога', '2.84.3', 2, 1, 0, ;
    1, 1, 1, 1, 65, { 1112 };
  }, ;
  { 'Приём врача уролога (хирурга)', '2.84.4', 2, 1, 0, ;
    1, 1, 1, 0, { 108, 112 }, { 112603, 1126 };
  }, ;
  { 'Приём врача акушера-гинеколога', '2.84.5', 2, 1, 0, ;
    1, 1, 0, 1, 136, { 1101 };
  }, ;
  { 'Приём врача колопроктолога (хирурга)', '2.84.6', 2, 1, 0, ;
    1, 1, 1, 1, { 30, 30, 112 }, { 112601, 113503, 1126 };
  }, ;
  { 'Приём врача терапевта', { '2.3.1', '2.84.2', '2.3.1' }, { 1, 2, 3 }, 1, 0, ;
    1, 1, 1, 1, { 97, 57, 42 }, { 1122, 1110, 2002 }, ;
    { { '2.3.1', 97 }, { '2.3.2', 57 }, { '2.84.2', 97 }, { '2.84.2', 57 }, { '2.84.7', 97 }, { '2.84.7', 57 }, { '2.3.3', 42 } };
  };
  }

  Public count_dvn_arr_usl13 := Len( dvn_arr_usl13 )

  //
  Public dvn_2_etap13 := { ; // обязательное сочетание услуг второго этапа
    { '2.84.1', { '8.23.6' } }, ;
    { '2.84.2', { '4.12.170', '4.12.171', '4.12.173', '10.3.13' } }, ;
    { '2.84.6', { '10.4.1', '10.6.10' } } ;
  }
  //
  Public dvn_arr_umolch13 := { ; // услуги, записываемые всегда по умолчанию
    { 'Опрос (анкетирование)', '56.1.16', { 1, 3 }, 1, 1, 1, 1, 0 }, ;
    { 'Измерение артериального давления', '3.1.5', { 1, 3 }, 1, 1, 1, 1, 0 }, ;
    { 'Антропометрия', '3.1.19', { 1, 3 }, 1, 1, 1, 1, 0 }, ;
    { 'Определение группы состояния здоровья,...', '56.1.13', { 1, 2, 3 }, 1, 1, 1, 1, 1 }, ;
    { 'Краткое профилактическое консультирование', '56.1.14', { 1, 3 }, 1, 1, 1, 1, 1 }, ;
    { 'Развернутое профилактическое консультирование', '56.1.15', 2, 1, 1, 1, 1, 1 }, ;
    { 'Определение суммарного сердечно-сосудистого риска', '56.1.17', { 1, 3 }, ;
      { 21, 24, 27, 30, 33, 36, 39, 42, 45, 48, 51, 54, 57, 60, 63 }, ;
      { 21, 24, 27, 30, 33, 36, 39, 42, 45, 48, 51, 54, 57, 60, 63 }, ;
      { 18, 65 }, { 18, 65 }, 1;
    };
  }

  Public count_dvn_arr_umolch13 := Len( dvn_arr_umolch13 )
  //
  Public dvn_85_13 := { ; // кол-во услуг, составляющих 85%
    { 9, 8 }, { 10, 9 }, { 11, 10 }, { 12, 11 }, { 13, 11 }, { 14, 12 }, { 15, 13 }, { 16, 14 };
  }
  Public count_predn_arr_osm := Len( npred_arr_osmotr )
  Public npred_arr_issled := { ;
    { "4.2.153",   , "Общий анализ мочи", 0, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 } }, ;
    { "4.11.136",   , "Клинический анализ крови", 0, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 } }, ;
    { "4.12.169",   , "Иссл-ние уровня глюкозы в крови", 0, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 } }, ;
    { "4.8.12",   , "Анализ кала на яйца глистов", 0, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 } }, ;
    { "7.61.3",   , "Флюорография легких в 1-й проекции", 0, 78, { 1118, 1802, 2020 } }, ;
    { "8.1.2",   , "УЗИ щитовидной железы", 0, 106, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 } }, ;
    { "8.1.3",   , "УЗИ сердца", 0, 106, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 } }, ;
    { "8.2.1",   , "УЗИ органов брюшной полости", 0, 106, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 } }, ;
    { "8.2.2","М", "УЗИ органов репродуктивной системы", 0, 106, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 } }, ;
    { "8.2.3","Ж", "УЗИ органов репродуктивной системы", 0, 106, { 110101, 111004, 111802, 111903, 112211, 112610, 113416, 113508, 180203 } }, ;
    { "13.1.1",   , "Электрокардиография", 0, 111, { 110103, 110303, 110906, 111006, 111905, 112212, 112611, 113418, 113509, 180202, 2021 } }, ;
    { "56.1.13",   , "Определение группы состояния здоровья,...", 2, 0, { 1, 2 } };
  }
  Public count_npred_arr_issled := Len( npred_arr_issled )
  Public npred_arr_1_etap := {}
  // 1-номер периода
  // 2-начальный возраст
  // 3-конечный возраст
  // 4-осмотры
  // 5-исследования {шифр,N} при N=0 - обязательно, при N=1 - необязательно
  // 6-наименование периода
  AAdd( npred_arr_1_etap, { 1, 0, 17, ;
    { "2.86.16", "2.86.17", "2.86.18", "2.86.20", "2.86.21", "2.86.22", "2.86.23", "2.4.1" }, ;
    { "4.2.153", "4.11.136", "4.12.169", "4.8.12" }, ;
    "ДОУ" } )
  AAdd( npred_arr_1_etap, { 0, 0, 17, ;
    { "2.86.16", "2.86.17", "2.86.18", "2.86.19", "2.86.20", "2.86.21", "2.86.22", "2.86.23", "2.4.1" }, ;
    { "4.2.153", "4.11.136", "4.12.169", "4.8.12", "8.1.2", "8.1.3", "8.2.1", "8.2.2", "8.2.3", "13.1.1" }, ;
    "ООУ" } )
  AAdd( npred_arr_1_etap, { 2, 0, 14, ;
    { "2.86.16", "2.86.17", "2.86.18", "2.86.19", "2.86.20", "2.86.21", "2.86.22", "2.86.23", "2.86.24", "2.4.1" }, ;
    { "4.2.153", "4.11.136", "4.12.169", "8.1.2", "8.1.3", "8.2.1", "8.2.2", "8.2.3", "13.1.1" }, ;
    "ОУ НПО, ВПО, СОУ,...0-14 лет" } )
  AAdd( npred_arr_1_etap, { 2, 15, 17, ;
    { "2.86.16", "2.86.17", "2.86.18", "2.86.19", "2.86.20", "2.86.21", "2.86.22", "2.86.23", "2.86.24", "2.4.1" }, ;
    { "4.2.153", "4.11.136", "4.12.169", "8.1.2", "8.1.3", "8.2.1", "8.2.2", "8.2.3", "13.1.1", "7.61.3" }, ;
    "ОУ НПО, ВПО, СОУ,...15-17 лет" } )
  // периодические осмотры несовершеннолетних
  // "2.3.1"  педиатр 68, {1134}
  // "2.3.2"  врач общей практики 57, {1110}
  Public nper_arr_issled := { ;
    { "4.2.153",   , "Общий анализ мочи", 0, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 } }, ;
    { "4.11.136",   , "Клинический анализ крови", 0, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 } }, ;
    { "16.1.16",   , "Анализ окиси углерода выдыхаем.воздуха", 0, 34, { 1107, 1301, 1402, 1702, 1801, 2011, 2013 } };
  }
  Public count_nper_arr_issled := Len( nper_arr_issled() )
  Public nper_arr_1_etap := {}
  // 1-номер периода
  // 2-начальный возраст
  // 3-конечный возраст
  // 4-осмотры
  // 5-исследования {шифр,N} при N=0 - обязательно, при N=1 - необязательно
  // 6-наименование периода
  AAdd( nper_arr_1_etap, { 1, 0, 17, ;
    {}, ;
    { "4.2.153", "4.11.136" }, ;
    "ДОУ" } )
  AAdd( nper_arr_1_etap, { 0, 0, 17, ;
    {}, ;
    { "4.2.153", "4.11.136", "16.1.16" }, ;
    "ООУ и ОУ НПО, ВПО, СОУ" } )
  Return Nil
*/

// 18.05.15
Function is_usluga_dvn13(ausl, _vozrast, arr, _etap, _pol, _spec_ter)
  
  // ausl := {lshifr,mdate,hu_->profil,hu_->PRVS}
  Local i, j, s, fl := .f., as, lshifr := alltrim(ausl[1])

  if ((lshifr == '2.3.3' .and. ausl[3] == 3) .or. ; // акушерскому делу
        (lshifr == '2.3.1' .and. ausl[3] == 136))   // акушерству и гинекологии
        //.and. (i := ascan(dvn_arr_usl, {|x| valtype(x[2])=="C" .and. x[2]=="4.20.1"})) > 0
    if ((lshifr == '2.3.3' .and. eq_any(ret_old_prvs(ausl[4]), 2003, 2002)) .or. ;
          (lshifr == '2.3.1' .and. ret_old_prvs(ausl[4]) == 1101))
    else
      aadd(arr, 'Не та специальность врача в случае невозможности использования услуги:')
      aadd(arr, ' "4.1.12.Осмотр акушеркой, взятие мазка (соскоба)"')
    endif
    fl := .t.
  endif
  if !fl
    for i := 1 to Len( dvn_arr_umolch13() )
      if dvn_arr_umolch13()[i, 2] == lshifr
        fl := .t.
        exit
      endif
    next
  endif
  if !fl
    DEFAULT _spec_ter to 0
    for i := 1 to count_dvn_arr_usl13
      if len(dvn_arr_usl13[i]) < 12 .and. valtype(dvn_arr_usl13[i, 2]) == 'C'
        if dvn_arr_usl13[i, 2] == '4.20.1' .and. lshifr == '4.20.2'
          fl := .t.
        elseif dvn_arr_usl13[i, 2] == lshifr
          fl := .t.
        endif
      elseif len(dvn_arr_usl13[i]) > 11
        if ascan(dvn_arr_usl13[i, 12], {|x| x[1] == lshifr .and. x[2] == ausl[3]}) > 0
          fl := .t.
        endif
      endif
      if fl
        s := '"' + lshifr + '.' + dvn_arr_usl13[i, 1] + '"'
        if _etap == 1
          j := iif(_pol == 'М', 6, 7)
          if valtype(dvn_arr_usl13[i, j]) == 'N'
            if dvn_arr_usl13[i, j] == 0
              aadd(arr, 'Несовместимость по полу в услуге ' + s)
            endif
          else
            if ascan(dvn_arr_usl13[i, j], _vozrast) == 0
              aadd(arr, 'Некорректный возраст пациента для услуги ' + s)
            endif
          endif
        else
          j := iif(_pol == 'М', 8, 9)
          if valtype(dvn_arr_usl13[i, j]) == 'N'
            if dvn_arr_usl13[i, j] == 0
              aadd(arr, 'Несовместимость по полу в услуге ' + s)
            endif
          else
            if !between(_vozrast, dvn_arr_usl13[i, j, 1], dvn_arr_usl13[i, j, 2])
              aadd(arr, 'Некорректный возраст пациента для услуги ' + s)
            endif
          endif
        endif
        if valtype(dvn_arr_usl13[i, 10]) == 'N'
          if ret_profil_dispans(dvn_arr_usl13[i, 10], ausl[4]) != ausl[3]
          //if dvn_arr_usl13[i, 10] != ausl[3]
            aadd(arr, 'Не тот профиль в услуге ' + s)
          endif
        else
          if ascan(dvn_arr_usl13[i, 10], ausl[3]) == 0
            aadd(arr, 'Не тот профиль в услуге ' + s)
          endif
        endif
        as := aclone(dvn_arr_usl13[i, 11])
        // "Измерение внутриглазного давления","3.4.9"
        if _etap == 1 .and. as[1] == 1112 .and. _spec_ter > 0
          aadd(as, _spec_ter) // добавить спец-ть терапевта
        endif
        /*if ascan(as,ausl[4]) == 0
          aadd(arr,'Не та специальность врача в услуге ' + s)
          aadd(arr,' у Вас: '+lstr(ausl[4])+', разрешено: '+print_array(as))
        endif*/
        exit
      endif
    next
  endif
  return fl

