#include 'common.ch'
#include 'inkey.ch'
#include 'function.ch'
#include 'edit_spr.ch'
#include 'chip_mo.ch'

// 28.02.24
Function defenition_usluga_med_reab( lkod, vid, shrm, vto )

  Local lshifr, lrec, lu_kod, lcena, lyear, mrec_hu
  Local buf := save_maxrow()
  Local shifr_reab

  shifr_reab := type_reabilitacia( vto )[ vid, 3 ][ shrm ]

  mywait( 'Добавление услуги' )
  r_use( dir_server() + 'mo_uch', , 'UCH' )
  r_use( dir_server() + 'mo_otd', , 'OTD' )
  use_base( 'lusl' )
  use_base( 'luslc' )
  use_base( 'uslugi' )
  r_use( dir_server() + 'uslugi1', { dir_server() + 'uslugi1', ;
    dir_server() + 'uslugi1s' }, 'USL1' )
  use_base( 'human_u' ) // если понадобится, удалить старую услугу и добавить новую
  r_use( dir_server() + 'mo_su', , 'MOSU' )
  r_use( dir_server() + 'mo_hu', dir_server() + 'mo_hu', 'MOHU' )
  Set Relation To FIELD->u_kod into MOSU
  g_use( dir_server() + 'human_2', , 'HUMAN_2' )
  r_use( dir_server() + 'human_', , 'HUMAN_' )
  g_use( dir_server() + 'human', , 'HUMAN' ) // перезаписать сумму
  Set Relation To RecNo() into HUMAN_, To RecNo() into HUMAN_2
  HUMAN->( dbGoto( lkod ) )
  lyear := Year( human->K_DATA )

  lrec := lcena := 0
  dbSelectArea( 'HU' )
  find ( Str( lkod, 7 ) )
  Do While hu->kod == lkod .and. !Eof()
    usl->( dbGoto( hu->u_kod ) )
    If Empty( lshifr := opr_shifr_tfoms( usl->shifr1, usl->kod, human->k_data ) )
      lshifr := usl->shifr
    Endif
    If !Empty( shifr_reab ) .and. AllTrim( lshifr ) == shifr_reab // уже стоит та же услуга
      lcena := iif( m1vzros_reb == 0, usl->CENA, usl->CENAD )
      If !( Round( hu->u_cena, 2 ) == Round( lcena, 2 ) ) // перезапишем цену
        dbSelectArea( 'HU' )
        g_rlock( forever )
        hu->u_cena := lcena
        hu->stoim := hu->stoim_1 := lcena
        Unlock
      Endif
      Exit
    Endif
    If lyear > 2021
      dbSelectArea( 'LUSL' )
      find ( lshifr ) // длина lshifr 10 знаков
      If Found() .and. ( eq_any( Left( lshifr, 5 ), '2.89.' ) ) // стоит другая услуга реабилитации
        lrec := hu->( RecNo() )
        Exit
      Endif
    Endif
    HU->( dbSkip() )
    // dbSelectArea('HU')
    // skip
  Enddo
  If Empty( lcena )
    lu_kod := foundourusluga( shifr_reab, human->k_data, human_->profil, human->VZROS_REB, @lcena )
    lcena := round_5( lcena, 0 )
    If ! Empty( lcena )
      // // if round(arr[4],2) == round(lcena,2) // цена определена правильно
      dbSelectArea( 'HU' )
      If lrec == 0
        add1rec( 7 )
        hu->kod := human->kod
      Else
        HU->( dbGoto( lrec ) )
        g_rlock( forever )
      Endif
      mrec_hu := hu->( RecNo() )
      hu->kod_vr  := human_->VRACH
      hu->kod_as  := 0
      hu->u_koef  := 1
      hu->u_kod   := lu_kod
      hu->u_cena  := lcena
      hu->is_edit := 0
      hu->date_u  := dtoc4( human->n_data )
      hu->otd     := human->otd
      hu->kol     := hu->kol_1 := 1
      hu->stoim   := hu->stoim_1 := lcena
      dbSelectArea( 'HU_' )
      Do While hu_->( LastRec() ) < mrec_hu
        hu_->( dbAppend() )
      Enddo
      HU_->( dbGoto( mrec_hu ) )
      g_rlock( forever )
      If lrec == 0 .or. !valid_guid( hu_->ID_U )
        hu_->ID_U := mo_guid( 3, hu_->( RecNo() ) )
      Endif
      hu_->PROFIL := human_->PROFIL
      hu_->PRVS   := human_->PRVS
      hu_->kod_diag := human->KOD_DIAG
    Else
      func_error( 4, 'ОШИБКА: для организации услуга ' + AllTrim( shifr_reab ) + ' не установлена!' )
      lcena := 0
    Endif
  Endif
  If !( Round( human->CENA_1, 2 ) == Round( lcena, 2 ) )
    dbSelectArea( 'HUMAN' )
    g_rlock( forever )
    human->CENA := human->CENA_1 := lcena // перезапишем стоимость лечения
    HUMAN->( dbUnlock() ) // UnLock
  Endif

  // return { ars, arerr, alltrim(lksg), lcena, akslp, akiro, s_dializ }

  Close databases
  rest_box( buf )

  Return Nil

// 28.02.24
Function type_reabilitacia( vto )

  local ret := {}

  If Len( ret ) == 0
    AAdd( ret, { 'заболевания опорно-двигательного аппарата', 1, { '2.89.27', '2.89.28', '2.89.29' } } )
    AAdd( ret, { 'сердечно-сосудистая потология', 2, { '2.89.30', '2.89.31', '2.89.32' } } )
    AAdd( ret, { 'заболевания центральной нервной системы', 3, { '2.89.33', '2.89.34', '2.89.35' } } )
    AAdd( ret, { 'заболевания периферической нервной системы', 4, { '2.89.36', '2.89.37', '2.89.38' } } )
    AAdd( ret, { 'лечении органов дыхания, после COVID-19', 5, { '2.89.39', '2.89.40', '2.89.41' } } )
    AAdd( ret, { 'лечении органов дыхания', 6, { '2.89.45', '2.89.46', '2.89.47' } } )
    AAdd( ret, { 'онкологическое лечение', 7, { '2.89.48', '2.89.49', '2.89.50' } } )
    // aadd(ret, {'лечении органов дыхания, после COVID-19, телемедицина', 8, {'2.89.42', '2.89.43', '2.89.44'}})
    if vto == CHIP_YES // использование высокотехнологического оборудования
      ret[ 1, 3 ] := { '', '2.89.51', '2.89.52' }
      ret[ 2, 3 ] := { '', '2.89.53', '2.89.54' }
      ret[ 3, 3 ] := { '', '2.89.55', '2.89.56' }
      ret[ 4, 3 ] := { '', '2.89.57', '2.89.58' }
      ret[ 5, 3 ] := { '', '2.89.59', '2.89.60' }
      ret[ 6, 3 ] := { '', '2.89.61', '2.89.62' }
      // AAdd( ret[ 1, 3 ], { '', '2.89.51', '2.89.52' } )
      // AAdd( ret[ 2, 3 ], { '', '2.89.53', '2.89.54' } )
      // AAdd( ret[ 3, 3 ], { '', '2.89.55', '2.89.56' } )
      // AAdd( ret[ 4, 3 ], { '', '2.89.57', '2.89.58' } )
      // AAdd( ret[ 5, 3 ], { '', '2.89.59', '2.89.60' } )
      // AAdd( ret[ 6, 3 ], { '', '2.89.61', '2.89.62' } )
    endif
  Endif

  Return ret

// 28.02.24
Function type_shrm_reabilitacia( vto )

  local ret := {}

  if vto == CHIP_NO // не используется высокотехнологичное оборудование
    AAdd( ret, { 'ШРМ 1', 1 } )
  endif
  AAdd( ret, { 'ШРМ 2', 2 } )
  AAdd( ret, { 'ШРМ 3', 3 } )

  Return ret

// 28.02.24
Function ret_array_med_reab( vid, shrm, adult, vto )

  // услуга
  // далее для трех ШРМ:
    // adult .t. - взрослый, .f. другое
    // среднее колво применений
  Static arr_uslugi_med_reab := { ;
    { ;   // заболевания опорно-двигательного аппарата
    { '2.6.15', .t., 1, .t., 1, .t., 1 }, ;
    { '2.6.13', .f., 1, .f., 1, .f., 1 }, ;
    { '2.6.16', .t., 1, .t., 2, .t., 2 }, ;
    { '2.6.17', .f., 1, .f., 1, .f., 1 }, ;
    { '2.6.14', .f., 1, .f., 1, .f., 1 }, ;
    { '2.6.19', .f., 1, .f., 1, .f., 1 }, ;
    { '2.6.5',   .t., 1, .t., 1, .t., 1 }, ;
    { '2.6.6',   .f., 1, .f., 1, .t., 2 }, ;
    { '2.6.7',   .t., 1, .t., 1, .t., 1 }, ;
    { '2.6.8',   .f., 1, .f., 2, .t., 1 }, ;
    { '3.4.31', .f., 1, .f., 1, .f., 1 }, ;
    { '4.11.136', .t., 1, .t., 1, .t., 1 }, ;
    { '4.2.153', .t., 1, .t., 1, .t., 1 }, ;
    { '13.1.1', .t., 1, .t., 1, .t., 1 }, ;
    { '14.2.3', .f., 1, .f., 1, .f., 1 }, ;
    { '7.12.5', .f., 1, .f., 1, .f., 1 }, ;
    { '7.12.6', .f., 1, .f., 1, .f., 1 }, ;
    { '7.2.2',  .f., 1, .f., 1, .f., 1 }, ;
    { '20.1.2', .t., 9, .t., 11, .t., 13 }, ;
    { '20.2.1', .f., 9, .f., 11, .f., 13 }, ;
    { '21.1.2', .f., 9, .f., 9, .f., 11 }, ;
    { '19.1.2', .f., 9, .f., 10, .f., 10 }, ;
    { '19.1.5', .f., 9, .f., 9, .f., 11 }, ;
    { '19.1.36', .f., 9, .f., 9, .f., 11 }, ;
    { '19.1.30', .f., 9, .f., 9, .f., 11 }, ;
    { '19.1.29', .f., 9, .f., 9, .f., 11 }, ;
    { '19.1.33', .f., 9, .f., 9, .f., 11 }, ;
    { '19.1.34', .f., 9, .f., 9, .f., 11 }, ;
    { '19.1.35', .f., 9, .f., 9, .f., 11 }, ;
    { '19.1.9', .f., 9, .f., 9, .f., 11 }, ;
    { '19.7.1', .f., 9, .f., 10, .f., 10 }, ;
    { '19.1.7', .f., 9, .f., 10, .f., 10 }, ;
    { '19.1.6', .f., 9, .f., 10, .f., 10 }, ;
    { '19.1.37', .f., 9, .f., 10, .f., 10 }, ;
    { '19.3.1', .f., 9, .f., 10, .f., 10 }, ;
    { '20.2.4', .f., 9, .f., 9, .f., 11 }, ;
    { '22.1.2', .f., 9, .f., 9, .f., 11 }, ;
    { '19.1.38', .f., 9, .f., 9, .f., 11 }, ;
    { '19.6.1', .f., 9, .f., 9, .f., 11 }, ;
    { '19.2.2', .f., 5, .f., 9, .f., 11 }, ;
    { '19.2.5', .f., 7, .f., 9, .f., 11 }, ;
    { '19.6.2', .f., 7, .f., 9, .f., 11 }, ;
    { '19.1.32', .f., 7, .f., 9, .f., 11 } ;
    }, ;
    { ;     // ССС
    { '2.6.17', .t., 1, .t., 1, .t., 1 }, ;
    { '2.6.18', .t., 1, .t., 1, .t., 1 }, ;
    { '2.6.5',   .t., 1, .t., 1, .t., 1 }, ;
    { '2.6.6',   .f., 1, .t., 1, .t., 2 }, ;
    { '2.6.7',   .t., 1, .t., 1, .t., 1 }, ;
    { '2.6.8',   .f., 1, .t., 1, .t., 2 }, ;
    { '2.6.19', .t., 1, .t., 1, .t., 1 }, ;
    { '2.6.20', .t., 1, .t., 1, .t., 1 }, ;
    { '4.11.136', .t., 1, .t., 1, .t., 1 }, ;
    { '4.2.153', .t., 1, .t., 1, .t., 1 }, ;
    { '13.1.1', .t., 1, .t., 2, .t., 3 }, ;
    { '3.4.31', .f., 1, .f., 1, .f., 1 }, ;
    { '20.1.3', .f., 9, .f., 11, .f., 13 }, ;
    { '21.1.3', .f., 9, .f., 11, .f., 13 }, ;
    { '19.1.2', .f., 9, .f., 11, .f., 11 }, ;
    { '19.1.5', .f., 9, .f., 9, .f., 11 }, ;
    { '19.1.7', .f., 9, .f., 9, .f., 11 }, ;
    { '19.5.19', .f., 9, .f., 10, .f., 11 }, ;
    { '19.1.30', .f., 9, .f., 10, .f., 11 }, ;
    { '19.3.1', .f., 9, .f., 10, .f., 11 }, ;
    { '19.7.1', .f., 9, .f., 10, .f., 11 }, ;
    { '20.2.2', .f., 9, .f., 11, .f., 13 }, ;
    { '22.1.3', .f., 9, .f., 9, .f., 11 }, ;
    { '19.1.6', .f., 9, .f., 9, .f., 11 } ;
    }, ;
    { ;     // заболевания центральной нервной системы
    { '2.6.13', .t., 1, .t., 1, .t., 1 }, ;
    { '2.6.17', .f., 1, .f., 1, .f., 1 }, ;
    { '2.6.18', .f., 1, .f., 1, .f., 1 }, ;
    { '2.6.14', .t., 1, .t., 2, .t., 2 }, ;
    { '2.6.5', .t., 1, .t., 1, .t., 1 }, ;
    { '2.6.6', .f., 1, .f., 2, .t., 2 }, ;
    { '2.6.7', .t., 1, .t., 1, .t., 1 }, ;
    { '2.6.8', .f., 1, .t., 1, .t., 2 }, ;
    { '2.6.19', .f., 1, .f., 1, .f., 1 }, ;
    { '2.6.20', .f., 1, .f., 1, .f., 1 }, ;
    { '4.11.136', .t., 1, .t., 1, .t., 1 }, ;
    { '4.2.153', .t., 1, .t., 1, .t., 1 }, ;
    { '13.1.1', .t., 1, .t., 1, .t., 1 }, ;
    { '3.4.31', .f., 1, .f., 1, .f., 1 }, ;
    { '14.2.3', .f., 1, .f., 1, .f., 1 }, ;
    { '7.12.7', .f., 1, .f., 1, .f., 1 }, ;
    { '7.2.2', .f., 1, .f., 1, .f., 1 }, ;
    { '20.1.1', .t., 9, .t., 11, .t., 13 }, ;
    { '20.2.1', .f., 6, .f., 11, .f., 13 }, ;
    { '21.1.1', .f., 7, .f., 9, .f., 13 }, ;
    { '19.1.2', .f., 7, .f., 10, .f., 11 }, ;
    { '19.1.5', .f., 7, .f., 9, .f., 11 }, ;
    { '19.1.36', .f., 7, .f., 9, .f., 11 }, ;
    { '19.1.30', .f., 7, .f., 9, .f., 11 }, ;
    { '19.1.29', .f., 7, .f., 9, .f., 11 }, ;
    { '19.1.33', .f., 7, .f., 9, .f., 11 }, ;
    { '19.1.34', .f., 7, .f., 9, .f., 11 }, ;
    { '19.1.35', .f., 7, .f., 9, .f., 11 }, ;
    { '19.1.9', .f., 7, .f., 9, .f., 11 }, ;
    { '19.7.1', .f., 7, .f., 9, .f., 11 }, ;
    { '19.1.7', .f., 7, .f., 9, .f., 11 }, ;
    { '19.1.6', .f., 7, .f., 9, .f., 11 }, ;
    { '19.1.37', .f., 7, .f., 9, .f., 11 }, ;
    { '19.3.1', .f., 7, .f., 9, .f., 11 }, ;
    { '20.2.4', .f., 7, .f., 9, .f., 11 }, ;
    { '22.1.2', .f., 7, .f., 9, .f., 11 }, ;
    { '19.1.38', .f., 7, .f., 9, .f., 11 }, ;
    { '19.6.1', .f., 7, .f., 9, .f., 10 }, ;
    { '19.2.2', .f., 5, .f., 5, .f., 1 } ;
    }, ;
    { ;     // заболевания периферической нервной системы
    { '2.6.13', .t., 1, .t., 1, .t., 1 }, ;
    { '2.6.17', .f., 1, .f., 1, .f., 1 }, ;
    { '2.6.18', .f., 1, .f., 1, .f., 1 }, ;
    { '2.6.14', .t., 1, .t., 2, .t., 2 }, ;
    { '2.6.5',   .t., 1, .t., 1, .t., 1 }, ;
    { '2.6.6',   .f., 1, .f., 2, .t., 2 }, ;
    { '2.6.7',   .t., 1, .t., 1, .t., 1 }, ;
    { '2.6.8',   .f., 1, .t., 1, .t., 2 }, ;
    { '2.6.19', .f., 1, .f., 1, .f., 1 }, ;
    { '2.6.20', .f., 1, .f., 1, .f., 1 }, ;
    { '4.11.136', .t., 1, .t., 1, .t., 1 }, ;
    { '4.2.153', .t., 1, .t., 1, .t., 1 }, ;
    { '13.1.1', .t., 1, .t., 1, .t., 1 }, ;
    { '3.4.31', .f., 1, .f., 1, .f., 1 }, ;
    { '14.2.3', .f., 1, .f., 1, .f., 1 }, ;
    { '7.12.7', .f., 1, .f., 1, .f., 1 }, ;
    { '7.2.2',   .f., 1, .f., 1, .f., 1 }, ;
    { '20.1.6', .t., 9, .t., 11, .t., 13 }, ;
    { '20.2.1', .f., 6, .f., 11, .f., 13 }, ;
    { '21.1.6', .f., 7, .f., 9, .f., 11 }, ;
    { '19.1.2', .f., 7, .f., 9, .f., 11 }, ;
    { '19.1.5', .f., 7, .f., 9, .f., 11 }, ;
    { '19.1.36', .f., 7, .f., 9, .f., 11 }, ;
    { '19.1.30', .f., 7, .f., 9, .f., 11 }, ;
    { '19.1.29', .f., 7, .f., 9, .f., 11 }, ;
    { '19.1.33', .f., 7, .f., 9, .f., 11 }, ;
    { '19.1.34', .f., 7, .f., 9, .f., 11 }, ;
    { '19.1.35', .f., 7, .f., 9, .f., 11 }, ;
    { '19.1.9', .f., 7, .f., 9, .f., 11 }, ;
    { '19.7.1', .f., 7, .f., 9, .f., 11 }, ;
    { '19.1.7', .f., 7, .f., 9, .f., 11 }, ;
    { '19.1.6', .f., 7, .f., 9, .f., 11 }, ;
    { '19.1.37', .f., 7, .f., 9, .f., 11 }, ;
    { '19.3.1', .f., 7, .f., 9, .f., 11 }, ;
    { '20.2.4', .f., 7, .f., 9, .f., 11 }, ;
    { '22.1.2', .f., 7, .f., 9, .f., 11 }, ;
    { '19.1.38', .f., 7, .f., 9, .f., 11 }, ;
    { '19.6.1', .f., 7, .f., 9, .f., 10 }, ;
    { '19.2.2', .f., 5, .f., 5, .f., 1 } ;
    }, ;
    { ;     // заболевания органов дыхания, после COVID-19
    { '2.6.17', .t., 1, .t., 1, .t., 1 }, ;
    { '2.6.18', .t., 1, .t., 1, .t., 2 }, ;
    { '2.6.5', .t., 1, .t., 1, .t., 1 }, ;
    { '2.6.6', .f., 1, .f., 1, .f., 2 }, ;
    { '2.6.7', .t., 1, .t., 1, .t., 1 }, ;
    { '2.6.8', .f., 1, .f., 1, .f., 2 }, ;
    { '2.6.19', .t., 1, .t., 1, .t., 1 }, ;
    { '2.6.20', .t., 1, .t., 1, .t., 2 }, ;
    { '4.11.136', .t., 1, .t., 1, .t., 1 }, ;
    { '4.2.153', .t., 1, .t., 1, .t., 1 }, ;
    { '16.1.17', .t., 2, .t., 2, .t., 2 }, ;
    { '16.1.18', .t., 2, .t., 10, .t., 11 }, ;
    { '13.1.1', .t., 1, .t., 1, .t., 1 }, ;
    { '20.1.5', .t., 7, .t., 10, .t., 11 }, ;
    { '20.2.5', .f., 5, .f., 9, .f., 10 }, ;
    { '19.1.2', .f., 7, .f., 9, .f., 11 }, ;
    { '19.1.31', .f., 7, .f., 9, .f., 11 }, ;
    { '19.1.40', .f., 7, .f., 9, .f., 11 }, ;
    { '19.3.1', .f., 7, .f., 9, .f., 11 }, ;
    { '19.1.34', .f., 7, .f., 9, .f., 11 }, ;
    { '19.1.33', .f., 7, .f., 9, .f., 11 }, ;
    { '19.1.36', .f., 7, .f., 9, .f., 11 }, ;
    { '19.1.6', .f., 7, .f., 9, .f., 11 }, ;
    { '19.1.30', .f., 8, .f., 10, .f., 11 }, ;
    { '19.7.1', .f., 8, .f., 10, .f., 11 } ;
    }, ;
    { ;     // заболевания органов дыхания
    { '2.6.17',   .t., 1, .t., 1, .t., 1 }, ;
    { '2.6.18', .t., 1, .t., 1, .t., 2 }, ;
    { '2.6.5',   .t., 1, .t., 1, .t., 1 }, ;
    { '2.6.6',   .f., 1, .f., 2, .f., 2 }, ;
    { '2.6.7',   .t., 1, .t., 1, .t., 1 }, ;
    { '2.6.8',   .f., 1, .f., 2, .f., 2 }, ;
    { '2.6.19', .t., 1, .t., 1, .t., 1 }, ;
    { '2.6.20', .t., 1, .t., 1, .t., 2 }, ;
    { '4.11.136', .t., 1, .t., 1, .t., 1 }, ;
    { '4.2.153', .t., 1, .t., 1, .t., 1 }, ;
    { '16.1.17', .t., 2, .t., 2, .t., 2 }, ;
    { '16.1.18', .t., 2, .t., 5, .t., 9 }, ;
    { '13.1.1', .t., 1, .t., 1, .t., 1 }, ;
    { '20.1.5', .t., 8, .t., 9, .t., 11 }, ;
    { '20.2.5', .f., 7, .f., 9, .f., 11 }, ;
    { '21.1.5', .f., 7, .f., 9, .f., 11 }, ;
    { '19.6.2', .f., 7, .f., 9, .f., 11 }, ;
    { '19.1.2', .f., 7, .f., 9, .f., 11 }, ;
    { '19.1.31', .f., 7, .f., 9, .f., 11 }, ;
    { '19.1.40', .f., 7, .f., 9, .f., 11 }, ;
    { '19.3.1', .f., 7, .f., 9, .f., 11 }, ;
    { '19.2.2', .f., 7, .f., 9, .f., 11 }, ;
    { '19.7.1', .f., 7, .f., 9, .f., 11 }, ;
    { '22.2.1', .f., 7, .f., 9, .f., 11 }, ;
    { '19.1.39', .f., 7, .f., 9, .f., 11 }, ;
    { '19.1.36', .f., 8, .f., 10, .f., 11 }, ;
    { '19.1.30', .f., 8, .f., 10, .f., 11 }, ;
    { '19.1.33', .f., 8, .f., 10, .f., 11 }, ;
    { '19.1.34', .f., 8, .f., 10, .f., 11 }, ;
    { '19.1.6', .f., 8, .f., 10, .f., 11 } ;
    }, ;
    { ;     // онкологические заболевания
    { '2.6.3',   .t., 1, .t., 1, .t., 1 }, ;
    { '2.6.4',   .t., 1, .t., 1, .t., 1 }, ;
    { '2.6.5',   .t., 1, .t., 1, .t., 1 }, ;
    { '2.6.6',   .t., 1, .t., 1, .t., 1 }, ;
    { '2.6.7',   .t., 1, .t., 1, .t., 1 }, ;
    { '2.6.8',   .t., 1, .t., 1, .t., 1 }, ;
    { '2.6.21', .f., 3, .f., 3, nil, nil, }, ;
    { '20.1.4', .t., 10, .t., 10, .f., 10 }, ;
    { '21.1.4', .f., 10, .f., 10, .f., 10 }, ;
    { '19.1.5', .f., 10, .f., 10, .f., 10 }, ;
    { '19.1.30', .f., 10, nil, nil, .f., 10 }, ;
    { '19.5.19', nil, nil, .f., 10, .f., 10 }, ;
    { '19.7.1', nil, nil, .f., 10, .f., 10 }, ;
    { '19.2.1', nil, nil, .f., 10, .f., 10 }, ;
    { '19.1.2', nil, nil, nil, nil, .f., 10 }, ;
    { '21.2.1', nil, nil, nil, nil, .f., 10 }, ;
    { '19.1.3', nil, nil, nil, nil, .f., 10 }, ;
    { '19.5.1', nil, nil, nil, nil, .f., 10 }, ;
    { '19.1.6', nil, nil, nil, nil, .f., 10 }, ;
    { '19.1.1', nil, nil, nil, nil, .f., 10 } ;
    } ;
    }
  // { ;     // заболевания органов дыхания, после COVID-19 с использованием телемедицинских технологий
  // {'2.6.17', .t., 1, .t., 1, .t., 1}, ;
  // {'2.6.18', .t., 2, .t., 2, .t., 3}, ;
  // {'2.6.7',   .t., 1, .t., 1, .t., 1}, ;
  // {'2.6.8',   .f., 1, .f., 1, .f., 2}, ;
  // {'2.6.19', .t., 1, .t., 1, .t., 1}, ;
  // {'2.6.20', .t., 2, .t., 2, .t., 3}, ;
  // {'4.11.136',.t., 1, .t., 1, .t., 1}, ;
  // {'4.2.153', .t., 1, .t., 1, .t., 1}, ;
  // {'16.1.17', .t., 1, .t., 2, .t., 3}, ;
  // {'16.1.18', .t., 2, .t., 3, .t., 3}, ;
  // {'13.1.1', .t., 1, .t., 1, .t., 1}, ;
  // {'20.2.3', .t., 7, .t., 9, .t., 11}, ;
  // {'20.2.5', .f., 7, .f., 9, .f., 11} ;
  // }, ;
    local arr_uslugi_med_reab_vto := { ;  // с высокотехнологичным оборудованием
      { ;   // заболевания опорно-двигательного аппарата
      { '2.6.23', nil, nil, .t., 1, .t., 1 }, ;
      { '2.6.13', nil, nil, .f., 1, .f., 1 }, ;
      { '2.6.24', nil, nil, .t., 2, .t., 2 }, ;
      { '2.6.17', nil, nil, .f., 1, .f., 1 }, ;
      { '2.6.14', nil, nil, .f., 1, .f., 1 }, ;
      { '2.6.19', nil, nil, .f., 1, .f., 1 }, ;
      { '2.6.20', nil, nil, .t., 1, .t., 1 }, ;
      { '2.6.5',  nil, nil, .f., 1, .t., 2 }, ;
      { '2.6.6',  nil, nil, .f., 1, .t., 2 }, ;
      { '2.6.7',  nil, nil, .t., 1, .t., 1 }, ;
      { '2.6.8',  nil, nil, .f., 1, .t., 1 }, ;
      { '4.11.136', nil, nil, .t., 1, .t., 1 }, ;
      { '4.2.153', nil, nil, .t., 1, .t., 1 }, ;
      { '13.1.1', nil, nil, .t., 1, .t., 1 }, ;
      { '14.2.3', nil, nil, .f., 1, .f., 1 }, ;
      { '20.1.2', nil, nil, .t., 11, .t., 13 }, ;
      { '20.2.4', nil, nil, .t., 5, .t., 7 }, ;
      { '19.8.1', nil, nil, .t., 10, .t., 12 }, ;
      { '20.2.1', nil, nil, .f., 15, .f., 20 }, ;
      { '21.1.2', nil, nil, .f., 8, .f., 10 } ;
      }, ;
      { ;     // ССС
      { '2.6.17', nil, nil, .t., 1, .t., 1 }, ;
      { '2.6.18', nil, nil, .t., 1, .t., 1 }, ;
      { '2.6.5',   nil, nil, .t., 1, .t., 1 }, ;
      { '2.6.6',   nil, nil, .t., 1, .t., 2 }, ;
      { '2.6.7',   nil, nil, .t., 1, .t., 1 }, ;
      { '2.6.8',   nil, nil, .t., 1, .t., 2 }, ;
      { '2.6.23', nil, nil, .t., 1, .t., 1 }, ;
      { '2.6.24', nil, nil, .t., 2, .t., 2 }, ;
      { '4.11.136', nil, nil, .t., 1, .t., 1 }, ;
      { '4.2.153', nil, nil, .t., 1, .t., 1 }, ;
      { '13.1.1', nil, nil, .t., 2, .t., 3 }, ;
      { '20.1.3', nil, nil, .f., 8, .f., 10 }, ;
      { '20.2.2', nil, nil, .f., 5, .f., 7 }, ;
      { '19.8.1', nil, nil, .f., 10, .f., 12 }, ;
      { '20.2.1', nil, nil, .f., 12, .f., 15 }, ;
      { '21.1.3', nil, nil, .f., 6, .f., 8 } ;
      }, ;
      { ;     // заболевания центральной нервной системы
      { '2.6.23', nil, nil, .t., 1, .t., 1 }, ;
      { '2.6.17', nil, nil, .f., 1, .f., 1 }, ;
      { '2.6.18', nil, nil, .f., 1, .f., 1 }, ;
      { '2.6.24', nil, nil, .t., 2, .t., 2 }, ;
      { '2.6.5', nil, nil, .t., 1, .t., 1 }, ;
      { '2.6.6', nil, nil, .f., 2, .t., 2 }, ;
      { '2.6.7', nil, nil, .t., 1, .t., 1 }, ;
      { '2.6.8', nil, nil, .t., 1, .t., 2 }, ;
      { '2.6.19', nil, nil, .f., 1, .f., 1 }, ;
      { '2.6.20', nil, nil, .f., 1, .f., 1 }, ;
      { '4.11.136', nil, nil, .t., 1, .t., 1 }, ;
      { '4.2.153', nil, nil, .t., 1, .t., 1 }, ;
      { '13.1.1', nil, nil, .t., 1, .t., 1 }, ;
      { '20.1.1', nil, nil, .t., 10, .t., 12 }, ;
      { '20.2.4', nil, nil, .f., 5, .f., 7 }, ;
      { '19.8.1', nil, nil, .f., 10, .f., 15 }, ;
      { '20.2.1', nil, nil, .f., 15, .f., 20 }, ;
      { '21.1.1', nil, nil, .f., 8, .f., 10 } ;
      }, ;
      { ;     // заболевания периферической нервной системы
      { '2.6.23', nil, nil, .t., 1, .t., 1 }, ;
      { '2.6.17', nil, nil, .f., 1, .f., 1 }, ;
      { '2.6.18', nil, nil, .f., 1, .f., 1 }, ;
      { '2.6.24', nil, nil, .t., 2, .t., 2 }, ;
      { '2.6.5',   nil, nil, .t., 1, .t., 1 }, ;
      { '2.6.6',   nil, nil, .f., 1, .t., 2 }, ;
      { '2.6.7',   nil, nil, .t., 1, .t., 1 }, ;
      { '2.6.8',   nil, nil, .t., 1, .t., 2 }, ;
      { '2.6.19', nil, nil, .f., 1, .f., 1 }, ;
      { '2.6.20', nil, nil, .f., 1, .f., 1 }, ;
      { '4.11.136', nil, nil, .t., 1, .t., 1 }, ;
      { '4.2.153', nil, nil, .t., 1, .t., 1 }, ;
      { '13.1.1', nil, nil, .t., 1, .t., 1 }, ;
      { '20.1.6', nil, nil, .t., 10, .t., 12 }, ;
      { '20.2.4', nil, nil, .f., 5, .f., 7 }, ;
      { '19.8.1', nil, nil, .f., 10, .f., 12 }, ;
      { '20.2.1', nil, nil, .f., 12, .f., 15 }, ;
      { '21.1.6', nil, nil, .f., 8, .f., 10 } ;
      }, ;
      { ;     // заболевания органов дыхания, после COVID-19
      { '2.6.17', nil, nil, .t., 1, .t., 1 }, ;
      { '2.6.18', nil, nil, .t., 1, .t., 2 }, ;
      { '2.6.5', nil, nil, .t., 1, .t., 1 }, ;
      { '2.6.6', nil, nil, .f., 1, .f., 2 }, ;
      { '2.6.7', nil, nil, .t., 1, .t., 1 }, ;
      { '2.6.8', nil, nil, .f., 1, .f., 1 }, ;
      { '2.6.23', nil, nil, .t., 1, .t., 1 }, ;
      { '2.6.24', nil, nil, .t., 1, .t., 2 }, ;
      { '4.11.136', nil, nil, .t., 1, .t., 2 }, ;
      { '4.2.153', nil, nil, .t., 1, .t., 2 }, ;
      { '16.1.17', nil, nil, .t., 2, .t., 3 }, ;
      { '13.1.1', nil, nil, .t., 1, .t., 1 }, ;
      { '20.1.5', nil, nil, .t., 10, .t., 11 }, ;
      { '20.2.3', nil, nil, .f., 5, .f., 8 }, ;
      { '19.8.1', nil, nil, .f., 10, .f., 15 }, ;
      { '20.2.1', nil, nil, .f., 10, .f., 12 } ;
      }, ;
      { ;     // заболевания органов дыхания
      { '2.6.17',   nil, nil, .t., 1, .t., 1 }, ;
      { '2.6.18', nil, nil, .t., 1, .t., 2 }, ;
      { '2.6.5',   nil, nil, .t., 1, .t., 1 }, ;
      { '2.6.6',   nil, nil, .f., 2, .f., 2 }, ;
      { '2.6.7',   nil, nil, .t., 1, .t., 1 }, ;
      { '2.6.8',   nil, nil, .f., 2, .f., 2 }, ;
      { '2.6.23', nil, nil, .t., 1, .t., 1 }, ;
      { '2.6.24', nil, nil, .t., 2, .t., 2 }, ;
      { '4.11.136', nil, nil, .t., 1, .t., 1 }, ;
      { '4.2.153', nil, nil, .t., 1, .t., 1 }, ;
      { '13.1.1', nil, nil, .t., 1, .t., 1 }, ;
      { '20.1.5', nil, nil, .t., 11, .t., 13 }, ;
      { '20.2.3', nil, nil, .f., 8, .f., 11 }, ;
      { '19.8.1', nil, nil, .f., 10, .f., 15 }, ;
      { '20.2.1', nil, nil, .f., 10, .f., 12 }, ;
      { '21.1.5', nil, nil, .f., 8, .f., 9 } ;
      } ;
      }

  Local ret := {}, row
  local tmp_arr

  Default adult To .t.
  if vto == CHIP_NO
    tmp_arr := arr_uslugi_med_reab
  else
    tmp_arr := arr_uslugi_med_reab_vto
  endif
//  For Each row in arr_uslugi_med_reab[ vid ]
  For Each row in tmp_arr[ vid ]
    If adult // удаляем услуги педиатра
      If row[ 1 ] == '2.6.19' .or. row[ 1 ] == '2.6.20'
        Loop
      Endif
    Else // удаляем услуги терапевта
      If row[ 1 ] == '2.6.17' .or. row[ 1 ] == '2.6.18'
        Loop
      Endif
    Endif
    If row[ 2 * shrm ] != nil
      AAdd( ret, { row[ 1 ], row[ 2 * shrm ], row[ 2 * shrm + 1 ] } )
    Endif
  Next
  If Len( ret ) > 0
    ASort( ret,,, {| x, y| x[ 1 ] < y[ 1 ] } )
  Endif

  Return ret

// 28.02.24
Function ret_usluga_med_reab( shifr_usl, vid, shrm, adult, vto )

  Local ret, i

  Default adult To .t.
  Default vto to 0
  shifr_usl := Lower( AllTrim( shifr_usl ) )
  If !Empty( shifr_usl ) .and. ( ( i := AScan( ret_array_med_reab( vid, shrm, adult, vto ), {| x| Lower( AllTrim( x[ 1 ] ) ) == shifr_usl } ) ) > 0 )
    ret := ret_array_med_reab( vid, shrm, adult, vto )[ i ]
  Endif

  Return ret

// 21.05.22
Function is_lu_med_reab()

  Local ret := .f.

  ret := ( glob_otd[ 4 ] > 0 .and. glob_otd[ 4 ] == TIP_LU_MED_REAB )

  Return ret

// 07.10.23 обязательные услуги
Function compulsory_services( vid, shrm, adult, vto )

  Local aRet := {}, row

  default vto to 0
  For Each row in ret_array_med_reab( vid, shrm, adult, vto )
    If row[ 2 ]
      AAdd( aRet, row[ 1 ] )
    Endif
  Next

  Return aRet

// 29.05.22
Function mnogo_uslug_med_reab()
  Return { '19.', '20.', '21.', '22.' }
