#include 'inkey.ch'
#include '..\function.ch'
#include 'common.ch'
#include "..\edit_spr.ch"

static strCompanies := 'СПРАВОЧНИК МЕДИЦИНСКИХ УЧРЕЖДЕНИЙ'

* 25.12.20 вернуть массив регионов по справочнику регионов ТФОМС F010.xml
function f010()
    // F010.xml - Классификатор субъектов Российской Федерации
    //  1 - SUBNAME(C) 2 - KOD_TF(N)  3 - OKRUG(N)
    local _f010 := {}
    aadd(_f010, {"Республика Адыгея",1,2})
    aadd(_f010, {"Республика Башкортостан",2,7})
    aadd(_f010, {"Республика Бурятия",3,5})
    aadd(_f010, {"Республика Алтай",4,5})
    aadd(_f010, {"Республика Дагестан",5,8})
    aadd(_f010, {"Республика Ингушетия",6,8})
    aadd(_f010, {"Кабардино-Балкарская Республика",7,8})
    aadd(_f010, {"Республика Калмыкия",8,2})
    aadd(_f010, {"Карачаево-Черкесская Республика",9,8})
    aadd(_f010, {"Республика Карелия",10,3})
    aadd(_f010, {"Республика Коми",11,3})
    aadd(_f010, {"Республика Марий Эл",12,7})
    aadd(_f010, {"Республика Мордовия",13,7})
    aadd(_f010, {"Республика Саха (Якутия)",14,4})
    aadd(_f010, {"Республика Северная Осетия-Алания",15,8})
    aadd(_f010, {"Республика Татарстан",16,7})
    aadd(_f010, {"Республика Тыва",17,5})
    aadd(_f010, {"Удмуртская Республика",18,7})
    aadd(_f010, {"Республика Хакасия",19,5})
    aadd(_f010, {"Чеченская Республика",20,8})
    aadd(_f010, {"Чувашская Республика",21,7})
    aadd(_f010, {"Алтайский край",22,5})
    aadd(_f010, {"Краснодарский край",23,2})
    aadd(_f010, {"Красноярский край",24,5})
    aadd(_f010, {"Приморский край",25,4})
    aadd(_f010, {"Ставропольский край",26,8})
    aadd(_f010, {"Хабаровский край",27,4})
    aadd(_f010, {"Амурская область",28,4})
    aadd(_f010, {"Архангельская область",29,3})
    aadd(_f010, {"Астраханская область",30,2})
    aadd(_f010, {"Белгородская область",31,1})
    aadd(_f010, {"Брянская область",32,1})
    aadd(_f010, {"Владимирская область",33,1})
    aadd(_f010, {"Волгоградская область",34,2})
    aadd(_f010, {"Вологодская область",35,3})
    aadd(_f010, {"Воронежская область",36,1})
    aadd(_f010, {"Ивановская область",37,1})
    aadd(_f010, {"Иркутская область",38,5})
    aadd(_f010, {"Калининградская область",39,3})
    aadd(_f010, {"Калужская область",40,1})
    aadd(_f010, {"Камчатский край",41,4})
    aadd(_f010, {"Кемеровская область",42,5})
    aadd(_f010, {"Кировская область",43,7})
    aadd(_f010, {"Костромская область",44,1})
    aadd(_f010, {"Курганская область",45,6})
    aadd(_f010, {"Курская область",46,1})
    aadd(_f010, {"Ленинградская область",47,3})
    aadd(_f010, {"Липецкая область",48,1})
    aadd(_f010, {"Магаданская область",49,4})
    aadd(_f010, {"Московская область",50,1})
    aadd(_f010, {"Мурманская область",51,3})
    aadd(_f010, {"Нижегородская область",52,7})
    aadd(_f010, {"Новгородская область",53,3})
    aadd(_f010, {"Новосибирская область",54,5})
    aadd(_f010, {"Омская область",55,5})
    aadd(_f010, {"Оренбургская область",56,7})
    aadd(_f010, {"Орловская область",57,1})
    aadd(_f010, {"Пензенская область",58,7})
    aadd(_f010, {"Пермский край",59,7})
    aadd(_f010, {"Псковская область",60,3})
    aadd(_f010, {"Ростовская область",61,2})
    aadd(_f010, {"Рязанская область",62,1})
    aadd(_f010, {"Самарская область",63,7})
    aadd(_f010, {"Саратовская область",64,7})
    aadd(_f010, {"Сахалинская область",65,4})
    aadd(_f010, {"Свердловская область",66,6})
    aadd(_f010, {"Смоленская область",67,1})
    aadd(_f010, {"Тамбовская область",68,1})
    aadd(_f010, {"Тверская область",69,1})
    aadd(_f010, {"Томская область",70,5})
    aadd(_f010, {"Тульская область",71,1})
    aadd(_f010, {"Тюменская область",72,6})
    aadd(_f010, {"Ульяновская область",73,7})
    aadd(_f010, {"Челябинская область",74,6})
    aadd(_f010, {"Забайкальский край",75,5})
    aadd(_f010, {"Ярославская область",76,1})
    aadd(_f010, {"г. Москва",77,1})
    aadd(_f010, {"г. Санкт-Петербург",78,3})
    aadd(_f010, {"Еврейская АО",79,4})
    aadd(_f010, {"Ненецкий АО",80,3})
    aadd(_f010, {"Ханты-Мансийский АО",81,6})
    aadd(_f010, {"Чукотский АО",82,4})
    aadd(_f010, {"Ямало-Ненецкий АО",83,6})
    aadd(_f010, {"г. Байконур",84,0})
    aadd(_f010, {"Республика Крым",85,3})
    aadd(_f010, {"г. Севастополь",86,3})

    return _f010

* 14.01.21
Function viewF003()
    Local buf := savescreen()
    local nTop, nLeft, nBottom, nRight
    local l := 0, nChoice
    Local ar
    local ar_f010 := f010()

    ar := {}
    for i := 1 to len(ar_f010)
      aadd(ar, ar_f010[i,1])
      l := max(l,len(ar[i]))
    next

    nTop := 10
    nLeft := 10
    nBottom := 20
    nRight := nLeft + l

    nChoice := AChoice( 10, 10, 20, 10+l, ar )
    IF nChoice == 0
       ? "You did not choose an item"
    ELSE
       ? ;
          "You chose element", hb_ntos( nChoice ), ;
          "which has a value of", ar[ nChoice ]
    ENDIF    
    inkey(0)
    restscreen(buf)
    return NIL

    
* 25.12.20 выбор медицинского учреждения из списка
function viewF003_old()
    Local buf := savescreen()
    Local r1 := T_ROW
    Private pr1 := r1, pc1 := 5, pc2 := 75, fl_found := .t.
   

    // G_Use(dir_server+"f003",dir_server+"f003","F003")
    // Подготовка файла БД

    G_Use(dir_server+"f003",,"F003")
    index on substr(mcode,1,2) to (cur_dir+"tmp_f003")
    
    SET FILTER TO substr(F003->mcode,1,2) = "34"
    dbGoTop()
    Alpha_Browse(pr1,pc1,maxrow()-2,pc2,"f1_f003",color0,,,,,,,"f2_f003",,{,,,,.t.} )
    close databases
    
    restscreen(buf)
    return nil

* 29.12.20 ****
Function f1_f003(oBrow)
    Local oColumn
    oColumn := TBColumnNew(center("Наименование организации",30), {|| F003->short_name })
    oBrow:addColumn(oColumn)
    status_key("^<Esc>^ выход; ^<Enter>^ выбор учреждения; ^F2^ отбор по региону")
    return NIL
            

* 29.12.20 ****
Function f2_f003(nKey,oBrow)
    Local buf, fl := .f., rec, rec1, k := -1, r := maxrow()-7, tmp_color
    Local sh := 80, HH := 57
    do case
        case nKey == K_ESC
        case nKey == K_ENTER
        case nKey == K_F2
    endcase
    return k
    