#include "set.ch"
#include "function.ch"
#include "chip_mo.ch"

FUNCTION initPZarray()

   LOCAL nameArray
   LOCAL i, j, sbase

   PUBLIC glob_array_PZ_18 := { ;
      { 1, 207, "случай госпитализации ВМП 18-01", "ВМП-01", "к/д", "" }, ;
      { 2, 208, "случай госпитализации ВМП 18-02", "ВМП-02", "к/д", "" }, ;
      { 3, 209, "случай госпитализации ВМП 18-03", "ВМП-03", "к/д", "" }, ;
      { 4, 210, "случай госпитализации ВМП 18-04", "ВМП-04", "к/д", "" }, ;
      { 5, 211, "случай госпитализации ВМП 18-05", "ВМП-05", "к/д", "" }, ;
      { 6, 212, "случай госпитализации ВМП 18-06", "ВМП-06", "к/д", "" }, ;
      { 7, 213, "случай госпитализации ВМП 18-07", "ВМП-07", "к/д", "" }, ;
      { 8, 214, "случай госпитализации ВМП 18-08", "ВМП-08", "к/д", "" }, ;
      { 9, 215, "случай госпитализации ВМП 18-09", "ВМП-09", "к/д", "" }, ;
      { 10, 216, "случай госпитализации ВМП 18-10", "ВМП-10", "к/д", "" }, ;
      { 11, 217, "случай госпитализации ВМП 18-11", "ВМП-11", "к/д", "" }, ;
      { 12, 218, "случай госпитализации ВМП 18-12", "ВМП-12", "к/д", "" }, ;
      { 13, 219, "случай госпитализации ВМП 18-13", "ВМП-13", "к/д", "" }, ;
      { 14, 220, "случай госпитализации ВМП 18-14", "ВМП-14", "к/д", "" }, ;
      { 15, 221, "случай госпитализации ВМП 18-15", "ВМП-15", "к/д", "" }, ;
      { 16, 222, "случай госпитализации ВМП 18-16", "ВМП-16", "к/д", "" }, ;
      { 17, 223, "случай госпитализации ВМП 18-17", "ВМП-17", "к/д", "" }, ;
      { 18, 224, "случай госпитализации ВМП 18-18", "ВМП-18", "к/д", "" }, ;
      { 19, 225, "случай госпитализации ВМП 18-19", "ВМП-19", "к/д", "" }, ;
      { 20, 226, "случай госпитализации ВМП 18-20", "ВМП-20", "к/д", "" }, ;
      { 21, 227, "случай госпитализации ВМП 18-21", "ВМП-21", "к/д", "" }, ;
      { 22, 228, "случай госпитализации ВМП 18-22", "ВМП-22", "к/д", "" }, ;
      { 23, 229, "случай госпитализации ВМП 18-23", "ВМП-23", "к/д", "" }, ;
      { 24, 230, "случай госпитализации ВМП 18-24", "ВМП-24", "к/д", "" }, ;
      { 25, 231, "случай госпитализации ВМП 18-25", "ВМП-25", "к/д", "" }, ;
      { 26, 232, "случай госпитализации ВМП 18-26", "ВМП-26", "к/д", "" }, ;
      { 27, 233, "случай госпитализации ВМП 18-27", "ВМП-27", "к/д", "" }, ;
      { 28, 234, "случай госпитализации ВМП 18-28", "ВМП-28", "к/д", "" }, ;
      { 29, 235, "случай госпитализации ВМП 18-29", "ВМП-29", "к/д", "" }, ;
      { 30, 236, "случай госпитализации ВМП 18-30", "ВМП-30", "к/д", "" }, ;
      { 31, 237, "случай госпитализации ВМП 18-31", "ВМП-31", "к/д", "" }, ;
      { 32, 238, "случай госпитализации ВМП 18-32", "ВМП-32", "к/д", "" }, ;
      { 33, 239, "случай госпитализации ВМП 18-33", "ВМП-33", "к/д", "" }, ;
      { 34, 240, "случай госпитализации ВМП 18-34", "ВМП-34", "к/д", "" }, ;
      { 35, 241, "случай госпитализации ВМП 18-35", "ВМП-35", "к/д", "" }, ;
      { 36, 242, "случай госпитализации ВМП 18-36", "ВМП-36", "к/д", "" }, ;
      { 37, 243, "случай госпитализации ВМП 18-37", "ВМП-37", "к/д", "" }, ;
      { 38, 244, "случай госпитализации ВМП 18-38", "ВМП-38", "к/д", "" }, ;
      { 39, 245, "случай госпитализации ВМП 18-39", "ВМП-39", "к/д", "" }, ;
      { 40, 246, "случай госпитализации ВМП 18-40", "ВМП-40", "к/д", "" }, ;
      { 41, 247, "случай госпитализации ВМП 18-41", "ВМП-41", "к/д", "" }, ;
      { 42, 248, "случай госпитализации ВМП 18-42", "ВМП-42", "к/д", "" }, ;
      { 43, 249, "случай госпитализации ВМП 18-43", "ВМП-43", "к/д", "" }, ;
      { 44, 250, "случай госпитализации ВМП 18-44", "ВМП-44", "к/д", "" }, ;
      { 45, 251, "случай госпитализации ВМП 18-45", "ВМП-45", "к/д", "" }, ;
      { 46, 252, "случай госпитализации ВМП 18-46", "ВМП-46", "к/д", "" }, ;
      { 47, 253, "случай госпитализации ВМП 18-47", "ВМП-47", "к/д", "" }, ;
      { 48, 254, "случай госпитализации ВМП 18-48", "ВМП-48", "к/д", "" }, ;
      { 49, 255, "случай госпитализации ВМП 18-49", "ВМП-49", "к/д", "" }, ;
      { 50, 256, "случай госпитализации ВМП 18-50", "ВМП-50", "к/д", "" }, ;
      { 51, 257, "случай госпитализации ВМП 18-51", "ВМП-51", "к/д", "" }, ;
      { 52, 258, "случай госпитализации ВМП 18-52", "ВМП-52", "к/д", "" }, ;
      { 60, 26, "Вызов СМП", "вызовСМП", "", { "71.*" } }, ; //

   { 61, 29, "случай госпитализации", "случГоспит", "к/д", "" }, ; //
   { 62, 142, "случай госпитализации при реабилитации", "случГоспРеаб", "к/д", "" }, ; //
   { 63, 205, "обращение для ЗПТ", "обр.ЗПТ", "", "" }, ;
      { 64, 206, "резус-фактор плода", "р/ф плода", "", "" }, ;
      { 65, 141, "случай ЗПТ", "случайЗПТ", "", "" }, ;
      { 66, 143, "случай лечения", "случЛечения", "п/д", "" }, ;
      { 67, 259, "случай диализа", "случДиализа", "п/д", "" }, ; //
   { 68, 30, "Посещение профилактическое", "амбПрофил.", "", { "2.79.*", "2.81.*", "2.88.*" }, { "2.79.52", "2.79.53", "2.79.54", "2.79.55", "2.79.56", "2.79.57", "2.79.58", "2.88.40", "2.88.41", "2.88.42", "2.88.43", "2.88.44", "2.88.45" } }, ;
      { 69, 31, "Посещение неотложное", "амбНеотлож.", "", { "2.80.*", "2.82.*" }, { "2.80.29", "2.80.30", "2.80.31", "2.80.32", "2.80.33" } }, ;
      { 70, 32, "Обращение", "амбОбращен.", "", { "2.78.*", "2.89.*" }, { "2.78.47", "2.78.48", "2.78.49", "2.78.50", "2.78.51", "2.78.52", "2.78.53" } }, ;
      { 71, 38, "Посещение профилактическое Центра здоровья", "ПосПрофЦЗ", "", { "2.76.*" } }, ;
      { 72, 260, "комплексное посещение при диспансеризации", "ПосДиспанс.", "", "" }, ; //
   { 73, 261, "комплексное посещение при ДВН 1 этап", "ДВН 1", "", "" }, ; //
   { 74, 262, "комплексное посещение при ДВН 2 этап", "ДВН 2", "", "" }, ; //
   { 75, 145, "посещение профилактическое в стоматологии", "стомПроф.", "", "" }, ;
      { 76, 146, "посещение неотложное в стоматологии", "стомНеотл.", "", "" }, ;
      { 77, 147, "обращение в стоматологии", "стомОбращ.", "", "" }, ;
      { 78, 33, "Р-исследование", "Р-исслед.", "", { "60.2.*" } }, ;
      { 79, 153, "пренатальный скрининг", "ПренСкрининг", "", { "4.15.746" } }, ;
      { 80, 69, "жидкостная цитология", "ЖидкЦитология", "", { "4.20.702" } }, ;
      { 81, 148, "исследование биохимическое", "исслБиохим.", "", "" }, ;
      { 82, 149, "исследование гематологическое", "исслГематол.", "", "" }, ;
      { 83, 150, "исследование коагулогическое", "исслКоагул.", "", "" }, ;
      { 84, 151, "исследование ИХЛ", "исслИХЛ", "", "" }, ;
      { 85, 161, "исследование микробиологическое", "исслМикробиол", "", "" }, ;
      { 86, 162, "исследование ПЦР", "исслПЦР", "", "" };
      }

   PUBLIC glob_array_PZ_19 := { ;
      { 1, 263, "случай госпитализации ВМП 19-01", "ВМП-01", "к/д", "" }, ;
      { 2, 264, "случай госпитализации ВМП 19-02", "ВМП-02", "к/д", "" }, ;
      { 3, 265, "случай госпитализации ВМП 19-03", "ВМП-03", "к/д", "" }, ;
      { 4, 266, "случай госпитализации ВМП 19-04", "ВМП-04", "к/д", "" }, ;
      { 5, 267, "случай госпитализации ВМП 19-05", "ВМП-05", "к/д", "" }, ;
      { 6, 268, "случай госпитализации ВМП 19-06", "ВМП-06", "к/д", "" }, ;
      { 7, 269, "случай госпитализации ВМП 19-07", "ВМП-07", "к/д", "" }, ;
      { 8, 270, "случай госпитализации ВМП 19-08", "ВМП-08", "к/д", "" }, ;
      { 9, 271, "случай госпитализации ВМП 19-09", "ВМП-09", "к/д", "" }, ;
      { 10, 272, "случай госпитализации ВМП 19-10", "ВМП-10", "к/д", "" }, ;
      { 11, 273, "случай госпитализации ВМП 19-11", "ВМП-11", "к/д", "" }, ;
      { 12, 274, "случай госпитализации ВМП 19-12", "ВМП-12", "к/д", "" }, ;
      { 13, 275, "случай госпитализации ВМП 19-13", "ВМП-13", "к/д", "" }, ;
      { 14, 276, "случай госпитализации ВМП 19-14", "ВМП-14", "к/д", "" }, ;
      { 15, 277, "случай госпитализации ВМП 19-15", "ВМП-15", "к/д", "" }, ;
      { 16, 278, "случай госпитализации ВМП 19-16", "ВМП-16", "к/д", "" }, ;
      { 17, 279, "случай госпитализации ВМП 19-17", "ВМП-17", "к/д", "" }, ;
      { 18, 280, "случай госпитализации ВМП 19-18", "ВМП-18", "к/д", "" }, ;
      { 19, 281, "случай госпитализации ВМП 19-19", "ВМП-19", "к/д", "" }, ;
      { 20, 282, "случай госпитализации ВМП 19-20", "ВМП-20", "к/д", "" }, ;
      { 21, 283, "случай госпитализации ВМП 19-21", "ВМП-21", "к/д", "" }, ;
      { 22, 284, "случай госпитализации ВМП 19-22", "ВМП-22", "к/д", "" }, ;
      { 23, 285, "случай госпитализации ВМП 19-23", "ВМП-23", "к/д", "" }, ;
      { 24, 286, "случай госпитализации ВМП 19-24", "ВМП-24", "к/д", "" }, ;
      { 25, 287, "случай госпитализации ВМП 19-25", "ВМП-25", "к/д", "" }, ;
      { 26, 288, "случай госпитализации ВМП 19-26", "ВМП-26", "к/д", "" }, ;
      { 27, 289, "случай госпитализации ВМП 19-27", "ВМП-27", "к/д", "" }, ;
      { 28, 290, "случай госпитализации ВМП 19-28", "ВМП-28", "к/д", "" }, ;
      { 29, 291, "случай госпитализации ВМП 19-29", "ВМП-29", "к/д", "" }, ;
      { 30, 292, "случай госпитализации ВМП 19-30", "ВМП-30", "к/д", "" }, ;
      { 31, 293, "случай госпитализации ВМП 19-31", "ВМП-31", "к/д", "" }, ;
      { 32, 294, "случай госпитализации ВМП 19-32", "ВМП-32", "к/д", "" }, ;
      { 33, 295, "случай госпитализации ВМП 19-33", "ВМП-33", "к/д", "" }, ;
      { 34, 296, "случай госпитализации ВМП 19-34", "ВМП-34", "к/д", "" }, ;
      { 35, 297, "случай госпитализации ВМП 19-35", "ВМП-35", "к/д", "" }, ;
      { 36, 298, "случай госпитализации ВМП 19-36", "ВМП-36", "к/д", "" }, ;
      { 37, 299, "случай госпитализации ВМП 19-37", "ВМП-37", "к/д", "" }, ;
      { 38, 300, "случай госпитализации ВМП 19-38", "ВМП-38", "к/д", "" }, ;
      { 39, 301, "случай госпитализации ВМП 19-39", "ВМП-39", "к/д", "" }, ;
      { 40, 302, "случай госпитализации ВМП 19-40", "ВМП-40", "к/д", "" }, ;
      { 41, 303, "случай госпитализации ВМП 19-41", "ВМП-41", "к/д", "" }, ;
      { 42, 304, "случай госпитализации ВМП 19-42", "ВМП-42", "к/д", "" }, ;
      { 43, 305, "случай госпитализации ВМП 19-43", "ВМП-43", "к/д", "" }, ;
      { 44, 306, "случай госпитализации ВМП 19-44", "ВМП-44", "к/д", "" }, ;
      { 45, 307, "случай госпитализации ВМП 19-45", "ВМП-45", "к/д", "" }, ;
      { 46, 308, "случай госпитализации ВМП 19-46", "ВМП-46", "к/д", "" }, ;
      { 47, 309, "случай госпитализации ВМП 19-47", "ВМП-47", "к/д", "" }, ;
      { 48, 310, "случай госпитализации ВМП 19-48", "ВМП-48", "к/д", "" }, ;
      { 49, 311, "случай госпитализации ВМП 19-49", "ВМП-49", "к/д", "" }, ;
      { 50, 312, "случай госпитализации ВМП 19-50", "ВМП-50", "к/д", "" }, ;
      { 51, 313, "случай госпитализации ВМП 19-51", "ВМП-51", "к/д", "" }, ;
      { 52, 314, "случай госпитализации ВМП 19-52", "ВМП-52", "к/д", "" }, ;
      { 53, 315, "случай госпитализации ВМП 19-53", "ВМП-53", "к/д", "" }, ;
      { 54, 316, "случай госпитализации ВМП 19-54", "ВМП-54", "к/д", "" }, ;
      { 60, 26, "вызов СМП", "вызовСМП", "", "" }, ; //
   { 61, 29, "случай госпитализации", "случГоспит", "к/д", "" }, ; //
   { 62, 142, "случай госпитализации при реабилитации", "случГоспРеаб", "к/д", "" }, ; //
   { 63, 205, "обращение для ЗПТ", "обр.ЗПТ", "", "" }, ;
      { 64, 206, "резус-фактор плода", "р/ф плода", "", "" }, ;
      { 65, 141, "случай ЗПТ", "случайЗПТ", "", "" }, ;
      { 66, 143, "случай лечения", "случЛечения", "п/д", "" }, ;
      { 67, 259, "случай диализа", "случДиализа", "п/д", "" }, ; //
   { 68, 30, "посещение профилактическое", "амбПрофил.", "", "" }, ;
      { 69, 31, "посещение неотложное", "амбНеотлож.", "", "" }, ;
      { 70, 32, "обращение", "амбОбращен.", "", "" }, ;
      { 71, 38, "посещение профилактическое Центра здоровья", "ПосПрофЦЗ", "", "" }, ;
      { 72, 260, "комплексное посещение при диспансеризации", "ПосДиспанс.", "", "" }, ; //
   { 73, 261, "комплексное посещение при ДВН 1 этап", "ДВН 1", "", "" }, ; //
   { 74, 262, "комплексное посещение при ДВН 2 этап", "ДВН 2", "", "" }, ; //
   { 75, 145, "посещение профилактическое в стоматологии", "стомПроф.", "", "" }, ;
      { 76, 146, "посещение неотложное в стоматологии", "стомНеотл.", "", "" }, ;
      { 77, 147, "обращение в стоматологии", "стомОбращ.", "", "" }, ;
      { 78, 33, "Р-исследование", "Р-исслед.", "", "" }, ;
      { 79, 153, "пренатальный скрининг", "ПренСкрининг", "", "" }, ;
      { 80, 69, "жидкостная цитология", "ЖидкЦитология", "", "" }, ;
      { 81, 148, "исследование биохимическое", "исслБиохим.", "", "" }, ;
      { 82, 149, "исследование гематологическое", "исслГематол.", "", "" }, ;
      { 83, 150, "исследование коагулогическое", "исслКоагул.", "", "" }, ;
      { 84, 151, "исследование ИХЛ", "исслИХЛ", "", "" }, ;
      { 85, 161, "исследование микробиологическое", "исслМикробиол", "", "" }, ;
      { 86, 162, "исследование ПЦР", "исслПЦР", "", "" }, ;
      { 87, 317, "посещение профилактическое по ДН", "ДиспНаб.", "", "" };
      }

   PUBLIC glob_array_PZ_20 := { ;
      { 1, 330, "случай госпитализации ВМП 20-01", "ВМП-01", "к/д", "" }, ;
      { 2, 331, "случай госпитализации ВМП 20-02", "ВМП-02", "к/д", "" }, ;
      { 3, 332, "случай госпитализации ВМП 20-03", "ВМП-03", "к/д", "" }, ;
      { 4, 333, "случай госпитализации ВМП 20-04", "ВМП-04", "к/д", "" }, ;
      { 5, 334, "случай госпитализации ВМП 20-05", "ВМП-05", "к/д", "" }, ;
      { 6, 335, "случай госпитализации ВМП 20-06", "ВМП-06", "к/д", "" }, ;
      { 7, 336, "случай госпитализации ВМП 20-07", "ВМП-07", "к/д", "" }, ;
      { 8, 337, "случай госпитализации ВМП 20-08", "ВМП-08", "к/д", "" }, ;
      { 9, 338, "случай госпитализации ВМП 20-09", "ВМП-09", "к/д", "" }, ;
      { 10, 339, "случай госпитализации ВМП 20-10", "ВМП-10", "к/д", "" }, ;
      { 11, 340, "случай госпитализации ВМП 20-11", "ВМП-11", "к/д", "" }, ;
      { 12, 341, "случай госпитализации ВМП 20-12", "ВМП-12", "к/д", "" }, ;
      { 13, 342, "случай госпитализации ВМП 20-13", "ВМП-13", "к/д", "" }, ;
      { 14, 343, "случай госпитализации ВМП 20-14", "ВМП-14", "к/д", "" }, ;
      { 15, 344, "случай госпитализации ВМП 20-15", "ВМП-15", "к/д", "" }, ;
      { 16, 345, "случай госпитализации ВМП 20-16", "ВМП-16", "к/д", "" }, ;
      { 17, 346, "случай госпитализации ВМП 20-17", "ВМП-17", "к/д", "" }, ;
      { 18, 347, "случай госпитализации ВМП 20-18", "ВМП-18", "к/д", "" }, ;
      { 19, 348, "случай госпитализации ВМП 20-19", "ВМП-19", "к/д", "" }, ;
      { 20, 349, "случай госпитализации ВМП 20-20", "ВМП-20", "к/д", "" }, ;
      { 21, 350, "случай госпитализации ВМП 20-21", "ВМП-21", "к/д", "" }, ;
      { 22, 351, "случай госпитализации ВМП 20-22", "ВМП-22", "к/д", "" }, ;
      { 23, 352, "случай госпитализации ВМП 20-23", "ВМП-23", "к/д", "" }, ;
      { 24, 353, "случай госпитализации ВМП 20-24", "ВМП-24", "к/д", "" }, ;
      { 25, 354, "случай госпитализации ВМП 20-25", "ВМП-25", "к/д", "" }, ;
      { 26, 355, "случай госпитализации ВМП 20-26", "ВМП-26", "к/д", "" }, ;
      { 27, 356, "случай госпитализации ВМП 20-27", "ВМП-27", "к/д", "" }, ;
      { 28, 357, "случай госпитализации ВМП 20-28", "ВМП-28", "к/д", "" }, ;
      { 29, 358, "случай госпитализации ВМП 20-29", "ВМП-29", "к/д", "" }, ;
      { 30, 359, "случай госпитализации ВМП 20-30", "ВМП-30", "к/д", "" }, ;
      { 31, 360, "случай госпитализации ВМП 20-31", "ВМП-31", "к/д", "" }, ;
      { 32, 361, "случай госпитализации ВМП 20-32", "ВМП-32", "к/д", "" }, ;
      { 33, 362, "случай госпитализации ВМП 20-33", "ВМП-33", "к/д", "" }, ;
      { 34, 363, "случай госпитализации ВМП 20-34", "ВМП-34", "к/д", "" }, ;
      { 35, 364, "случай госпитализации ВМП 20-35", "ВМП-35", "к/д", "" }, ;
      { 36, 365, "случай госпитализации ВМП 20-36", "ВМП-36", "к/д", "" }, ;
      { 37, 366, "случай госпитализации ВМП 20-37", "ВМП-37", "к/д", "" }, ;
      { 38, 367, "случай госпитализации ВМП 20-38", "ВМП-38", "к/д", "" }, ;
      { 39, 368, "случай госпитализации ВМП 20-39", "ВМП-39", "к/д", "" }, ;
      { 40, 369, "случай госпитализации ВМП 20-40", "ВМП-40", "к/д", "" }, ;
      { 41, 370, "случай госпитализации ВМП 20-41", "ВМП-41", "к/д", "" }, ;
      { 42, 371, "случай госпитализации ВМП 20-42", "ВМП-42", "к/д", "" }, ;
      { 43, 372, "случай госпитализации ВМП 20-43", "ВМП-43", "к/д", "" }, ;
      { 44, 373, "случай госпитализации ВМП 20-44", "ВМП-44", "к/д", "" }, ;
      { 45, 374, "случай госпитализации ВМП 20-45", "ВМП-45", "к/д", "" }, ;
      { 46, 375, "случай госпитализации ВМП 20-46", "ВМП-46", "к/д", "" }, ;
      { 47, 376, "случай госпитализации ВМП 20-47", "ВМП-47", "к/д", "" }, ;
      { 48, 377, "случай госпитализации ВМП 20-48", "ВМП-48", "к/д", "" }, ;
      { 49, 378, "случай госпитализации ВМП 20-49", "ВМП-49", "к/д", "" }, ;
      { 50, 379, "случай госпитализации ВМП 20-50", "ВМП-50", "к/д", "" }, ;
      { 51, 380, "случай госпитализации ВМП 20-51", "ВМП-51", "к/д", "" }, ;
      { 52, 381, "случай госпитализации ВМП 20-52", "ВМП-52", "к/д", "" }, ;
      { 53, 382, "случай госпитализации ВМП 20-53", "ВМП-53", "к/д", "" }, ;
      { 54, 383, "случай госпитализации ВМП 20-54", "ВМП-54", "к/д", "" }, ;
      { 55, 384, "случай госпитализации ВМП 20-55", "ВМП-55", "к/д", "" }, ;
      { 56, 385, "случай госпитализации ВМП 20-56", "ВМП-56", "к/д", "" }, ;
      { 57, 386, "случай госпитализации ВМП 20-57", "ВМП-57", "к/д", "" }, ;
      { 60, 26, "вызов СМП", "вызовСМП", "", "" }, ; //
   { 61, 29, "случай госпитализации", "случГоспит", "к/д", "" }, ; //
   { 62, 142, "случай госпитализации при реабилитации", "случГоспРеаб", "к/д", "" }, ; //
   { 63, 205, "обращение для ЗПТ", "обр.ЗПТ", "", "" }, ;
      { 64, 206, "резус-фактор плода", "р/ф плода", "", "" }, ;  // {65,141,"случай ЗПТ","случайЗПТ","",""},;
   { 66, 143, "случай лечения", "случЛечения", "п/д", "" }, ;
      { 67, 259, "случай диализа", "случДиализа", "п/д", "" }, ; //
   { 68, 30, "посещение профилактическое", "амбПрофил.", "", "" }, ;
      { 69, 31, "посещение неотложное", "амбНеотлож.", "", "" }, ;
      { 70, 32, "обращение", "амбОбращен.", "", "" }, ;
      { 71, 38, "посещение профилактическое Центра здоровья", "ПосПрофЦЗ", "", "" }, ; // {72,260,"комплексное посещение при диспансеризации","ПосДиспанс.","",""},; //
   { 73, 261, "комплексное посещение при ДВН 1 этап", "ДВН 1", "", "" }, ; //
   { 74, 262, "комплексное посещение при ДВН 2 этап", "ДВН 2", "", "" }, ; //
   { 75, 145, "посещение профилактическое в стоматологии", "стомПроф.", "", "" }, ;
      { 76, 146, "посещение неотложное в стоматологии", "стомНеотл.", "", "" }, ;
      { 77, 147, "обращение в стоматологии", "стомОбращ.", "", "" }, ;
      { 79, 153, "пренатальный скрининг", "ПренСкрининг", "", "" }, ;
      { 80, 69, "жидкостная цитология", "ЖидкЦитология", "", "" }, ;
      { 81, 148, "исследование биохимическое", "исслБиохим.", "", "" }, ;
      { 82, 149, "исследование гематологическое", "исслГематол.", "", "" }, ;
      { 83, 150, "исследование коагулогическое", "исслКоагул.", "", "" }, ;
      { 84, 151, "исследование ИХЛ", "исслИХЛ", "", "" }, ;
      { 85, 161, "исследование микробиологическое", "исслМикробиол", "", "" }, ;
      { 86, 162, "исследование ПЦР", "исслПЦР", "", "" }, ;  // {87,317,"посещение профилактическое по ДН","ДиспНаб.","",""};
   { 87, 318, "комплексное посещение при ПОВН", "ПОВН", "", "" }, ;
      { 88, 319, "комплексное посещение при ПОД", "ПОД", "", "" }, ;
      { 89, 320, "комплексное посещение при ДДУ", "ДДУ", "", "" }, ;
      { 90, 321, "комплексное посещение при ДДС", "ДДС", "", "" }, ;
      { 91, 322, "обращение в ЦАОП", "ЦАОПобращ", "", "" }, ;
      { 92, 323, "обращение для реабилитации", "реабОбращ", "", "" }, ;
      { 93, 324, "КТ", "КТ", "", "" }, ;
      { 94, 325, "МРТ", "МРТ", "", "" }, ;
      { 95, 326, "УЗИ ССС", "УЗИ ССС", "", "" }, ;
      { 96, 327, "эндоскопия", "эндоскопия", "", "" }, ;
      { 97, 328, "гистология", "гистология", "", "" }, ;
      { 98, 329, "МГИ", "МГИ", "", "" }, ;
      { 99, 387, "исследование ИХГ", "исследование ИХГ", "", "" };
      }

   PUBLIC glob_array_PZ_21 := { ;
      { 1, 389, "случай госпитализации ВМП 21-01", "ВМП-01", "к/д", "" }, ;
      { 2, 390, "случай госпитализации ВМП 21-02", "ВМП-02", "к/д", "" }, ;
      { 3, 391, "случай госпитализации ВМП 21-03", "ВМП-03", "к/д", "" }, ;
      { 4, 392, "случай госпитализации ВМП 21-04", "ВМП-04", "к/д", "" }, ;
      { 5, 393, "случай госпитализации ВМП 21-05", "ВМП-05", "к/д", "" }, ;
      { 6, 394, "случай госпитализации ВМП 21-06", "ВМП-06", "к/д", "" }, ;
      { 7, 395, "случай госпитализации ВМП 21-07", "ВМП-07", "к/д", "" }, ;
      { 8, 396, "случай госпитализации ВМП 21-08", "ВМП-08", "к/д", "" }, ;
      { 9, 397, "случай госпитализации ВМП 21-09", "ВМП-09", "к/д", "" }, ;
      { 10, 398, "случай госпитализации ВМП 21-10", "ВМП-10", "к/д", "" }, ;
      { 11, 399, "случай госпитализации ВМП 21-11", "ВМП-11", "к/д", "" }, ;
      { 12, 400, "случай госпитализации ВМП 21-12", "ВМП-12", "к/д", "" }, ;
      { 13, 401, "случай госпитализации ВМП 21-13", "ВМП-13", "к/д", "" }, ;
      { 14, 402, "случай госпитализации ВМП 21-14", "ВМП-14", "к/д", "" }, ;
      { 15, 403, "случай госпитализации ВМП 21-15", "ВМП-15", "к/д", "" }, ;
      { 16, 404, "случай госпитализации ВМП 21-16", "ВМП-16", "к/д", "" }, ;
      { 17, 405, "случай госпитализации ВМП 21-17", "ВМП-17", "к/д", "" }, ;
      { 18, 406, "случай госпитализации ВМП 21-18", "ВМП-18", "к/д", "" }, ;
      { 19, 407, "случай госпитализации ВМП 21-19", "ВМП-19", "к/д", "" }, ;
      { 20, 408, "случай госпитализации ВМП 21-20", "ВМП-20", "к/д", "" }, ;
      { 21, 409, "случай госпитализации ВМП 21-21", "ВМП-21", "к/д", "" }, ;
      { 22, 410, "случай госпитализации ВМП 21-22", "ВМП-22", "к/д", "" }, ;
      { 23, 411, "случай госпитализации ВМП 21-23", "ВМП-23", "к/д", "" }, ;
      { 24, 412, "случай госпитализации ВМП 21-24", "ВМП-24", "к/д", "" }, ;
      { 25, 413, "случай госпитализации ВМП 21-25", "ВМП-25", "к/д", "" }, ;
      { 26, 414, "случай госпитализации ВМП 21-26", "ВМП-26", "к/д", "" }, ;
      { 27, 415, "случай госпитализации ВМП 21-27", "ВМП-27", "к/д", "" }, ;
      { 28, 416, "случай госпитализации ВМП 21-28", "ВМП-28", "к/д", "" }, ;
      { 29, 417, "случай госпитализации ВМП 21-29", "ВМП-29", "к/д", "" }, ;
      { 30, 418, "случай госпитализации ВМП 21-30", "ВМП-30", "к/д", "" }, ;
      { 31, 419, "случай госпитализации ВМП 21-31", "ВМП-31", "к/д", "" }, ;
      { 32, 420, "случай госпитализации ВМП 21-32", "ВМП-32", "к/д", "" }, ;
      { 33, 421, "случай госпитализации ВМП 21-33", "ВМП-33", "к/д", "" }, ;
      { 34, 422, "случай госпитализации ВМП 21-34", "ВМП-34", "к/д", "" }, ;
      { 35, 423, "случай госпитализации ВМП 21-35", "ВМП-35", "к/д", "" }, ;
      { 36, 424, "случай госпитализации ВМП 21-36", "ВМП-36", "к/д", "" }, ;
      { 37, 425, "случай госпитализации ВМП 21-37", "ВМП-37", "к/д", "" }, ;
      { 38, 426, "случай госпитализации ВМП 21-38", "ВМП-38", "к/д", "" }, ;
      { 39, 427, "случай госпитализации ВМП 21-39", "ВМП-39", "к/д", "" }, ;
      { 40, 428, "случай госпитализации ВМП 21-40", "ВМП-40", "к/д", "" }, ;
      { 41, 429, "случай госпитализации ВМП 21-41", "ВМП-41", "к/д", "" }, ;
      { 42, 430, "случай госпитализации ВМП 21-42", "ВМП-42", "к/д", "" }, ;
      { 43, 431, "случай госпитализации ВМП 21-43", "ВМП-43", "к/д", "" }, ;
      { 44, 432, "случай госпитализации ВМП 21-44", "ВМП-44", "к/д", "" }, ;
      { 45, 433, "случай госпитализации ВМП 21-45", "ВМП-45", "к/д", "" }, ;
      { 46, 434, "случай госпитализации ВМП 21-46", "ВМП-46", "к/д", "" }, ;
      { 47, 435, "случай госпитализации ВМП 21-47", "ВМП-47", "к/д", "" }, ;
      { 48, 436, "случай госпитализации ВМП 21-48", "ВМП-48", "к/д", "" }, ;
      { 49, 437, "случай госпитализации ВМП 21-49", "ВМП-49", "к/д", "" }, ;
      { 50, 438, "случай госпитализации ВМП 21-50", "ВМП-50", "к/д", "" }, ;
      { 51, 439, "случай госпитализации ВМП 21-51", "ВМП-51", "к/д", "" }, ;
      { 52, 440, "случай госпитализации ВМП 21-52", "ВМП-52", "к/д", "" }, ;
      { 53, 441, "случай госпитализации ВМП 21-53", "ВМП-53", "к/д", "" }, ;
      { 54, 442, "случай госпитализации ВМП 21-54", "ВМП-54", "к/д", "" }, ;
      { 55, 443, "случай госпитализации ВМП 21-55", "ВМП-55", "к/д", "" }, ;
      { 56, 444, "случай госпитализации ВМП 21-56", "ВМП-56", "к/д", "" }, ;
      { 57, 445, "случай госпитализации ВМП 21-57", "ВМП-57", "к/д", "" }, ;
      { 58, 446, "случай госпитализации ВМП 21-58", "ВМП-58", "к/д", "" }, ;  // НОВЫЙ
   { 59, 447, "УД 1 этап", "УД 1", "", "" }, ;  // НОВЫЙ 21.10.21
   { 60, 26, "вызов СМП", "вызовСМП", "", "" }, ;                        // 1
      { 61, 29, "случай госпитализации", "случГоспит", "к/д", "" }, ;       // 1
      { 62, 142, "случай госпитализации при реабилитации", "случГоспРеаб", "к/д", "" }, ; // 1
   { 63, 205, "обращение для ЗПТ", "обр.ЗПТ", "", "" }, ;   // 1
      { 64, 206, "резус-фактор плода", "р/ф плода", "", "" }, ;  // 1   {65,141,"случай ЗПТ","случайЗПТ","",""},;
   { 65, 388, "исслелования на COVID-19", "COVID-19", "", "" }, ;   // НОВЫЙ
      { 66, 143, "случай лечения", "случЛечения", "п/д", "" }, ;  // 1
   { 67, 259, "случай диализа", "случДиализа", "п/д", "" }, ; // 1
   { 68, 30, "посещение профилактическое", "амбПрофил.", "", "" }, ;  // 1
   { 69, 31, "посещение неотложное", "амбНеотлож.", "", "" }, ;       // 1
      { 70, 32, "обращение", "амбОбращен.", "", "" }, ;                  // 1
      { 71, 38, "посещение профилактическое Центра здоровья", "ПосПрофЦЗ", "", "" }, ; // 1 // {72,260,"комплексное посещение при диспансеризации","ПосДиспанс.","",""},; //
   { 72, 448, "УД 2 этап", "УД 2", "", "" }, ; // НОВЫЙ 21.10.21
   { 73, 261, "комплексное посещение при ДВН 1 этап", "ДВН 1", "", "" }, ; // 1
   { 74, 262, "комплексное посещение при ДВН 2 этап", "ДВН 2", "", "" }, ; // 1
   { 75, 145, "посещение профилактическое в стоматологии", "стомПроф.", "", "" }, ; // 1
   { 76, 146, "посещение неотложное в стоматологии", "стомНеотл.", "", "" }, ;      // 1
      { 77, 147, "обращение в стоматологии", "стомОбращ.", "", "" }, ;                 // 1
      { 78, 449, "КТ (межбюджетный трансфер)", "KT", "", "" }, ; // НОВЫЙ 21.10.21
   { 79, 153, "пренатальный скрининг", "ПренСкрининг", "", "" }, ;                  // 1
      { 80, 69, "жидкостная цитология", "ЖидкЦитология", "", "" }, ;                  // 1
      { 81, 148, "исследование биохимическое", "исслБиохим.", "", "" }, ;              // 1
      { 82, 149, "исследование гематологическое", "исслГематол.", "", "" }, ;          // 1
      { 83, 150, "исследование коагулогическое", "исслКоагул.", "", "" }, ;            // 1
      { 84, 151, "исследование ИХЛ", "исслИХЛ", "", "" }, ;                            // 1
      { 85, 161, "исследование микробиологическое", "исслМикробиол", "", "" }, ;       // 1
      { 86, 162, "исследование ПЦР", "исслПЦР", "", "" }, ;  // 1 //  {87,317,"посещение профилактическое по ДН","ДиспНаб.","",""};
   { 87, 318, "комплексное посещение при ПОВН", "ПОВН", "", "" }, ;   // 1
      { 88, 319, "комплексное посещение при ПОД", "ПОД", "", "" }, ;     // 1
   { 89, 320, "комплексное посещение при ДДУ", "ДДУ", "", "" }, ;     // 1
      { 90, 321, "комплексное посещение при ДДС", "ДДС", "", "" }, ;     // 1
   { 91, 322, "обращение в ЦАОП", "ЦАОПобращ", "", "" }, ;            // 1
      { 92, 323, "обращение для реабилитации", "реабОбращ", "", "" }, ;  // 1
   { 93, 324, "КТ", "КТ", "", "" }, ;                                 // 1
      { 94, 325, "МРТ", "МРТ", "", "" }, ;                               // 1
      { 95, 326, "УЗИ ССС", "УЗИ ССС", "", "" }, ;                       // 1
      { 96, 327, "эндоскопия", "эндоскопия", "", "" }, ;                 // 1
      { 97, 328, "гистология", "гистология", "", "" }, ;                 // 1
      { 98, 329, "МГИ", "МГИ", "", "" }, ;                               // 1
      { 99, 387, "исследование ИХГ", "исследование ИХГ", "", "" };      // 1
      }

   PUBLIC glob_array_PZ_22 := { ;
      { 1, 451, "случай госпитализации ВМП 22-01", "ВМП-01", "к/д", "" }, ;
      { 2, 452, "случай госпитализации ВМП 22-02", "ВМП-02", "к/д", "" }, ;
      { 3, 453, "случай госпитализации ВМП 22-03", "ВМП-03", "к/д", "" }, ;
      { 4, 454, "случай госпитализации ВМП 22-04", "ВМП-04", "к/д", "" }, ;
      { 5, 455, "случай госпитализации ВМП 22-05", "ВМП-05", "к/д", "" }, ;
      { 6, 456, "случай госпитализации ВМП 22-06", "ВМП-06", "к/д", "" }, ;
      { 7, 457, "случай госпитализации ВМП 22-07", "ВМП-07", "к/д", "" }, ;
      { 8, 458, "случай госпитализации ВМП 22-08", "ВМП-08", "к/д", "" }, ;
      { 9, 459, "случай госпитализации ВМП 22-09", "ВМП-09", "к/д", "" }, ;
      { 10, 460, "случай госпитализации ВМП 22-10", "ВМП-10", "к/д", "" }, ;
      { 11, 461, "случай госпитализации ВМП 22-11", "ВМП-11", "к/д", "" }, ;
      { 12, 462, "случай госпитализации ВМП 22-12", "ВМП-12", "к/д", "" }, ;
      { 13, 463, "случай госпитализации ВМП 22-13", "ВМП-13", "к/д", "" }, ;
      { 14, 464, "случай госпитализации ВМП 22-14", "ВМП-14", "к/д", "" }, ;
      { 15, 465, "случай госпитализации ВМП 22-15", "ВМП-15", "к/д", "" }, ;
      { 16, 466, "случай госпитализации ВМП 22-16", "ВМП-16", "к/д", "" }, ;
      { 17, 467, "случай госпитализации ВМП 22-17", "ВМП-17", "к/д", "" }, ;
      { 18, 468, "случай госпитализации ВМП 22-18", "ВМП-18", "к/д", "" }, ;
      { 19, 469, "случай госпитализации ВМП 22-19", "ВМП-19", "к/д", "" }, ;
      { 20, 470, "случай госпитализации ВМП 22-20", "ВМП-20", "к/д", "" }, ;
      { 21, 471, "случай госпитализации ВМП 22-21", "ВМП-21", "к/д", "" }, ;
      { 22, 472, "случай госпитализации ВМП 22-22", "ВМП-22", "к/д", "" }, ;
      { 23, 473, "случай госпитализации ВМП 22-23", "ВМП-23", "к/д", "" }, ;
      { 24, 474, "случай госпитализации ВМП 22-24", "ВМП-24", "к/д", "" }, ;
      { 25, 475, "случай госпитализации ВМП 22-25", "ВМП-25", "к/д", "" }, ;
      { 26, 476, "случай госпитализации ВМП 22-26", "ВМП-26", "к/д", "" }, ;
      { 27, 477, "случай госпитализации ВМП 22-27", "ВМП-27", "к/д", "" }, ;
      { 28, 478, "случай госпитализации ВМП 22-28", "ВМП-28", "к/д", "" }, ;
      { 29, 479, "случай госпитализации ВМП 22-29", "ВМП-29", "к/д", "" }, ;
      { 30, 480, "случай госпитализации ВМП 22-30", "ВМП-30", "к/д", "" }, ;
      { 31, 481, "случай госпитализации ВМП 22-31", "ВМП-31", "к/д", "" }, ;
      { 32, 482, "случай госпитализации ВМП 22-32", "ВМП-32", "к/д", "" }, ;
      { 33, 483, "случай госпитализации ВМП 22-33", "ВМП-33", "к/д", "" }, ;
      { 34, 484, "случай госпитализации ВМП 22-34", "ВМП-34", "к/д", "" }, ;
      { 35, 485, "случай госпитализации ВМП 22-35", "ВМП-35", "к/д", "" }, ;
      { 36, 486, "случай госпитализации ВМП 22-36", "ВМП-36", "к/д", "" }, ;
      { 37, 487, "случай госпитализации ВМП 22-37", "ВМП-37", "к/д", "" }, ;
      { 38, 488, "случай госпитализации ВМП 22-38", "ВМП-38", "к/д", "" }, ;
      { 39, 489, "случай госпитализации ВМП 22-39", "ВМП-39", "к/д", "" }, ;
      { 40, 490, "случай госпитализации ВМП 22-40", "ВМП-40", "к/д", "" }, ;
      { 41, 491, "случай госпитализации ВМП 22-41", "ВМП-41", "к/д", "" }, ;
      { 42, 492, "случай госпитализации ВМП 22-42", "ВМП-42", "к/д", "" }, ;
      { 43, 493, "случай госпитализации ВМП 22-43", "ВМП-43", "к/д", "" }, ;
      { 44, 494, "случай госпитализации ВМП 22-44", "ВМП-44", "к/д", "" }, ;
      { 45, 495, "случай госпитализации ВМП 22-45", "ВМП-45", "к/д", "" }, ;
      { 46, 496, "случай госпитализации ВМП 22-46", "ВМП-46", "к/д", "" }, ;
      { 47, 497, "случай госпитализации ВМП 22-47", "ВМП-47", "к/д", "" }, ;
      { 48, 498, "случай госпитализации ВМП 22-48", "ВМП-48", "к/д", "" }, ;
      { 49, 499, "случай госпитализации ВМП 22-49", "ВМП-49", "к/д", "" }, ;
      { 50, 500, "случай госпитализации ВМП 22-50", "ВМП-50", "к/д", "" }, ;
      { 51, 501, "случай госпитализации ВМП 22-51", "ВМП-51", "к/д", "" }, ;
      { 52, 502, "случай госпитализации ВМП 22-52", "ВМП-52", "к/д", "" }, ;
      { 53, 503, "случай госпитализации ВМП 22-53", "ВМП-53", "к/д", "" }, ;
      { 54, 504, "случай госпитализации ВМП 22-54", "ВМП-54", "к/д", "" }, ;
      { 55, 505, "случай госпитализации ВМП 22-55", "ВМП-55", "к/д", "" }, ;
      { 56, 506, "случай госпитализации ВМП 22-56", "ВМП-56", "к/д", "" }, ;
      { 57, 507, "случай госпитализации ВМП 22-57", "ВМП-57", "к/д", "" }, ;
      { 58, 508, "случай госпитализации ВМП 22-58", "ВМП-58", "к/д", "" }, ; //
   { 59, 511, "Комплексное посещение при УД", "УД", "", "" }, ;           //
      { 60, 26, "вызов СМП", "вызовСМП", "", "" }, ;                        // 1
      { 61, 29, "случай госпитализации", "случГоспит", "к/д", "" }, ;       // 1
      { 62, 142, "случай госпитализации при реабилитации", "случГоспРеаб", "к/д", "" }, ; // 1
   { 63, 205, "обращение для ЗПТ", "обр.ЗПТ", "", "" }, ;                 // 1
      { 64, 206, "резус-фактор плода", "р/ф плода", "", "" }, ;              // 1
      { 65, 388, "исслелования на COVID-19", "COVID-19", "", "" }, ;         // 1
      { 66, 143, "случай лечения", "случЛечения", "п/д", "" }, ;             // 1
      { 67, 259, "случай диализа", "случДиализа", "п/д", "" }, ;             // 1
      { 68, 30, "посещение профилактическое", "амбПрофил.", "", "" }, ;  // 1
   { 69, 31, "посещение неотложное", "амбНеотлож.", "", "" }, ;       // 1
      { 70, 32, "обращение", "амбОбращен.", "", "" }, ;                  // 1
      { 71, 38, "посещение профилактическое Центра здоровья", "ПосПрофЦЗ", "", "" }, ; // 1
   { 72, 317, "посещение профилактическое по ДН", "ДН", "", "" }, ; // 1
   { 73, 261, "комплексное посещение при ДВН 1 этап", "ДВН 1", "", "" }, ;          // 1
      { 74, 262, "комплексное посещение при ДВН 2 этап", "ДВН 2", "", "" }, ;          // 1
      { 75, 145, "посещение профилактическое в стоматологии", "стомПроф.", "", "" }, ; // 1
   { 76, 146, "посещение неотложное в стоматологии", "стомНеотл.", "", "" }, ;      // 1
      { 77, 147, "обращение в стоматологии", "стомОбращ.", "", "" }, ;                 // 1
      { 78, 509, "случай госпитализации ВМП 22-59", "ВМП-59", "к/д", "" }, ;           // 1
      { 79, 153, "пренатальный скрининг", "ПренСкрининг", "", "" }, ;                  // 1
      { 80, 69, "жидкостная цитология", "ЖидкЦитология", "", "" }, ;                  // 1
      { 81, 148, "исследование биохимическое", "исслБиохим.", "", "" }, ;              // 1
      { 82, 149, "исследование гематологическое", "исслГематол.", "", "" }, ;          // 1
      { 83, 150, "исследование коагулогическое", "исслКоагул.", "", "" }, ;            // 1
      { 84, 151, "исследование ИХЛ", "исслИХЛ", "", "" }, ;                            // 1
      { 85, 161, "исследование микробиологическое", "исслМикробиол", "", "" }, ;       // 1
      { 86, 162, "исследование ПЦР", "исслПЦР", "", "" }, ;                            // 1
      { 87, 318, "комплексное посещение при ПОВН", "ПОВН", "", "" }, ;   // 1
   { 88, 319, "комплексное посещение при ПОД", "ПОД", "", "" }, ;     // 1
      { 89, 320, "комплексное посещение при ДДУ", "ДДУ", "", "" }, ;     // 1
   { 90, 321, "комплексное посещение при ДДС", "ДДС", "", "" }, ;     // 1
      { 91, 322, "обращение в ЦАОП", "ЦАОПобращ", "", "" }, ;            // 1
      { 92, 323, "обращение для реабилитации", "реабОбращ", "", "" }, ;  // 1
   { 93, 324, "КТ", "КТ", "", "" }, ;                                 // 1
      { 94, 325, "МРТ", "МРТ", "", "" }, ;                               // 1
      { 95, 326, "УЗИ ССС", "УЗИ ССС", "", "" }, ;                       // 1
      { 96, 327, "эндоскопия", "эндоскопия", "", "" }, ;                 // 1
      { 97, 328, "гистология", "гистология", "", "" }, ;                 // 1
      { 98, 329, "МГИ", "МГИ", "", "" }, ;                               // 1
      { 99, 387, "исследование ИХГ", "исследование ИХГ", "", "" };      // 1
      }

   FOR j := 2018 TO WORK_YEAR
      sbase :=  prefixFileRefName( j ) + 'unit'  // справочник на конкретный год
      nameArr := 'glob_array_PZ_' + last_digits_year( j )
      G_Use( exe_dir + sbase, cur_dir + sbase, 'UNIT' )
      FOR i := 1 TO Len( &nameArr )
         find ( Str( &nameArr.[ i, 2 ], 3 ) )
         IF Found() .AND. !( unit->pz == &nameArr.[ i, 1 ] .AND. unit->ii == i )
            G_RLock( forever )
            unit->pz := &nameArr.[ i, 1 ]
            unit->ii := i
         ENDIF
      NEXT
      unit->( dbCloseArea() )
   NEXT

   // // G_Use(exe_dir + sbase, cur_dir + sbase, 'UNIT')
   // // for i := 1 to len(glob_array_PZ_21)
   // //   find (str(glob_array_PZ_21[i,2],3))
   // //   if found() .and. !(unit->pz == glob_array_PZ_21[i,1] .and. unit->ii == i)
   // //     G_RLock(forever)
   // //     unit->pz := glob_array_PZ_21[i,1]
   // //     unit->ii := i
   // //   endif
   // // next

   // sbase :=  prefixFileRefName(WORK_YEAR) + 'unit'  // справочник на конкретный год
   // nameArr := 'glob_array_PZ_' + last_digits_year(WORK_YEAR)
   // G_Use(exe_dir + sbase, cur_dir + sbase, 'UNIT')
   // for i := 1 to len(&nameArr)
   // find (str(&nameArr.[i,2],3))
   // if found() .and. !(unit->pz == &nameArr.[i,1] .and. unit->ii == i)
   // G_RLock(forever)
   // unit->pz := &nameArr.[i,1]
   // unit->ii := i
   // endif
   // next
   // unit->(dbCloseArea())

   RETURN NIL
