#include 'common.ch'
#include 'inkey.ch'
#include 'function.ch'
#include 'edit_spr.ch'
#include 'chip_mo.ch'

// 17.04.24
Function get_array_plan_drz( nyear, mkod )

  // nyear - год на который нужен план
  // mkod - код мед учреждения
  Local nameArr := {}
  Local funcGetPZ, j, arr := {}

  If nyear >= 2024
    funcGetPZ := 'get_array_plan_drz_' + last_digits_year( nyear ) + '()'
    nameArr := &funcGetPZ
    If ( j := AScan( nameArr, {| x | x[ 1 ] == mkod } ) ) > 0
      AAdd( arr, nameArr[ j, 2 ] )  // план для мужчин
      AAdd( arr, nameArr[ j, 3 ] )  // план для женщин
    Endif
  Endif

  Return arr

// 17.04.24
Function get_array_plan_drz_24()

  Local arr

  arr := { ;
    { '340033', 1545, 1930, 'ГУЗ Поликлиника № 4' }, ;
    { '340041', 2532, 3467, 'ГУЗ Клиническая поликлиника № 28' }, ;
    { '340042', 1029, 1318, 'ГУЗ Поликлиника № 30' }, ;
    { '340050', 1597, 2214, 'ГУЗ Поликлиника № 5' }, ;
    { '340055', 1502, 1695, 'ГУЗ Больница № 16' }, ;
    { '340066', 2814, 3902, 'ГУЗ Поликлиника № 2' }, ;
    { '340075', 977, 1152, 'ГУЗ Клиническая больница № 11' }, ;
    { '340056', 991, 1028, 'ГУЗ Больница №22' }, ;
    { '340083', 2290, 3277, 'ГУЗ КП № 1' }, ;
    { '340104', 1733, 1744, 'ГБУЗ ГКБ № 1 им. С.З.Фишера' }, ;
    { '340096', 1473, 1946, 'ГАУЗ КП № 3' }, ;
    { '340106', 1593, 1612, 'ГБУЗ Городская больница № 2' }, ;
    { '340117', 306, 272, 'ГБУЗ Алексеевская ЦРБ' }, ;
    { '340118', 583, 373, 'ГБУЗ Быковская ЦРБ' }, ;
    { '340119', 1378, 1343, 'ГБУЗ Городищенская ЦРБ' }, ;
    { '340158', 297, 239, 'ГБУ ЦРБ Руднянского муниципального района' }, ;
    { '340120', 303, 272, 'ГБУЗ Даниловская ЦРБ' }, ;
    { '340126', 656, 602, 'ГБУЗ Иловлинская ЦРБ' }, ;
    { '340127', 1009, 1104, 'ГБУЗ Калачевская ЦРБ' }, ;
    { '340136', 314, 255, 'ГБУЗ Киквидзенская ЦРБ' }, ;
    { '340138', 604, 731, 'ГБУЗ Котельниковская ЦРБ' }, ;
    { '340157', 395, 342, 'ГБУЗ Кумылженская ЦРБ' }, ;
    { '340142', 588, 540, 'ГБУЗ Ленинская ЦРБ' }, ;
    { '340148', 264, 257, 'ГБУЗ Нехаевская ЦРБ' }, ;
    { '340149', 672, 451, 'ГБУЗ Николаевская ЦРБ' }, ;
    { '340150', 722, 654, 'ГБУЗ Новоаннинская ЦРБ' }, ;
    { '340151', 476, 447, 'ГБУЗ Новониколаевская ЦРБ' }, ;
    { '340152', 397, 452, 'ГБУЗ Октябрьская ЦРБ' }, ;
    { '340155', 807, 755, 'ГБУЗ Палласовская ЦРБ' }, ;
    { '340159', 791, 802, 'ГБУЗ Светлоярская ЦРБ' }, ;
    { '340160', 428, 341, 'ГБУЗ Серафимовичская ЦРБ' }, ;
    { '340161', 1095, 1092, 'ГБУЗ Среднеахтубинская ЦРБ' }, ;
    { '340163', 387, 359, 'ГБУЗ Старополтавская ЦРБ' }, ;
    { '340169', 927, 905, 'ГБУЗ Фроловская ЦРБ' }, ;
    { '340121', 514, 538, 'ГБУЗ ЦРБ Дубовского муниципального района' }, ;
    { '340137', 344, 301, 'ГБУЗ ЦРБ Клетского муниципального района' }, ;
    { '340153', 329, 288, 'ГБУЗ ЦРБ Ольховского муниципального района' }, ;
    { '340164', 668, 583, 'ГБУЗ ЦРБ Суровикинского муниципального района' }, ;
    { '340170', 319, 290, 'ГБУЗ Чернышковская ЦРБ' }, ;
    { '340122', 560, 543, 'ГБУЗ Еланская ЦРБ' }, ;
    { '340167', 1127, 1309, 'ГБУЗ Урюпинская ЦРБ' }, ;
    { '340140', 645, 629, 'ГБУЗ ЦРБ Котовского муниципального района' }, ;
    { '340124', 821, 699, 'ГУЗ Жирновская ЦРБ' }, ;
    { '340171', 805, 745, 'ЧУЗ КБ РЖД-Медицина г.Волгоград' }, ;
    { '340129', 944, 1024, 'ГБУЗ ЦГБ' }, ;
    { '340057', 915, 987, 'ГУЗ КБСМП № 15' }, ;
    { '340074', 909, 1194, 'КБ СМП № 7' }, ;
    { '340105', 1098, 992, 'ГБУЗ Городская клиническая больница №3' }, ;
    { '340109', 1338, 1643, 'ГБУЗ Городская поликлиника №5' } ;
    }

  Return arr

// 15.01.25
Function get_array_plan_drz_25()

  Local arr

  arr := { ;
    { '340033', 1545, 1930, 'ГУЗ Поликлиника № 4' }, ;
    { '340041', 2532, 3467, 'ГУЗ Клиническая поликлиника № 28' }, ;
    { '340042', 1029, 1318, 'ГУЗ Поликлиника № 30' }, ;
    { '340050', 1597, 2214, 'ГУЗ Поликлиника № 5' }, ;
    { '340055', 1502, 1695, 'ГУЗ Больница № 16' }, ;
    { '340066', 2814, 3902, 'ГУЗ Поликлиника № 2' }, ;
    { '340075', 977, 1152, 'ГУЗ Клиническая больница № 11' }, ;
    { '340056', 991, 1028, 'ГУЗ Больница №22' }, ;
    { '340083', 2290, 3277, 'ГУЗ КП № 1' }, ;
    { '340104', 1733, 1744, 'ГБУЗ ГКБ № 1 им. С.З.Фишера' }, ;
    { '340096', 1473, 1946, 'ГАУЗ КП № 3' }, ;
    { '340106', 1593, 1612, 'ГБУЗ Городская больница № 2' }, ;
    { '340117', 306, 272, 'ГБУЗ Алексеевская ЦРБ' }, ;
    { '340118', 583, 373, 'ГБУЗ Быковская ЦРБ' }, ;
    { '340119', 1378, 1343, 'ГБУЗ Городищенская ЦРБ' }, ;
    { '340158', 297, 239, 'ГБУ ЦРБ Руднянского муниципального района' }, ;
    { '340120', 303, 272, 'ГБУЗ Даниловская ЦРБ' }, ;
    { '340126', 656, 602, 'ГБУЗ Иловлинская ЦРБ' }, ;
    { '340127', 1009, 1104, 'ГБУЗ Калачевская ЦРБ' }, ;
    { '340136', 314, 255, 'ГБУЗ Киквидзенская ЦРБ' }, ;
    { '340138', 604, 731, 'ГБУЗ Котельниковская ЦРБ' }, ;
    { '340157', 395, 342, 'ГБУЗ Кумылженская ЦРБ' }, ;
    { '340142', 588, 540, 'ГБУЗ Ленинская ЦРБ' }, ;
    { '340148', 264, 257, 'ГБУЗ Нехаевская ЦРБ' }, ;
    { '340149', 672, 451, 'ГБУЗ Николаевская ЦРБ' }, ;
    { '340150', 722, 654, 'ГБУЗ Новоаннинская ЦРБ' }, ;
    { '340151', 476, 447, 'ГБУЗ Новониколаевская ЦРБ' }, ;
    { '340152', 397, 452, 'ГБУЗ Октябрьская ЦРБ' }, ;
    { '340155', 807, 755, 'ГБУЗ Палласовская ЦРБ' }, ;
    { '340159', 791, 802, 'ГБУЗ Светлоярская ЦРБ' }, ;
    { '340160', 428, 341, 'ГБУЗ Серафимовичская ЦРБ' }, ;
    { '340161', 1095, 1092, 'ГБУЗ Среднеахтубинская ЦРБ' }, ;
    { '340163', 387, 359, 'ГБУЗ Старополтавская ЦРБ' }, ;
    { '340169', 927, 905, 'ГБУЗ Фроловская ЦРБ' }, ;
    { '340121', 514, 538, 'ГБУЗ ЦРБ Дубовского муниципального района' }, ;
    { '340137', 344, 301, 'ГБУЗ ЦРБ Клетского муниципального района' }, ;
    { '340153', 329, 288, 'ГБУЗ ЦРБ Ольховского муниципального района' }, ;
    { '340164', 668, 583, 'ГБУЗ ЦРБ Суровикинского муниципального района' }, ;
    { '340170', 319, 290, 'ГБУЗ Чернышковская ЦРБ' }, ;
    { '340122', 560, 543, 'ГБУЗ Еланская ЦРБ' }, ;
    { '340167', 1127, 1309, 'ГБУЗ Урюпинская ЦРБ' }, ;
    { '340140', 645, 629, 'ГБУЗ ЦРБ Котовского муниципального района' }, ;
    { '340124', 821, 699, 'ГУЗ Жирновская ЦРБ' }, ;
    { '340171', 805, 745, 'ЧУЗ КБ РЖД-Медицина г.Волгоград' }, ;
    { '340129', 944, 1024, 'ГБУЗ ЦГБ' }, ;
    { '340057', 915, 987, 'ГУЗ КБСМП № 15' }, ;
    { '340074', 909, 1194, 'КБ СМП № 7' }, ;
    { '340105', 1098, 992, 'ГБУЗ Городская клиническая больница №3' }, ;
    { '340109', 1338, 1643, 'ГБУЗ Городская поликлиника №5' } ;
    }

  Return arr
